{"id":"AoI","name":"Imperial Agents","lastUpdate":"2026-02-17 13:32:38","detachments":[{"name":"Imperialis Fleet","rules":[{"name":"At all Costs","description":"At the start of your Command phase, you can select one of the following to apply:Eliminate At All CostsSelect one enemy unit on the battlefield. Until the start of your next Command phase, each time an AGENTS OF THE IMPERIUM model from your army makes an attack that targets that enemy unit, add 1 to the Hit roll.Acquire At All CostsSelect one objective marker on the battlefield. Until the start of your next Command phase, while an AGENTS OF THE IMPERIUM unit from your army is within range of that objective marker, improve the Leadership and Objective Control characteristics of models in that unit by 1 and models in that unit have a 5+ invulnerable save."}],"enhancements":[{"name":"Clandestine Operation","description":"AGENTS OF THE IMPERIUM model only. At the start of the Declare Battle Formations step, you can select up to three AGENTS OF THE IMPERIUM INFANTRy units from your army (excluding GREy KNIGHTS TERMINATOR SqUAD units) - those units gain the Infiltrators ability.","cost":"15"},{"name":"Combat Landers","description":"VOIDFARERS model only. At the start of the Declare Battle Formations step, you can select up to three VOIDFARERS units from your army - those units gain the Deep Strike ability.","cost":"10"},{"name":"Digital Weapons","description":"AGENTS OF THE IMPERIUM model only. Each time the bearer is selected to fight, roll three D6: for each 4+, one enemy unit within Engagement Range of the bearer suffers 1 mortal wound. Mortal wounds inflicted by this Enhancement are allocated as if they had the [PRECISION] ability.","cost":"10"},{"name":"Fleetmaster","description":"VOIDFARERS model only. Once per battle round, you can target the bearer’s unit with the Violent Acquisition, Masters of the Void or Close-quarters Barrage Stratagems for 0CP.","cost":"20"}],"stratagems":[{"name":"CLOSE-QUARTERS BARRAGE","type":"Imperialis Fleet – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One VOIDFARERS unit from your army. EFFECT: Until the end of the phase, each time a model in your unit makes a ranged attack that targets a unit within 12\", improve the Strength and Armour Penetration characteristics of that attack by 1."},{"name":"MASTERS OF THE VOID","type":"Imperialis Fleet – Epic Deed Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One VOIDFARERS CHARACTER unit from your army. EFFECT: Until the end of the phase, each AGENTS OF THE IMpERIUM unit from your army that is arriving from Strategic Reserves this turn can be set up within your opponent’s deployment zone (all other restrictions still apply)."},{"name":"SELFLESS BODYGUARD","type":"Imperialis Fleet – Epic Deed Stratagem","cost":"1","when":"Opponent’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One AGENTS OF THE IMpERIUM Attached unit that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack with the [PRECISION] ability is allocated to a CHARACTER model in your unit, if there are one or more Bodyguard models in your unit, roll one D6: on a 2+, that attack is allocated to a Bodyguard model of your choice in your unit instead."},{"name":"VIOLENT ACQUISITION","type":"Imperialis Fleet – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One AGENTS OF THE IMpERIUM unit from your army. EFFECT: Until the end of the phase, each time a model in your unit makes an attack that targets an enemy unit within range of an objective marker, that attack has the [SUSTAINED HITS 1], [LANCE] and [IGNORES COVER] abilities."},{"name":"EMPEROR’S WILL","type":"Imperialis Fleet – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One AGENTS OF THE IMpERIUM unit from your army. EFFECT: Until the end of the phase, your unit is eligible to shoot in a turn in which it Advanced or Fell Back."},{"name":"DISPLACER FIELD","type":"Imperialis Fleet – Wargear Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent's Shooting phase, just after an enemy unit has selected its targets. TARGET: One AGENTS OF THE IMpERIUM CHARACTER unit from your army (excluding OFFICIO ASSASSINORUM units) that was selected as the target of one or more of the attacking unit's attacks. EFFECT: Until the end of the phase, models in your unit have a 4+ invulnerable save and, after the attacking unit has resolved its attacks, unless your unit is within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\" (when doing so, models in this unit move as if they have the Fly keyword)."}]},{"name":"Interdiction Team","rules":[{"name":"Chastisor Auto-Vox","description":"In your opponent’s Command phase, each enemy unit within 3\" of one or more ADEPTUS ARbiTES units from your army must take a Battle-shock test. If that enemy unit is also Below Half-strength, subtract 1 from that test. This Detachment rule cannot cause a unit to take two Battle-shock tests in the same phase."}],"enhancements":[{"name":"Manhunter’s Helm","description":"Proctor-Exactant model only. At the start of the first battle round, select one enemy unit to be your Priority Target. Each time an ADEPTUS ARbiTES model from your army makes an attack that targets your Priority Target, if the bearer is on the battlefield, add 1 to the Wound roll. Each time your Priority Target is destroyed, if the bearer is on the battlefield, you can select a new enemy unit to be your Priority Target.","cost":"0"},{"name":"Vasov’s Auto-Oppressor","description":"Proctor-Exactant model only. At the end of your Movement phase, you can select one enemy unit visible to the bearer. Until the start of your next Movement phase, halve the Move characteristic of models in that unit and halve Advance and Charge rolls made for it.","cost":"0"}],"stratagems":[{"name":"DUTY AND DEATH","type":"Interdiction Team – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTUS ARBITES unit from your army that was selected as the target of one or more of the attacking unit's attacks. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 4+ ability."},{"name":"CRACKDOWN","type":"Interdiction Team – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTUS ARBITES unit from your army. EFFECT: Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll and you can re-roll the Wound roll."},{"name":"ARBITRARY EXECUTION","type":"Interdiction Team – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One ADEPTUS ARBITES unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, Arbites shotpistols equipped by models in your unit have an Attacks characteristic of 2 and the [LETHAL HITS] ability, and models in your unit can target enemy units that are not within Engagement Range of them (provided they are otherwise eligible targets)."},{"name":"INESCAPABLE JUDGEMENT","type":"Interdiction Team – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent's Movement phase, just after an enemy unit is selected to Fall Back. TARGET: One ADEPTUS ARBITES unit from your army within Engagement Range of that enemy unit. EFFECT: Until the end of the phase, when that enemy unit Falls Back, models in it must take Desperate Escape tests as if their unit was Battle-shocked. When doing so, if that enemy unit is also Battle-shocked by other means, subtract 1 from each of those Desperate Escape tests."}]},{"name":"Ordo Hereticus Purgation Force","rules":[{"name":"Root out Heresy","description":"Ranged weapons equipped by ADEPTUS ARbITES, INqUISITOR, INqUISITORIAl AGENTS and ORDO HERETICUS models from your army have the [IGNORES COvER] ability. Each time an ADEPTUS ARBITES, INQUISITOR, INQUISITORIAL AGENTS or ORDO HERETICUS model from your army makes an attack that targets a CHAOS unit containing 5 or more models, that attack has the [SUSTAINED HITS 1] ability."}],"enhancements":[{"name":"Ignis Judicium","description":"INqUISITOR or MINISTORUM PRIEST model only. The bearers ranged weapons have the [DEVASTATING WOUNDS], [MELTA 1] and [PRECISION] abilities.","cost":"10"},{"name":"Liber Heresius","description":"INqUISITOR or MINISTORUM PRIEST model only. After both players have deployed their armies, select up to three AGENTS OF THE IMPERIUM units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.","cost":"10"},{"name":"No Escape (Aura)","description":"INqUISITOR model only. While an enemy unit is within 6\" of the bearer, each time it is selected to Fall Back it must first take a Leadership test. If that test is failed, that unit must Remain Stationary this phase instead.","cost":"25"},{"name":"Witch Hunter","description":"INqUISITOR or MINISTORUM PRIEST model only. While the bearer is leading a unit, each time a model in that unit makes an attack that targets a PSyKER unit, you can re-roll the Hit roll.","cost":"15"}],"stratagems":[{"name":"DISPENSE JUSTICE","type":"Purgation Force – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, weapons equipped by models in your unit have the [LETHAL HITS] ability."},{"name":"EXECUTION ORDER","type":"Purgation Force – Epic Deed Stratagem","cost":"2","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS INFANTRy unit from your army. EFFECT: Select one enemy CHARACTER unit on the battlefield. Until the start of your next Command phase, each time a model in your unit targets that CHARACTER unit, its weapons have the [PRECISION] ability."},{"name":"INVIOLATE JURISDICTION","type":"Purgation Force – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS INFANTRy unit from your army within range of an objective marker and that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 5+ ability."},{"name":"LINE OF FIRE","type":"Purgation Force – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, models in your unit can target enemy units that are within Engagement Range of one or more friendly units with ranged weapons (excluding Blast weapons), provided the target is within 12\"."},{"name":"EXACT PUNISHMENT","type":"Purgation Force – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an AGENTS OF THE IMpERIUM unit from your army is destroyed as the result of an enemy unit's attacks. TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS unit from your army that was within 6\" of the destroyed unit (you cannot target the destroyed unit with the Stratagem). EFFECT: After the attacking unit has shot, your unit can shoot as if it were your Shooting phase, but when resolving those attacks it can only target that enemy unit (and only if it is an eligible target)."},{"name":"STUN GRENADES","type":"Purgation Force – Wargear Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Start of any phase (excluding the Command phase). TARGET: One ADEpTUS ARbITES, INQUISITORIAl AGENTS or ORDO HERETICUS GRENADES unit from your army that is not within Engagement Range of one or more enemy units. EFFECT: Select one enemy unit (excluding MONSTERS or VEHICLES) within 8\" of and visible to your unit. That enemy unit must take a Battle-shock test and, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll."}]},{"name":"Ordo Malleus Daemon Hunters","rules":[{"name":"Destroy the Daemonic","description":"Each time an INqUISITOR, INqUISITORIAl AGENTS or ORDO MAllEUS model from your army makes an attack, re-roll a Hit roll of 1 and, if the target of that attack is a DAEMON unit, re-roll a Wound roll of 1 as well."}],"enhancements":[{"name":"Daemon Slayer","description":"INqUISITOR model only. Add 1 to the Attacks characteristic of the bearers melee weapons, and those weapons have the [ANTI-DAEMON 3+] ability.","cost":"10"},{"name":"Formidable Resolve","description":"INqUISITOR model only. Improve the bearer’s Leadership and Wounds characteristics by 1. Once per battle, at the start of any phase, you can select one friendly Battle-shocked unit within 12\" of the bearer. That unit is no longer Battle-shocked.","cost":"5"},{"name":"Gift of the Prescient","description":"INqUISITOR model only. Once per battle, if the bearer is on the battlefield, you can use the Rapid Ingress Stratagem for 0CP. When doing so, you must target a GREy KNIGHTS TERMINATOR SqUAD unit from your army, and when using that Stratagem, that unit can be set up anywhere on the battlefield that is more than 3\" away from all enemy units.","cost":"20"},{"name":"Grimoire of True Names (Aura)","description":"INqUISITOR model only. While an enemy unit is within 9\" of the bearer, worsen the Leadership characteristic of models in that unit by 1. In addition, while an enemy DAEMON unit is within 9\" of the bearer, each time a model in that DAEMON unit makes an attack, subtract 1 from the Hit roll and subtract 1 from the Wound roll.","cost":"10"}],"stratagems":[{"name":"STEEL HEART","type":"Daemon Hunters – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a GREy KNIGHTS TERMINATOR SQUAD unit from your army Falls Back. TARGET: That GREY KNIGHTS TERMINATOR SQUAD unit. EFFECT: Until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back."},{"name":"RITES OF EXORCISM","type":"Daemon Hunters – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One INQUISITOR, INQUISITORIAl AGENTS or ORDO MAllEUS unit from your army. EFFECT: Select one enemy DAEMON unit within 12\" and visible to your unit. That unit must take a Battle-shock test. If that test is failed, then until the end of the phase, each time a friendly AGENTS OF THE IMpERIUM unit makes an attack that targets that DAEMON unit, that attack has the [DEVASTATING WOUNDS] ability."},{"name":"RITUAL OF WARDING","type":"Daemon Hunters – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Start of any Command phase. TARGET: One INQUISITOR, INQUISITORIAl AGENTS or ORDO MAllEUS unit from your army that is within range of an objective marker you control. EFFECT: That objective marker is said to be Warded and remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn. While an objective marker is Warded and under your control, enemy DAEMON units cannot be set up on the battlefield within 6\" of it."},{"name":"HEXAGRAMMIC WARDS","type":"Daemon Hunters – Wargear Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ORDO MAllEUS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, all Psychic weapons equipped by models in the attacking unit have the [HAZARDOUS] ability."},{"name":"TRUESILVER ARMOUR","type":"Daemon Hunters – Wargear Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase orthe Fight phase, just after an enemy unit has selected its targets. TARGET: One GREy KNIGHTS TERMINATOR SQUAD unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1."},{"name":"PSYBOLT AMMUNITION","type":"Daemon Hunters – Wargear Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One GREy KNIGHTS TERMINATOR SQUAD unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [LETHAL HITS] and [PSYCHIC] abilities."}]},{"name":"Ordo Xenos Alien Hunters","rules":[{"name":"Deathwatch Mission Tactics","description":"At the start of your Command phase, you can select one of the Mission Tactics listed below. Until the start of your next Command phase, that Mission Tactic is active and its effects apply to all DEATHwATCH units from your army. Each Mission Tactic can only be selected once per battle.Furor TacticsThe warriors of the Deathwatch are often sorely outnumbered by swarming foes, yet by striking for maximum indiscriminate carnage they soon even the odds.While this Mission Tactic is active, weapons equipped by DEATHWATCH units from your army have the [SUSTAINED HITS 1] ability.Malleus TacticsEven the largest behemoth has a weak point, and the Deathwatch find them all.While this Mission Tactic is active, weapons equipped by DEATHWATCH units from your army have the [LETHAL HITS] ability.Purgatus TacticsAdopting Purgatus tactics, the Deathwatch focus their ire upon the commanders of the enemy host.While this Mission Tactic is active, each time a DEATHWATCH model from your army makes an attack, on a Critical Wound, that attack has the [PRECISION] ability."}],"enhancements":[{"name":"Amulet of Auto-Chastisement","description":"WATCH MASTER model only. At the start of your opponents Shooting phase, select one enemy VEHICLE unit (excluding TITANIC units) within 12\" of and visible to the bearer. That unit must take a Leadership test. If that test is passed, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll; if that test is failed, that unit is not eligible to shoot this phase.","cost":"25"},{"name":"Beacon Angelis","description":"WATCH MASTER model only. Models in the bearer’s unit have the Deep Strike ability. In addition, you can target the bearer’s unit with the Rapid Ingress Stratagem for 0CP.","cost":"30"},{"name":"Blackweave Shroud","description":"AGENTS OF THE IMPERIUM model only. The bearer has the Feel No Pain 4+ ability.","cost":"15"},{"name":"Universal Anathema","description":"AGENTS OF THE IMPERIUM model only. Melee weapons equipped by the bearer have the [ANTI-INFANTRy 2+] and [ANTI-MONSTER 4+] abilities.","cost":"10"}],"stratagems":[{"name":"ARMOUR OF CONTEMPT","type":"Alien Hunters – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One DEATHwATCH unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1."},{"name":"ADAPTIVE TACTICS","type":"Alien Hunters – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One DEATHwATCH unit from your army. EFFECT: Select the Furor Tactics, Malleus Tactics or Purgatus Tactics. Until the start of your next Command phase, that Deathwatch Mission Tactic is active for your unit instead of any other Deathwatch Mission Tactic that is active for your army, even if you have already selected that Deathwatch Mission Tactic this battle."},{"name":"RAPID TACTICAL RELOCATION","type":"Alien Hunters – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: One INQUISITOR or DEATHwATCH INFANTRy unit from your army. EFFECT: Remove your unit from the battlefield. In the Reinforcements step of your next Movement phase, set your unit up anywhere on the battlefield that is more than 9” horizontally away from all enemy models. RESTRICTIONS: You cannot select a unit that is within Engagement Range of one or more enemy units."},{"name":"KRAKEN ROUNDS","type":"Alien Hunters – Wargear Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One DEATHwATCH INFANTRy unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, improve the Armour Penetration characteristic of ranged weapons equipped by models in your unit by 1 and improve the Range characteristic of those weapons by 6\". RESTRICTIONS: You cannot select any units that have already been targeted with either the Dragonfire Rounds or Hellfire Rounds Stratagems this phase."},{"name":"DRAGONFIRE ROUNDS","type":"Alien Hunters – Wargear Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One DEATHwATCH INFANTRy unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [ASSAULT] and [IGNORES COVER] abilities. RESTRICTIONS: You cannot select any units that have already been targeted with either the Kraken Rounds or Hellfire Rounds Stratagems this phase."},{"name":"HELLFIRE ROUNDS","type":"Alien Hunters – Wargear Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One DEATHwATCH INFANTRy unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons (excluding Devastating Wounds weapons) equipped by models in your unit have the [ANTI-INFANTRY 2+] and [ANTI-MONSTER 5+] abilities. RESTRICTIONS: You cannot select any units that have already been targeted with either the Kraken Rounds or Dragonfire Rounds Stratagems this phase."}]},{"name":"Veiled Blade Elimination Force","rules":[{"name":"Extremis Sanction","description":"Officio Assassinorum units from your army can use the Overkill, Soulless Horror and Shieldbreaker abilities twice per battle, instead of once per battle (but cannot use such an ability more than once in the same battle round). When mustering your army, each OFFICIO ASSASSINORUM unit from your army has the relevant Extremis ability shown on the right, and you must increase the points cost of each of those units by the amount shown. If this causes your army to exceed the points limit for the battle you are playing, you cannot include that unit in your army."}],"enhancements":[{"name":"Decoy Targets","description":"Callidus Assassin models only. Twice per battle, in your Movement phase, you can select one other friendly Infantry model that is on the battlefield and not within Engagement Range of one or more enemy units. The selected model is destroyed (ignoring any rules that are triggered when a model is destroyed) and this model is removed from the battlefield and set up again as close as possible to where that destroyed model was and not within Engagement Range of one or more enemy units. This ability cannot be used more than once in the same battle round.","cost":"+40"},{"name":"Esoteric Explosives","description":"Culexus Assassin models only. Each time this model is targeted with the Grenades Stratagem, 1 mortal wound is inflicted for each D6 roll of 3+ instead of for each 4+.","cost":"+40"},{"name":"Intraneural Biotech","description":"Eversor Assassin models only. Once per battle round, you can target this model with the Heroic Intervention or Counter-offensive Stratagem for 0CP, and can do so even if you have already used that Stratagem on a different unit this phase.","cost":"+35"},{"name":"Micromelta Rounds","description":"Vindicare Assassin models only. This model’s exitus rifle has the [ANTI-MONSTER 4+] and [ANTI-VEHICLE 4+] abilities.","cost":"+45"}],"stratagems":[{"name":"PRIME TARGET","type":"Veiled Blade Elimination Force – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One Agents of the Imperium unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack that targets a CHARACTER unit, re-roll a Wound roll of 1. If that attack is made by an Officio Assassinorum model and it targets the enemy WARLORD, you can re-roll the Wound roll instead."},{"name":"HYPERSTIMMS","type":"Veiled Blade Elimination Force – Battle Tactic Stratagem","cost":"2","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Agents of the Imperium Character unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, add 1 to the Toughness characteristic of models in your unit. In addition, if it is an Eversor Assassin unit, until the end of the phase, it has the Feel No Pain 4+ ability."},{"name":"BLIND GRENADES","type":"Veiled Blade Elimination Force – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: Your opponent’s Charge phase, just after an enemy unit has declared a charge. TARGET: One Agents of the Imperium Grenades or Vindicare Assassin unit from your army that was selected as one of the targets of that charge and is not within Engagement Range of one or more enemy units. EFFECT: Until the end of the phase, subtract 1 from Charge rolls made for that enemy unit, or, if your unit is a VINDICARE ASSASSIN, subtract 2 from Charge rolls made for that enemy unit instead."},{"name":"ENSNARING TRAP","type":"Veiled Blade Elimination Force – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: End of your opponent’s Charge phase. TARGET: One Agents of the Imperium Infantry unit from your army that is within 6\" of one or more enemy units and would be eligible to declare a charge against one or more of those enemy units. EFFECT: Your unit can declare a charge. When doing so, you must select one or more of those enemy units as the targets of that charge, and your unit does not receive a Charge bonus this turn. In addition, if it is a Callidus Assassin unit and it makes a Charge move as a result of this Stratagem, until the end of the turn, each time a model in your unit makes a melee attack, add 1 to the Wound roll."},{"name":"ORBITAL OVERSIGHT","type":"Veiled Blade Elimination Force – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Agents of the Imperium Infantry unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\", or, if your unit has the Lone Operative ability, if the attacking model is within 6\"."},{"name":"WILL‑SAPPING SALVO","type":"Veiled Blade Elimination Force – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Agents of the Imperium Infantry unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [SUSTAINED HITS 1] ability. In addition, if it is a Culexus Assassin unit, until the end of the phase, change the Damage characteristic of ranged weapons equipped by models in your unit to 3."}]},{"name":"Voidship’s Company","rules":[{"name":"Beseechment Codes","description":"In your Movement phase, each time a VOiDFARERS unit from your army makes a Normal move, while that unit is moving it can attempt to operate a closed Hatchway that it is within 1\" of at any point during the move. It cannot do this, however, if there are one or more enemy units also within 1\" of that Hatchway. If that VOIDFARERS unit does attempt to operate that Hatchway, it cannot operate a Hatchway again this turn."}],"enhancements":[{"name":"Lathimon’s Flock","description":"VOiDFARERS model only. In the Deploy Armies step, your opponent must deploy their entire army before you deploy yours. If both players have this rule, they must roll off and deploy their armies normally. In addition, IMPERiAL NAvY BREACHERS units from your army gain the Infiltrators ability.","cost":"0"},{"name":"Heirloom Blade","description":"VOiDFARERS model only. Once per battle, when the bearer’s unit is selected to light, it can use this Enhancement. If it does, until the end of the phase, improve every characteristic of the bearer’s monomolecular cane-rapier by 1.","cost":"0"}],"stratagems":[{"name":"AMMO RATIONS","type":"Voidship’s Company – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Start of your Shooting phase. TARGET: One or more VOIDfARERS units from your army. EFFECT: Select one enemy unit. Until the end of the phase, each time a model in one of your units makes an attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1."},{"name":"BREACH AND CLEAR","type":"Voidship’s Company – Battle Tactic Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after an IMPERIAL NAvY BREAcHERS unit from yourarmy opens a Hatchway. TARGET: That IMPERIAL NAVY BREACHERS unit. EFFECT: Until the end of the turn, each time a model in your unit makes an attack, if that model is on the opposite side of the Hatchway from the side it started the turn on, add 1 to the Hit roll and add 1 to the Wound roll."},{"name":"BOARDING DRILL","type":"Voidship’s Company – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Start of your Shooting phase. TARGET: One VOIDfARERS unit from your army. EFFECT: Until the end of the phase, your unit is eligible to shoot or perform a Tactical Manoeuvre in a turn in which it Fell Back."},{"name":"SHIP’S WATCH","type":"Voidship’s Company – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement or Charge phase","description":"WHEN: Your opponent's Movement or Charge phase. TARGET: Up to two VOIDSMEN-AT-ARMS units from your army that have not fired Overwatch this phase. EFFECT: Until the end of the phase, each time a model in one of your units makes an attack while firing Overwatch, an unmodified Hit roll of 5+ is required to score a hit, instead of an unmodified 6. When doing so, models in your units can ignore other models in their unit for the purposes of visibility, and each time a model in one of your units makes an attack, if that unit contains a Canid model, a successful unmodified Hit roll of 5+ scores a Critical Hit."}]}],"datasheets":[{"id":"000004174","name":"Aquila Kill Team","role":"Battleline","loadout":"The Kill Team Sergeant is equipped with: plasma pistol; power weapon. Each Gravis Veteran is equipped with: infernus heavy bolter; bolt pistol; close combat weapon. For every 5 models in the unit, 1 Deathwatch Veteran is equipped with: stalker bolt rifle; bolt pistol; close combat weapon. For every 5 models in the unit, 1 Deathwatch Veteran is equipped with: bolt pistol; heavy thunder hammer. For every 5 models in the unit, 1 Deathwatch Veteran is equipped with: Deathwatch marksman bolt carbine; special-issue bolt pistol; close combat weapon. If the unit contains 10 models, 1 Deathwatch Veteran is equipped with: special-issue bolt pistol; xenophase blade.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"KILL TEAM SERGEANT, DEATHWATCH VETERAN","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"2"},{"name":"GRAVIS VETERAN","m":"5\"","t":"6","sv":"3+","invSv":"-","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Astartes grenade launcher – frag","type":"Ranged","profiles":[{"name":"Astartes grenade launcher – frag","range":"24","type":"Ranged","a":"D3","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"},{"name":"Astartes grenade launcher – krak","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-2","d":"D3","desc":null}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol, lethal hits"}]},{"name":"Deathwatch marksman bolt carbine","type":"Ranged","profiles":[{"name":"Deathwatch marksman bolt carbine","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"heavy, lethal hits"}]},{"name":"Frag cannon","type":"Ranged","profiles":[{"name":"Frag cannon","range":"18","type":"Ranged","a":"D3","bsWs":"3","s":"7","ap":"-2","d":"2","desc":"blast, heavy, lethal hits, rapid fire d3"}]},{"name":"Hellstorm bolt rifle","type":"Ranged","profiles":[{"name":"Hellstorm bolt rifle","range":"30","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"assault, heavy, lethal hits"}]},{"name":"Infernus heavy bolter – heavy bolter","type":"Ranged","profiles":[{"name":"Infernus heavy bolter – heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"SUSTAINED HITS 1"},{"name":"Infernus heavy bolter – heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"IGNORES COVER, TORRENT"}]},{"name":"Plasma incinerator – standard","type":"Ranged","profiles":[{"name":"Plasma incinerator – standard","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"assault, heavy"}]},{"name":"Plasma incinerator – supercharge","type":"Ranged","profiles":[{"name":"Plasma incinerator – supercharge","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"assault, hazardous, heavy"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"PISTOL"},{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS, PISTOL"}]},{"name":"Special-issue bolt pistol","type":"Ranged","profiles":[{"name":"Special-issue bolt pistol","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol, precision, lethal hits"}]},{"name":"Stalker bolt rifle","type":"Ranged","profiles":[{"name":"Stalker bolt rifle","range":"30","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"heavy, lethal hits, precision"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Combat knife","type":"Melee","profiles":[{"name":"Combat knife","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"precision"}]},{"name":"Heavy thunder hammer","type":"Melee","profiles":[{"name":"Heavy thunder hammer","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"10","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"sustained hits 1"}]},{"name":"Xenophase blade","type":"Melee","profiles":[{"name":"Xenophase blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Death to the Alien","description":"Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target of that attack does not have the IMPERIUM or CHAOS keywords, you can re-roll the Hit roll instead.","type":"Datasheet"},{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Gravis Veteran models take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the GRAVIS keyword. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated Transport rules.","type":"Datasheet"},{"name":"Astartes Shield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"},{"name":"ATTACHED UNIT","description":"If a Character unit from your army can be attached to a Deathwatch Kill Team unit, it can be attached to this unit instead.","type":"Fortification (левая колонка)"}],"keywords":["Battleline","Infantry","Grenades","Gravis","Tacticus","Aquila Kill Team","Deathwatch","Retinue","Ordo Xenos","Imperium"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Kill Team Sergeant","1 Gravis Veteran","3 Deathwatch Veterans","OR","1 Kill Team Sergeant","2 Gravis Veterans","7 Deathwatch Veterans"],"points":[{"models":"5 models","cost":"100"},{"models":"10 models","cost":"200"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000000877","000001579","000004173","000003814","000003815"]},{"id":"000000871","name":"Callidus Assassin","role":"Characters","loadout":"This model is equipped with: neural shredder; phase sword and poison blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Callidus Assassin","m":"7\"","t":"4","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Neural shredder","type":"Ranged","profiles":[{"name":"Neural shredder","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-2","d":"1","desc":"anti-infantry 2+, precision, torrent"}]},{"name":"Phase sword and poison blades","type":"Melee","profiles":[{"name":"Phase sword and poison blades","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"5","ap":"-4","d":"2","desc":"lethal hits, precision"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Acrobatic Escape","description":"At the end of the Fight phase, if this model is within Engagement Range of one or more enemy units, it can make a Fall Back move of up to D6\". In addition, at the end of your opponent’s turn, if this model is not within 3\" of one or more enemy units, you can remove it from the battlefield and then, in the Reinforcements step of your next Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the battle ends and this model is not on the battlefield, it is destroyed.","type":"Datasheet"},{"name":"Lord of Deceit (Aura)","description":"Each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this model, increase the cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"SHADOW ASSIGNMENT","description":"This model cannot be selected to be your WARLORD. If your army faction is AGENTS OF THE IMPERIUM, then during the Declare Battle Formations step, you can replace this model with a different OFFICIO ASSASSINORUM model, provided the total points value of the new model does not exceed the points value of the model it replaced. Your army cannot include duplicates of the same model (i.e. after replacing a model with this rule, your army cannot have more than 1 VINDICARE ASSASSIN, it cannot have more than 1 CUlExUS ASSASSIN, it cannot have more than 1 EvERSOR ASSASSIN and it cannot have more than 1 CALLIDUS ASSASSIN).","type":"Special (правая колонка)"}],"keywords":["Epic Hero","Infantry","Character","Officio Assassinorum","Callidus Assassin","Imperium"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Callidus Assassin – EPIC HERO"],"points":[{"models":"1 model","cost":"100"}],"canLead":[],"ledBy":[]},{"id":"000003817","name":"Corvus Blackstar","role":"Other","loadout":"This model is equipped with: 2 Blackstar rocket launchers; twin assault cannon; armoured hull.","transport":"This model has a transport capacity of 12 DEATHwATCH INFANTRy models.","damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Corvus Blackstar","m":"20+\"","t":"10","sv":"3+","invSv":"-","w":"14","ld":"6+","oc":"0"}],"weapons":[{"name":"Blackstar rocket launcher","type":"Ranged","profiles":[{"name":"Blackstar rocket launcher","range":"30","type":"Ranged","a":"D6+1","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Hurricane bolter","type":"Ranged","profiles":[{"name":"Hurricane bolter","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 6, twin-linked"}]},{"name":"Stormstrike missile launcher","type":"Ranged","profiles":[{"name":"Stormstrike missile launcher","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"10","ap":"-2","d":"3","desc":null}]},{"name":"Twin assault cannon","type":"Ranged","profiles":[{"name":"Twin assault cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"0","d":"1","desc":"devastating wounds, twin-linked"}]},{"name":"Twin lascannon","type":"Ranged","profiles":[{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"}]},{"name":"Armoured hull","type":"Melee","profiles":[{"name":"Armoured hull","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Blackstar Cluster Launcher","description":"Each time this model ends a Normal move, you can select one enemy unit it moved over during that move and roll six D6: for each 5+, that unit suffers 1 mortal wound.","type":"Datasheet"},{"name":"Auspex Array","description":"Ranged weapons equipped by the bearer have the [IGNORES COVER] ability.","type":"Wargear"},{"name":"Infernum Halo-launcher","description":"The bearer has the Smoke keyword.","type":"Wargear"}],"keywords":["Aircraft","Fly","Transport","Imperium","Ordo Xenos","Retinue","Deathwatch","Corvus Blackstar","Vehicle"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Corvus Blackstar"],"points":[{"models":"1 model","cost":"180"}],"canLead":[],"ledBy":[]},{"id":"000000873","name":"Culexus Assassin","role":"Characters","loadout":"This model is equipped with: animus speculum; life-draining touch.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Culexus Assassin","m":"7\"","t":"4","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Animus speculum","type":"Ranged","profiles":[{"name":"Animus speculum","range":"24","type":"Ranged","a":"3","bsWs":"2","s":"5","ap":"-2","d":"D3","desc":"anti-psyker 2+, assault, precision, psychic assassin"}]},{"name":"Life-draining touch","type":"Melee","profiles":[{"name":"Life-draining touch","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"2","desc":"anti-psyker 2+, devastating wounds, precision"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Etheric Emergence","description":"In your Movement phase, when this model is set up on the battlefield using the Deep Strike ability, it can perform an etheric emergence. If it does, this model can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units, but until the end of the turn, it is not eligible to declare a charge.","type":"Datasheet"},{"name":"Abomination","description":"This model has the Feel No Pain 2+ ability against Psychic Attacks.","type":"Datasheet"},{"name":"Soulless Horror","description":"Once per battle, at the start of any Command phase, this model can use this ability. If it does, each enemy unit within 9\" of this model must take a Battle-shock test, subtracting 1 from that test (or subtracting 2 if that unit is a PSYKER).","type":"Datasheet"},{"name":"Psychic Assassin","description":"Each time you select a PSYKER unit as the target for this weapon, until those attacks are resolved, change the Attacks characteristic of this weapon to 6.","type":"Wargear profile"},{"name":"SHADOW ASSIGNMENT","description":"This model cannot be selected to be your WARLORD. If your army faction is AGENTS OF THE IMPERIUM, then during the Declare Battle Formations step, you can replace this model with a different OFFICIO ASSASSINORUM model, provided the total points value of the new model does not exceed the points value of the model it replaced. Your army cannot include duplicates of the same model (i.e. after replacing a model with this rule, your army cannot have more than 1 VINDICARE ASSASSIN, it cannot have more than 1 CUlExUS ASSASSIN, it cannot have more than 1 EvERSOR ASSASSIN and it cannot have more than 1 CAllIDUS ASSASSIN).","type":"Special (правая колонка)"}],"keywords":["Epic Hero","Culexus Assassin","Officio Assassinorum","Imperium","Grenades","Character","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Culexus Assassin – EPIC HERO"],"points":[{"models":"1 model","cost":"85"}],"canLead":[],"ledBy":[]},{"id":"000003828","name":"Daemonhost","role":"Other","loadout":"Every model is equipped with: unholy gaze; Warp grasp.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Daemonhost","m":"6\"","t":"3","sv":"5+","invSv":"5","w":"3","ld":"7+","oc":"0"}],"weapons":[{"name":"Unholy gaze","type":"Ranged","profiles":[{"name":"Unholy gaze","range":"18","type":"Ranged","a":"3","bsWs":"4","s":"8","ap":"-2","d":"D3","desc":"PSYCHIC"}]},{"name":"Warp grasp","type":"Melee","profiles":[{"name":"Warp grasp","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"LETHAL HITS, PSYCHIC"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Malefic Warding","description":"While an Inquisitor model is leading a unit that includes one or more DAEMONHOST models, models in that unit have a 5+ invulnerable save.","type":"Datasheet"},{"name":"Bound Daemon","description":"While an Inquisitor model is leading a unit that includes one or more DAEMONHOST models, the Objective Control characteristic of DAEMONHOST models in that unit is 1.","type":"Wargear"},{"name":"INQUISITORIAL RETINUE","description":"If your Army Faction is not AGENTS OF THE IMPERIUM, then for each unique pairing of 1 Inquisitorial Agents unit and 1 DAEMONHOST unit occuring in your army, increase the maximum number of Retinue units permitted in your army by 1. At the start of the Declare Battle Formations step, this unit can join one INQUISITORIAL AGENTS unit from your army that is being led by an Inquisitor model (a unit cannot have more than one DAEMONHOST unit joined to it). If it does, until the end of the battle, every model in this unit counts as being part of that Bodyguard unit, and that Bodyguard unit’s Starting Strength is increased accordingly.","type":"Fortification (левая колонка)"}],"keywords":["Daemon","Retinue","Infantry","Psyker","Imperium","Daemonhost"],"factionKeywords":["Agents of the Imperium"],"composition":["1-2 Daemonhosts"],"points":[{"models":"1 model","cost":"40"},{"models":"2 models","cost":"80"}],"canLead":[],"ledBy":["000001579"]},{"id":"000002761","name":"Damned Legionnaires","role":"Other","loadout":"Every model is equipped with: boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Damned Legionnaires","m":"6\"","t":"4","sv":"3+","invSv":"4","w":"2","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ignores cover"}]},{"name":"Flamer","type":"Ranged","profiles":[{"name":"Flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma gun – standard","type":"Ranged","profiles":[{"name":"Plasma gun – standard","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"rapid fire 1"}]},{"name":"Plasma gun – supercharge","type":"Ranged","profiles":[{"name":"Plasma gun – supercharge","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, rapid fire 1"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Astartes chainsword","type":"Melee","profiles":[{"name":"Astartes chainsword","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-1","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Grim Spectres","description":"In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. That enemy unit must take a Battle-shock test, subtracting 1 from the result when doing so.","type":"Datasheet"}],"keywords":["Grenades","Retinue","Damned Legionnaires","Imperium","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Legionnaire Sergeant","4-9 Legionnaires"],"points":[{"models":"5 models","cost":"90"},{"models":"10 models","cost":"180"}],"canLead":[],"ledBy":[]},{"id":"000003816","name":"Deathwatch Kill Team","role":"Battleline","loadout":"Every model is equipped with: boltgun; power weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Deathwatch Veterans","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"2"}],"weapons":[{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Frag cannon","type":"Ranged","profiles":[{"name":"Frag cannon","range":"18","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-1","d":"2","desc":"blast, heavy, rapid fire d3"}]},{"name":"Infernus heavy bolter – heavy bolter","type":"Ranged","profiles":[{"name":"Infernus heavy bolter – heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"heavy, sustained hits 1"}]},{"name":"Infernus heavy bolter – heavy flamer","type":"Ranged","profiles":[{"name":"Infernus heavy bolter – heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Stalker-pattern boltgun","type":"Ranged","profiles":[{"name":"Stalker-pattern boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"2","desc":"HEAVY, PRECISION"}]},{"name":"Deathwatch shotgun","type":"Ranged","profiles":[{"name":"Deathwatch shotgun","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"2","desc":"ASSAULT"}]},{"name":"Black Shield blades","type":"Melee","profiles":[{"name":"Black Shield blades","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"TwIN-lINkED"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Deathwatch thunder hammer","type":"Melee","profiles":[{"name":"Deathwatch thunder hammer","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"10","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Xenophase blade","type":"Melee","profiles":[{"name":"Xenophase blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Death to the Alien","description":"Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target of that attack does not have the IMPERIUM or CHAOS keywords, you can re-roll the Hit roll instead.","type":"Datasheet"},{"name":"Astartes Shield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"}],"keywords":["Ordo Xenos","Retinue","Deathwatch","Kill Team","Infantry","Imperium","Battleline","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Watch Sergeant","4-9 Deathwatch Veterans"],"points":[{"models":"5 models","cost":"100"},{"models":"10 models (AGENTS OF THE IMPERIUM Detachment)","cost":"190"},{"models":"10 models (Assigned Agent)","cost":"200"}],"canLead":[],"ledBy":["000002090","000002760","000002760","000000874","000000876","000000877","000003814","000003815","000001579","000004173","000001579"]},{"id":"000003822","name":"Deathwatch Terminator Squad","role":"Other","loadout":"Every model is equipped with: power fist; storm bolter.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Deathwatch Terminator Squad","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Assault cannon","type":"Ranged","profiles":[{"name":"Assault cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"0","d":"1","desc":"devastating wounds"}]},{"name":"Cyclone missile launcher – frag","type":"Ranged","profiles":[{"name":"Cyclone missile launcher – frag","range":"36","type":"Ranged","a":"2D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Cyclone missile launcher – krak","type":"Ranged","profiles":[{"name":"Cyclone missile launcher – krak","range":"36","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null}]},{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Plasma cannon – standard","type":"Ranged","profiles":[{"name":"Plasma cannon – standard","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"blast"}]},{"name":"Plasma cannon – supercharge","type":"Ranged","profiles":[{"name":"Plasma cannon – supercharge","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"blast, hazardous"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Chainfist","type":"Melee","profiles":[{"name":"Chainfist","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"anti-vehicle 3+"}]},{"name":"Power fist","type":"Melee","profiles":[{"name":"Power fist","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Thunder hammer","type":"Melee","profiles":[{"name":"Thunder hammer","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"devastating wounds"}]},{"name":"Twin lightning claws","type":"Melee","profiles":[{"name":"Twin lightning claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"twin-linked"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Terminatus Assault","description":"Each time this unit ends a Charge move, each enemy unit within Engagement Range of this unit must take a Battle-shock test.","type":"Datasheet"},{"name":"Teleport Homer","description":"At the start of the battle, you can set up one Teleport Homer token for this unit anywhere on the battlefield that is not in your opponent’s deployment zone. If you do, once per battle, you can target this unit with the Rapid Ingress Stratagem for 0CP, but when resolving that Stratagem, you must set this unit up within 3\" of that token and not within 9\" of any enemy models. That token is then removed.","type":"Datasheet"},{"name":"Storm Shield","description":"The bearer has a Wounds characteristic of 4.","type":"Wargear"},{"name":"ATTACHED UNIT","description":"If a Character from your army with the Leader ability can be attached to a Deathwatch Kill Team, it can be attached to this unit instead.","type":"Special (правая колонка)"}],"keywords":["Infantry","Imperium","Terminator","Ordo Xenos","Retinue","Terminator Squad","Deathwatch"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Deathwatch Terminator Sergeant","4-9 Deathwatch Terminators"],"points":[{"models":"5 models","cost":"210"},{"models":"10 models","cost":"420"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000000877","000003814","000003815","000001579","000004173"]},{"id":"000000872","name":"Eversor Assassin","role":"Characters","loadout":"This model is equipped with: executioner pistol; power sword and neuro gauntlet.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Eversor Assassin","m":"9\"","t":"4","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Executioner pistol","type":"Ranged","profiles":[{"name":"Executioner pistol","range":"12","type":"Ranged","a":"4","bsWs":"2","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 3+, PISTOL, PRECISION, SUSTAINED HITS 3"}]},{"name":"Power sword and neuro gauntlet","type":"Melee","profiles":[{"name":"Power sword and neuro gauntlet","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"5","ap":"-2","d":"2","desc":"ANTI-INFANTRY 3+, PRECISION, SUSTAINED HITS 3"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Frenzon","description":"This model is eligible to shoot and declare a charge in a turn in which it Advanced.","type":"Datasheet"},{"name":"Overkill","description":"Once per battle, in your Movement phase, this model can use this ability before it makes a Normal move. If it does, until the end of the turn, add 6\" to this model’s Move characteristic and add 3 to the Attacks characteristic of this model’s melee weapons.","type":"Datasheet"},{"name":"SHADOW ASSIGNMENT","description":"This model cannot be selected to be your WARLORD. If your army faction is AGENTS OF THE IMPERIUM, then during the Declare Battle Formations step, you can replace this model with a different OFFICIO ASSASSINORUM model, provided the total points value of the new model does not exceed the points value of the model it replaced. Your army cannot include duplicates of the same model (i.e. after replacing a model with this rule, your army cannot have more than 1 VINDICARE ASSASSIN, it cannot have more than 1 CUlExUS ASSASSIN, it cannot have more than 1 EvERSOR ASSASSIN and it cannot have more than 1 CAllIDUS ASSASSIN).","type":"Special (правая колонка)"}],"keywords":["Infantry","Officio Assassinorum","Eversor Assassin","Imperium","Epic Hero","Character","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Eversor Assassin – EPIC HERO"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"110"},{"models":"1 model (Assigned Agent)","cost":"120"}],"canLead":[],"ledBy":[]},{"id":"000002685","name":"Exaction Squad","role":"Other","loadout":"Every Proctor-Exactant and Exaction Vigilant is equipped with: Arbites combat shotgun; Arbites shotpistol; close combat weapon. The Cyber-mastiff is equipped with: mechanical bite.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Exaction Squad","m":"6\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Arbites combat shotgun","type":"Ranged","profiles":[{"name":"Arbites combat shotgun","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":"assault"}]},{"name":"Arbites grenade launcher – krak","type":"Ranged","profiles":[{"name":"Arbites grenade launcher – krak","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"9","ap":"-2","d":"D3","desc":null}]},{"name":"Arbites grenade launcher – frag","type":"Ranged","profiles":[{"name":"Arbites grenade launcher – frag","range":"24","type":"Ranged","a":"D3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Arbites shotpistol","type":"Ranged","profiles":[{"name":"Arbites shotpistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Executioner shotgun","type":"Ranged","profiles":[{"name":"Executioner shotgun","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"ignores cover, precision"}]},{"name":"Heavy stubber","type":"Ranged","profiles":[{"name":"Heavy stubber","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"rapid fire 3"}]},{"name":"Webber","type":"Ranged","profiles":[{"name":"Webber","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"2","ap":"0","d":"1","desc":"assault, devastating wounds, torrent"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Excruciator maul","type":"Melee","profiles":[{"name":"Excruciator maul","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"-1","d":"2","desc":null}]},{"name":"Mechanical bite","type":"Melee","profiles":[{"name":"Mechanical bite","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Imperial Law","description":"At the start of the battle, select one unit from your opponent’s army. Each time a model in this unit makes an attack that targets that unit, that attack has the [LETHAL HITS] and [PRECISION] abilities.","type":"Datasheet"},{"name":"Arbites Medi-kit","description":"At the start of your Command phase, if the bearer’s unit is below its Starting Strength, you can return up to D3 destroyed Exaction Vigilants to this unit.","type":"Wargear"},{"name":"Nuncio Aquila","description":"Once per battle, at the start of any Command phase, you can select one objective marker within 6\" of the bearer. All enemy units (excluding MONSTERS and VEHICLES) within range of that objective marker must take a Battle-shock test. Each objective marker can only be targeted by this ability once per turn. Designer’s Note: Place one Nuncio-aquila token next to the bearer, removing it once it uses this ability.","type":"Wargear"},{"name":"Soulguilt Scanner","description":"Ranged weapons equipped by models in the bearer’s unit have the [IGNORES COVER] ability.","type":"Wargear"}],"keywords":["Exaction Squad","Grenades","Infantry","Imperium","Retinue","Adeptus Arbites"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Proctor-Exactant","9 Exaction Vigilants","1 Cyber-mastiff"],"points":[{"models":"11 models","cost":"90"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000003812","000001579","000004173","000000877"]},{"id":"000003825","name":"Fortis Kill Team","role":"Other","loadout":"Every Kill Team Intercessor is equipped with: bolt pistol; bolt rifle; close combat weapon. Every Kill Team Intercessor with plasma incinerator is equipped with: bolt pistol; plasma incinerator; close combat weapon. Every Kill Team Intercessor with heavy bolt pistol is equipped with: heavy bolt pistol; Astartes chainsword. Every Kill Team Outrider is equipped with: bolt pistol; twin bolt rifle; Astartes chainsword.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"KILL TEAM INTERCESSOR","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"1"},{"name":"KILL TEAM OUTRIDER","m":"12\"","t":"5","sv":"3+","invSv":"-","w":"4","ld":"6+","oc":"2"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Bolt rifle","type":"Ranged","profiles":[{"name":"Bolt rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, heavy"}]},{"name":"Hand flamer","type":"Ranged","profiles":[{"name":"Hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"3","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Heavy bolt pistol","type":"Ranged","profiles":[{"name":"Heavy bolt pistol","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Long Vigil ranged weapon","type":"Ranged","profiles":[{"name":"Long Vigil ranged weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"PISTOL"},{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS, PISTOL"}]},{"name":"Plasma incinerator – standard","type":"Ranged","profiles":[{"name":"Plasma incinerator – standard","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"assault, heavy"}]},{"name":"Plasma incinerator – supercharge","type":"Ranged","profiles":[{"name":"Plasma incinerator – supercharge","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"assault, hazardous, heavy"}]},{"name":"Twin bolt rifle","type":"Ranged","profiles":[{"name":"Twin bolt rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"twin-linked"}]},{"name":"Astartes chainsword","type":"Melee","profiles":[{"name":"Astartes chainsword","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"4","ap":"-1","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Long Vigil melee weapon","type":"Melee","profiles":[{"name":"Long Vigil melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Kill Team Terminator models, Kill Team Outrider models, Kill Team Biker models and models equipped with a jump pack each take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the Terminator, Mounted or Jump Pack keywords. For the purposes of interacting with terrain features, all models in units with this ability are considered INFANTRY models, even though similar models in other units may have the MOUNTED or JUMP PACK keywords. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated movement, TRANSPORT and Benefit of Cover rules.","type":"Faction"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Fortis Doctrines","description":"Each time a model in this unit makes an attack that targets a unit that is Below Half-strength, add 1 to the Hit roll.","type":"Datasheet"},{"name":"ATTACHED UNIT","description":"If a Character from your army with the Leader ability can be attached to a Deathwatch Kill Team, it can be attached to this unit instead.","type":"Fortification (левая колонка)"},{"name":"TRANSPORT","description":"This unit cannot embark within an Imperial Rhino.","type":"Fortification (левая колонка)"}],"keywords":["Kill Team","Infantry","Deathwatch","Fortis Kill Team","Grenades","Imperium","Ordo Xenos","Retinue"],"factionKeywords":["Agents of the Imperium"],"composition":["10 MODELS MAXIMUM","5-10 Kill Team Intercessors","0-4 Kill Team Intercessors with plasma incinerators","0-4 Kill Team Intercessors with heavy bolt pistols","0-2 Kill Team Outriders"],"points":[{"models":"5 models","cost":"100"},{"models":"10 models","cost":"200"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000000877","000003814","000003815","000001579","000004173"]},{"id":"000003813","name":"Grey Knights Terminator Squad","role":"Other","loadout":"Every model is equipped with: storm bolter; Nemesis force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Grey Knights Terminator Squad","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Incinerator","type":"Ranged","profiles":[{"name":"Incinerator","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Psilencer","type":"Ranged","profiles":[{"name":"Psilencer","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"psychic, sustained hits 1"}]},{"name":"Psycannon","type":"Ranged","profiles":[{"name":"Psycannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"8","ap":"-1","d":"2","desc":"psychic"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Nemesis force weapon","type":"Melee","profiles":[{"name":"Nemesis force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"psychic"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Hammerhand (Psychic)","description":"Each time a model in this unit makes a Charge move, until the end of the turn, melee weapons equipped by models in this unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Ancient’s Banner","description":"Add 1 to the Objective Control characteristic of models in the bearer’s unit.","type":"Wargear"},{"name":"Narthecium","description":"In your Command phase, you can return 1 destroyed model (excluding CHARACTERS) to the bearer’s unit.","type":"Wargear"},{"name":"Rites of Teleportation","description":"If one or more INQUISITOR units are attached to this unit during the Declare Battle formations step, models in those units have the Deep Strike ability.","type":"Special (правая колонка)"}],"keywords":["Imperium","Grey Knights Terminator Squad","Ordo Malleus","Grenades","Psyker","Infantry","Terminator","Requisitioned"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Terminator Justicar","4 Grey Knights Terminators"],"points":[{"models":"5 models (AGENTS OF THE IMPERIUM Detachment)","cost":"190"},{"models":"5 models (Assigned Agent)","cost":"210"}],"canLead":[],"ledBy":["000002760","000000876","000000877"]},{"id":"000002587","name":"Imperial Navy Breachers","role":"Battleline","loadout":"The Navis Sergeant-at-Arms is equipped with: Navis shotgun; close combat weapon. One Navis Armsman is equipped with: Navis las-volley; close combat weapon. One other Navis Armsman is equipped with: Navis heavy shotgun; close combat weapon; endurant shield. Every other model is equipped with: Navis shotgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Imperial Navy Breachers","m":"6\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Autopistol","type":"Ranged","profiles":[{"name":"Autopistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Demolition charge","type":"Ranged","profiles":[{"name":"Demolition charge","range":"6","type":"Ranged","a":"D6","bsWs":"5","s":"9","ap":"-2","d":"2","desc":"assault, blast, hazardous, one shot"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Navis heavy shotgun","type":"Ranged","profiles":[{"name":"Navis heavy shotgun","range":"12","type":"Ranged","a":"4","bsWs":"4","s":"4","ap":"0","d":"1","desc":"assault"}]},{"name":"Navis las-volley","type":"Ranged","profiles":[{"name":"Navis las-volley","range":"18","type":"Ranged","a":"4","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]},{"name":"Navis shotgun","type":"Ranged","profiles":[{"name":"Navis shotgun","range":"12","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":"assault"}]},{"name":"Plasma gun – standard","type":"Ranged","profiles":[{"name":"Plasma gun – standard","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"7","ap":"-1","d":"1","desc":"rapid fire 1"}]},{"name":"Plasma gun – supercharge","type":"Ranged","profiles":[{"name":"Plasma gun – supercharge","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"hazardous, rapid fire 1"}]},{"name":"Chainfist","type":"Melee","profiles":[{"name":"Chainfist","range":"Melee","type":"Melee","a":"1","bsWs":"5","s":"6","ap":"-2","d":"2","desc":"anti-vehicle 3+"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Breaching Team","description":"Each time a model in this unit makes an attack, re-roll a Wound roll of 1. If the target is within range of an objective marker, you can re-roll the Wound roll instead.","type":"Datasheet"},{"name":"Gheistskull","description":"Once per battle, when you select this unit as the target of the Grenade Stratagem, you can target one enemy unit visible to and within 18\" of this unit that is not within Engagement Range of any units from your army, instead of one within 8\".","type":"Datasheet"},{"name":"CAT Unit","description":"Once per battle, when this unit is selected to shoot, until the end of the phase, ranged weapons equipped by models in this unit gain the [IGNORES COVER] ability. Designer’s Note: Place one Gheistskull and one CAT Unit token next to this unit, removing each token once the relevant ability has been used.","type":"Datasheet"},{"name":"Endurant Shield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Imperial Navy Breachers","Retinue","Voidfarers","Imperium","Smoke","Grenades","Battleline","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Navis Sergeant-at-Arms","9 Navis Armsmen"],"points":[{"models":"10 models","cost":"90"}],"canLead":[],"ledBy":["000002090","000002090","000002760","000002760","000002762","000002763","000002764","000002765","000000874","000000876","000000876","000000877","000000877","000003812","000001579","000001579","000000874","000004173","000004173"]},{"id":"000003830","name":"Imperial Rhino","role":"Dedicated Transports","loadout":"This model is equipped with: storm bolter; armoured tracks.","transport":"This model has a transport capacity of 12 AGENTS OF THE IMpERIUM Infantry models. It cannot transport TERMINATOR or OFFICIO ASSASSINORUM models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Imperial Rhino","m":"12\"","t":"9","sv":"3+","invSv":"-","w":"10","ld":"6+","oc":"2"}],"weapons":[{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Self Repair","description":"At the end of your Command phase, this model regains 1 lost wound.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Smoke","Transport","Dedicated Transport","Vehicle","Imperium","Imperial Rhino"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Imperial Rhino"],"points":[{"models":"1 model","cost":"75"}],"canLead":[],"ledBy":[]},{"id":"000003826","name":"Indomitor Kill Team","role":"Other","loadout":"Every Kill Team Heavy Intercessor is equipped with: bolt pistol; heavy bolt rifle; close combat weapon. Every Kill Team Heavy Intercessor with power fists is equipped with: flamestorm gauntlets; power fists. Every Kill Team Heavy Intercessor with melta rifle is equipped with: bolt pistol; melta rifle; close combat weapon. Every Kill Team Heavy Intercessor with jump pack is equipped with: assault bolters; close combat weapon; jump pack.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Indomitor Kill Team","m":"5\"","t":"6","sv":"3+","invSv":"-","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Assault bolters","type":"Ranged","profiles":[{"name":"Assault bolters","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"assault, pistol, sustained hits 2, twin-linked"}]},{"name":"Auto boltstorm gauntlets","type":"Ranged","profiles":[{"name":"Auto boltstorm gauntlets","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":"twin-linked"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"PISTOL"}]},{"name":"Fragstorm grenade launcher","type":"Ranged","profiles":[{"name":"Fragstorm grenade launcher","range":"18","type":"Ranged","a":"D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Heavy bolt rifle","type":"Ranged","profiles":[{"name":"Heavy bolt rifle","range":"30","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"assault, heavy"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"assault, heavy, sustained hits 1"}]},{"name":"Flamestorm gauntlets","type":"Ranged","profiles":[{"name":"Flamestorm gauntlets","range":"12","type":"Ranged","a":"D6+1","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Melta rifle","type":"Ranged","profiles":[{"name":"Melta rifle","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma exterminators – standard","type":"Ranged","profiles":[{"name":"Plasma exterminators – standard","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"7","ap":"-2","d":"2","desc":"assault, pistol, twin-linked"}]},{"name":"Plasma exterminators – supercharge","type":"Ranged","profiles":[{"name":"Plasma exterminators – supercharge","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"8","ap":"-3","d":"3","desc":"assault, hazardous, pistol, twin-linked"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Power fists","type":"Melee","profiles":[{"name":"Power fists","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"twin-linked"}]}],"abilities":[{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Kill Team Terminator models, Kill Team Outrider models, Kill Team Biker models and models equipped with a jump pack each take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the Terminator, Mounted or Jump Pack keywords. For the purposes of interacting with terrain features, all models in units with this ability are considered INFANTRY models, even though similar models in other units may have the MOUNTED or JUMP PACK keywords. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated movement, TRANSPORT and Benefit of Cover rules.","type":"Faction"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Jump Pack","description":"The bearer has a Move characteristic of 10\" and can move over models and terrain features as if they were not there.","type":"Wargear"},{"name":"Indomitor Doctrines","description":"Each time a model in this unit makes an attack, add 1 to the Hit roll if this unit is below its Starting Strength, and add 1 to the Wound roll as well if this unit is Below Half-strength.","type":"Datasheet"},{"name":"ATTACHED UNIT","description":"If a CHARACTER unit from your army can be attached to a Deathwatch Kill Team, it can be attached to this unit instead.","type":"Fortification (левая колонка)"},{"name":"TRANSPORT","description":"This unit cannot embark within an Imperial Rhino.","type":"Fortification (левая колонка)"}],"keywords":["Retinue","Deathwatch","Indomitor Kill Team","Grenades","Kill Team","Infantry","Imperium","Ordo Xenos"],"factionKeywords":["Agents of the Imperium"],"composition":["10 MODELS MAXIMUM","5-10 Kill Team Heavy Intercessors","0-2 Kill Team Heavy Intercessors with power fists","0-2 Kill Team Heavy Intercessors with melta rifles","0-2 Kill Team Heavy Intercessors with jump packs"],"points":[{"models":"5 models","cost":"120"},{"models":"10 models","cost":"240"}],"canLead":[],"ledBy":["000002760","000003814","000003815","000001579"]},{"id":"000000877","name":"Inquisitor","role":"Characters","loadout":"This model is equipped with: bolt pistol; Inquisitorial melee weapon; blessed wardings.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Inquisitor","m":"6\"","t":"3","sv":"4+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Psychic Shock Wave","type":"Ranged","profiles":[{"name":"Psychic Shock Wave","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"3","ap":"-2","d":"1","desc":"devastating wounds, psychic, torrent"}]},{"name":"Inquisitorial melee weapon","type":"Melee","profiles":[{"name":"Inquisitorial melee weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any Transport that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Power of the Rosette","description":"Each time you target this model’s unit with a Stratagem, roll one D6: on a 3+, you gain 1CP.","type":"Datasheet"},{"name":"Blessed Wardings","description":"While this model is leading a unit, models in that unit have the 6+ invulnerable save.","type":"Wargear"},{"name":"Psychic Gifts","description":"The bearer has the PSYKER keyword.","type":"Wargear"}],"keywords":["Inquisitor","Infantry","Character","Grenades","Imperium"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor"],"points":[{"models":"1 model","cost":"55"}],"canLead":["000003818","000003949","000000305","000002612","000003950","000004174","000000303","000003825","000000381","000004154","000002767","000002799","000003948","000004074","000000903","000002684","000003824","000002783","000002587","000003827","000000070","000000382","000003843","000002613","000001157","000001177","000000849","000000882","000001606","000003816","000000848","000004175","000003813","000003822","000002587","000003842","000002614","000002683","000002685","000002683"],"ledBy":[]},{"id":"000000876","name":"Inquisitor Coteaz","role":"Characters","loadout":"This model is equipped with: bolt pistol; Psychic Blast; Nemesis daemon hammer; Glovodan psyber-eagle.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Inquisitor Coteaz","m":"6\"","t":"3","sv":"2+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Psychic Blast","type":"Ranged","profiles":[{"name":"Psychic Blast","range":"18","type":"Ranged","a":"D6","bsWs":"3","s":"3","ap":"-1","d":"1","desc":"anti-daemon 4+, anti-infantry 5+, devastating wounds, psychic"}]},{"name":"Nemesis daemon hammer","type":"Melee","profiles":[{"name":"Nemesis daemon hammer","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"9","ap":"-3","d":"3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any TRANSPORT that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Malefic Wardings (Psychic)","description":"While this model is leading a unit, models in that unit have a 6+ invulnerable save, and a 4+ invulnerable save against Psychic Attacks and attacks made by DAEMON models.","type":"Datasheet"},{"name":"Spy Network","description":"Each time your opponent gains a CP as the result of an ability, roll one D6: on a 2+, you also gain 1CP.","type":"Datasheet"},{"name":"Glovodan Psyber-eagle","description":"In your Command phase, you can select one enemy unit within 18\" of the bearer. Until the start of your next Command phase, that unit cannot have the Benefit of Cover. Designer’s Note: Place a Glovodan Psyber-eagle token next to the selected unit to remind you.","type":"Wargear"}],"keywords":["Psyker","Imperium","Ordo Malleus","Inquisitor","Coteaz","Infantry","Character","Epic Hero"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Coteaz – EPIC HERO"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"75"},{"models":"1 model (Assigned Agent)","cost":"95"}],"canLead":["000002613","000000849","000003843","000003948","000003842","000001606","000000303","000003825","000000381","000004154","000000903","000002799","000000382","000000305","000003822","000003816","000003949","000002683","000002587","000002783","000001157","000002685","000000848","000003827","000002612","000002683","000000070","000003824","000002767","000001177","000002587","000003950","000004174","000003813","000000882","000004175","000002614","000002684"],"ledBy":[]},{"id":"000002090","name":"Inquisitor Draxus","role":"Characters","loadout":"This model is equipped with: Dirgesinger; Psychic Tempest; power fist.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Inquisitor Draxus","m":"6\"","t":"3","sv":"3+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Dirgesinger","type":"Ranged","profiles":[{"name":"Dirgesinger","range":"18","type":"Ranged","a":"4","bsWs":"3","s":"4","ap":"0","d":"2","desc":"anti-infantry 4+, assault, devastating wounds"}]},{"name":"Psychic Tempest","type":"Ranged","profiles":[{"name":"Psychic Tempest","range":"18","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"0","d":"2","desc":"psychic, sustained hits 2"}]},{"name":"Power fist","type":"Melee","profiles":[{"name":"Power fist","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"6","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any TRANSPORT that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Xenos Hunter","description":"While this model is leading a unit, each time a model in that unit makes an attack that targets an enemy unit that does not have the IMPERIUM or CHAOS keywords, add 1 to the Hit roll.","type":"Datasheet"},{"name":"Psychic Veil (Psychic)","description":"In your Command phase, this PSYKER can use this ability. If it does, roll one D6: on a 1, this PSYKER’s unit suffers D3 mortal wounds; on a 2+, until the start of your next Command phase, this PSYKER’s unit can only be selected as the target of a ranged attack if the attacking model is within 18\".","type":"Datasheet"}],"keywords":["Inquisitor","Ordo Xenos","Imperium","Character","Grenades","Psyker","Epic Hero","Infantry","Draxus"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Draxus – EPIC HERO"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"75"},{"models":"1 model (Assigned Agent)","cost":"95"}],"canLead":["000002783","000002684","000003842","000001177","000002799","000000382","000002683","000003816","000000849","000003843","000002612","000003827","000002614","000002683","000000882","000002613","000003950","000000305","000003822","000002685","000004154","000002587","000000381","000002587","000001157","000003948","000000070","000003825","000003824","000003949","000000848","000000303","000001606","000004174","000004175","000000903","000002767"],"ledBy":[]},{"id":"000001579","name":"Inquisitor Eisenhorn","role":"Characters","loadout":"This model is equipped with: artificer bolt pistol; Mind Assault; runestaff and Barbarisater","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Inquisitor Eisenhorn","m":"6\"","t":"3","sv":"4+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Artificer bolt pistol","type":"Ranged","profiles":[{"name":"Artificer bolt pistol","range":"12","type":"Ranged","a":"4","bsWs":"3","s":"4","ap":"0","d":"2","desc":null}]},{"name":"Mind Assault","type":"Ranged","profiles":[{"name":"Mind Assault","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-2","d":"3","desc":"devastating wounds, precision, psychic, sustained hits 1"}]},{"name":"Runestaff and Barbarisater","type":"Melee","profiles":[{"name":"Runestaff and Barbarisater","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"psychic"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any Transport that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Malus Codicium","description":"While this model is leading a unit, double the Attacks characteristic of melee weapons equipped by Daemonhost models in that unit.","type":"Datasheet"},{"name":"Dominate Will (Psychic)","description":"At the start of your opponent’s Shooting phase, select one enemy INFANTRY unit that is within 12\" of and visible to this model and roll one D6: on a 1, this model suffers D3 mortal wounds; on a 2-5, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll; on a 6, until the end of the phase, that unit is not eligible to shoot.","type":"Datasheet"}],"keywords":["Character","Eisenhorn","Inquisitor","Ordo Xenos","Imperium","Infantry","Epic Hero","Psyker","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Eisenhorn – EPIC HERO"],"points":[{"models":"1 model","cost":"65"}],"canLead":["000002614","000000303","000003948","000000305","000000882","000000381","000001177","000002684","000004154","000003816","000003822","000001157","000002587","000002587","000004174","000003843","000003950","000003949","000000848","000001606","000000070","000003827","000002767","000002783","000002612","000002685","000002799","000002613","000002683","000003842","000004175","000003821","000000903","000003824","000003825","000003826","000000382","000003828","000002683","000000849","000003816"],"ledBy":[]},{"id":"000000874","name":"Inquisitor Greyfax","role":"Characters","loadout":"This model is equipped with: Castigation; condemnor stake; master-crafter power sword.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Inquisitor Greyfax","m":"6\"","t":"3","sv":"3+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Castigation","type":"Ranged","profiles":[{"name":"Castigation","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-2","d":"3","desc":"anti-character 4+, devastating wounds, precision, psychic"}]},{"name":"Condemnor stake","type":"Ranged","profiles":[{"name":"Condemnor stake","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"anti-psyker 2+, devastating wounds, precision, rapid fire 1"}]},{"name":"Master-crafted power sword","type":"Melee","profiles":[{"name":"Master-crafted power sword","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any TRANSPORT that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Psyoculum","description":"While this model is leading a unit, ranged weapons equipped by models in that unit have the [ANTI-PSYKER 4+] ability.","type":"Datasheet"},{"name":"No Mercy","description":"While this model is leading a unit, each time a model in that unit makes an attack that targets a unit that is Below Half-strength, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Imperium","Ordo Hereticus","Greyfax","Inquisitor","Infantry","Epic Hero","Psyker","Character","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Greyfax – EPIC HERO"],"points":[{"models":"1 model","cost":"65"}],"canLead":["000002685","000002783","000002614","000000381","000001606","000004074","000003825","000002684","000003843","000002612","000001157","000003818","000000882","000000903","000003822","000000848","000003949","000003827","000002799","000002683","000003842","000003948","000000070","000003950","000003816","000003824","000000849","000000303","000000382","000002613","000004174","000000305","000004154","000004175","000002683","000002587","000002587","000001177","000002767"],"ledBy":[]},{"id":"000002760","name":"Inquisitor In Terminator Armour","role":"Characters","loadout":"This model is equipped with: storm bolter; Inquisitorial melee weapon; blessed wardings.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Inquisitor In Terminator Armour","m":"5\"","t":"4","sv":"2+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Psycannon","type":"Ranged","profiles":[{"name":"Psycannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"8","ap":"-1","d":"2","desc":"psychic"}]},{"name":"Psychic shock wave","type":"Ranged","profiles":[{"name":"Psychic shock wave","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"3","ap":"-2","d":"1","desc":"devastating wounds, psychic, torrent"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"D3","desc":"psychic"}]},{"name":"Inquisitorial melee weapon","type":"Melee","profiles":[{"name":"Inquisitorial melee weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this model is leading a unit, it can embark within any Transport that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Power of the Rosette","description":"Each time you target this model’s unit with a Stratagem, roll one D6: on a 3+, you gain 1CP.","type":"Datasheet"},{"name":"Blessed Wardings","description":"While the bearer is leading a unit, models in that unit have a 6+ invulnerable save.","type":"Wargear"},{"name":"Psychic Gifts","description":"The bearer has the PSYKER keyword.","type":"Wargear"}],"keywords":["Imperium","Inquisitor","Terminator","Grenades","Character","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor in Terminator Armour"],"points":[{"models":"1 model","cost":"70"}],"canLead":["000003824","000003822","000002783","000003843","000004175","000000848","000002587","000000382","000001606","000003826","000002613","000003813","000002683","000004174","000004074","000000303","000000849","000002683","000003816","000003950","000001157","000000305","000003818","000002614","000002612","000003948","000002799","000002685","000002587","000004154","000002767","000000070","000003842","000000381","000003827","000000903","000003949","000003825","000003816","000003821","000000882","000001177","000002684"],"ledBy":[]},{"id":"000000875","name":"Inquisitor Karamazov","role":"Characters","loadout":"This model is equipped with: master-crafted multi-melta; master-crafted power sword.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Inquisitor Karamazov","m":"8\"","t":"9","sv":"3+","invSv":"4","w":"10","ld":"6+","oc":"3"}],"weapons":[{"name":"Master-crafted multi-melta","type":"Ranged","profiles":[{"name":"Master-crafted multi-melta","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"10","ap":"-4","d":"D6","desc":"melta 3"}]},{"name":"Master-crafted power sword","type":"Melee","profiles":[{"name":"Master-crafted power sword","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"6","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Throne of Judgement (Aura)","description":"While a friendly unit is within 6\" of this model, improve the Leadership characteristic of models in that unit by 1. While an enemy unit is within 6\" of this model, worsen the Leadership characteristic of models in that unit by 1.","type":"Datasheet"},{"name":"Unsubtle Crusader","description":"At the start of the Declare Battle Formations step, you can select up to three Agents of the Imperium Infantry units from your army, or one Imperium Battleline unit from your army – those units gain the Scouts 6\" ability.","type":"Datasheet"}],"keywords":["Character","Vehicle","Imperium","Epic Hero","Walker","Inquisitor","Ordo Hereticus","Karamazov"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Karamazov – EPIC HERO"],"points":[{"models":"1 model","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000004173","name":"Inquisitor Ostromandeus","role":"Characters","loadout":"Inquisitor Ostromandeus is equipped with: inferno pistol; power sword, vox-skull. Stentor-I-52 is equipped with: hydraulic vox-ram.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"INQUISITOR OSTROMANDEUS","m":"6\"","t":"3","sv":"3+","invSv":"5","w":"4","ld":"6+","oc":"1"},{"name":"STENTOR-I-52","m":"6\"","t":"3","sv":"4+","invSv":"-","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"melta 2, pistol"}]},{"name":"Hydraulic vox-ram","type":"Melee","profiles":[{"name":"Hydraulic vox-ram","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-2","d":"2","desc":null}]},{"name":"Power sword","type":"Melee","profiles":[{"name":"Power sword","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Authority of the Inquisition","description":"While this unit is leading a unit, it can embark within any Transport that its Bodyguard unit can embark within.","type":"Datasheet"},{"name":"Ward Against the Malefic Arts","description":"While this unit is leading a unit, each time a Psychic Attack targets that unit, subtract 1 from the Hit roll and subtract 1 from the Wound roll.","type":"Datasheet"},{"name":"Vox-cast Proclamations (Aura)","description":"Each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this unit’s Inquisitor Ostromandeus model, increase the cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Vox-skull","description":"Once per battle, at the start of any phase, you can select one enemy unit (excluding MONSTERS and VEHICLES) within 12\" of the bearer. That unit must take a Battle-shock test; if that test is failed, until the end of your next turn, that unit cannot have the Benefit of Cover. Designer’s Note: Place a vox-skull token next to the unit, removing it once this ability has been used.","type":"Wargear"}],"keywords":["Imperium","Character","Epic Hero","Inquisitor Ostromandeus","Grenades","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitor Ostromandeus – EPIC HERO","1 Stentor-I-52 – EPIC HERO"],"points":[{"models":"2 models","cost":"65"}],"canLead":["000000882","000000070","000000848","000003948","000003827","000003842","000000849","000000381","000003818","000001157","000004154","000001606","000003825","000003824","000000303","000002799","000003822","000002614","000002783","000003950","000002587","000002684","000004174","000000382","000002683","000002685","000002683","000002612","000004175","000003816","000001177","000003949","000000903","000002613","000000305","000002587","000002767","000003843"],"ledBy":[]},{"id":"000002767","name":"Inquisitorial Agents","role":"Other","loadout":"*This unit can only contain 2 Gun Servitors if it also contains 10 Inquisitorial Agents. Every Inquisitorial Agent is equipped with: agent firearm; agent melee weapon. Every Gun Servitor is equipped with: heavy bolter; agent melee weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Inquisitorial Agents","m":"6\"","t":"3","sv":"5+","invSv":"-","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Agent firearm","type":"Ranged","profiles":[{"name":"Agent firearm","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"heavy, sustained hits 1"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma cannon – standard","type":"Ranged","profiles":[{"name":"Plasma cannon – standard","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-1","d":"1","desc":"blast, heavy"}]},{"name":"Plasma cannon – supercharge","type":"Ranged","profiles":[{"name":"Plasma cannon – supercharge","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"blast, hazardous, heavy"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-2","d":"2","desc":"hazardous, pistol"}]},{"name":"Agent melee weapon","type":"Melee","profiles":[{"name":"Agent melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Eviscerator","type":"Melee","profiles":[{"name":"Eviscerator","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"devastating wounds"}]},{"name":"Mystic stave","type":"Melee","profiles":[{"name":"Mystic stave","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"5","ap":"-1","d":"D3","desc":"ANTI-INFANTRy 4+, psychic"}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Loyal Henchmen","description":"While an Inquisitor model is leading this unit, each time an attack is made against this unit, subtract 1 from the Wound roll.","type":"Datasheet"},{"name":"Tome-skull","description":"Once per battle for each Tome-skull this unit is equipped with, at the start of any phase, you can select either one friendly AGENTS OF THE IMPERIUM unit that is Battle-shocked and within 6\" of this unit or one enemy unit within 6\" of this unit. If you select a friendly unit, that unit is no longer Battle-shocked. If you select an enemy unit, it must take a Battle-shock test. Designer’s Note: Place the appropriate number of Tome-skull tokens next to the unit at the start of the battle, removing one each time this unit uses this ability.","type":"Wargear"},{"name":"INQUISITORIAL HENCHMEN","description":"If your Army Faction is not AGENTS OF THE IMPERIUM, then for each Inquisitor unit you include in your army, you can include one INQUISITORIAL AGENTS unit in your army that does not count towards the number of RETINUE units your army can include (see Assigned Agents).","type":"Special (правая колонка)"}],"keywords":["Retinue","Inquisitorial Agents","Infantry","Imperium","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["5-10 Inquisitorial Agents","1-2 Gun Servitors*"],"points":[{"models":"6 models (AGENTS OF THE IMPERIUM Detachment)","cost":"50"},{"models":"12 models (AGENTS OF THE IMPERIUM Detachment)","cost":"100"},{"models":"6 models (Assigned Agent)","cost":"60"},{"models":"12 models (Assigned Agent)","cost":"120"}],"canLead":[],"ledBy":["000002760","000000876","000000877","000003812","000003829","000001579","000002090","000000874","000004173"]},{"id":"000003820","name":"Inquisitorial Chimera","role":"Dedicated Transports","loadout":"This model is equipped with: multi-laser; heavy bolter; lasgun array; armoured tracks.","transport":"This model has a transport capacity of 13 INQUISITOR INFANTRy and INQUISITORIAl AGENT models. It cannot transport TERMINATOR models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chimera","m":"10\"","t":"9","sv":"3+","invSv":"-","w":"11","ld":"7+","oc":"2"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Heavy stubber","type":"Ranged","profiles":[{"name":"Heavy stubber","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"rapid fire 3"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"4","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Lasgun array","type":"Ranged","profiles":[{"name":"Lasgun array","range":"24","type":"Ranged","a":"6","bsWs":"4","s":"3","ap":"0","d":"1","desc":"rapid fire 6"}]},{"name":"Multi-laser","type":"Ranged","profiles":[{"name":"Multi-laser","range":"36","type":"Ranged","a":"4","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Rapid Deployment","description":"Units can disembark from this TRANSPORT after it has Advanced. Units that do so count as having made a Normal move that phase, and cannot declare a charge in the same turn, but can otherwise act normally.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Vehicle","Smoke","Inquisitorial Chimera","Imperium","Dedicated Transport","Transport"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Inquisitorial Chimera"],"points":[{"models":"1 model","cost":"70"}],"canLead":[],"ledBy":[]},{"id":"000002763","name":"Janus Draik","role":"Characters","loadout":"This model is equipped with: heirloom pistol; monomolecular rapier.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Janus Draik","m":"6\"","t":"3","sv":"4+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Heirloom pistol","type":"Ranged","profiles":[{"name":"Heirloom pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"3","desc":"anti-infantry 4+, pistol"}]},{"name":"Monomolecular rapier","type":"Melee","profiles":[{"name":"Monomolecular rapier","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Backroom Deals","description":"If your army contains one or more units with this ability, during the Declare Battle Formations step, select one of those units. While the selected unit is leading a unit, models in that unit have the Infiltrators ability.","type":"Datasheet"},{"name":"Warrant of Trade","description":"If your army includes one or more units with this ability, after both players have deployed their armies, select up to D3 Imperium Battleline units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves, regardless of how many units are already in Strategic Reserves.","type":"Datasheet"}],"keywords":["Voidfarers","Infantry","Grenades","Imperium","Character","Epic Hero","Janus Draik"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Janus Draik – EPIC HERO"],"points":[{"models":"1 model","cost":"40"}],"canLead":["000002509","000002587"],"ledBy":[]},{"id":"000003829","name":"Jokaero Weaponsmith","role":"Characters","loadout":"Every model is equipped with: Jokaero weapons; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"You can attach this model to an Inquisitorial Agents unit, even if one Inquisitor unit has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":true,"models":[{"name":"Jokaero Weaponsmith","m":"6\"","t":"3","sv":"5+","invSv":"4","w":"2","ld":"7+","oc":"0"}],"weapons":[{"name":"Jokaero weapons – scattered","type":"Ranged","profiles":[{"name":"Jokaero weapons – scattered","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"TORRENT"}]},{"name":"Jokaero weapons – focused","type":"Ranged","profiles":[{"name":"Jokaero weapons – focused","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"10","ap":"-1","d":"3","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"5","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Inconceivable Augmentation","description":"While this model is leading a unit, ranged weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"A Weaponsmith, Not a Warlord","description":"This model cannot be selected to be your WARLORD. While an Inquisitor model is leading a unit that includes one or more JOKAERO WEAPONSMITH models, the Objective Control characteristic of JOKAERO WEAPONSMITH models in that unit is 1.","type":"Datasheet"},{"name":"INQUISITORIAL AGENT","description":"If your Army Faction is not AGENTS OF THE IMPERIUM, then for each unique pairing of 1 Inquisitorial Agents unit and 1 JOKAERO WEAPONSMITH unit occuring in your army, increase the maximum number of Character units permitted in your army by 1.","type":"Fortification (левая колонка)"}],"keywords":["Infantry","Jokaero Weaponsmith","Character","Imperium"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Jokaero Weaponsmith"],"points":[{"models":"1 model","cost":"30"}],"canLead":["000002767"],"ledBy":[]},{"id":"000003821","name":"Kill Team Cassius","role":"Characters","loadout":null,"transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"KILL TEAM VETERAN","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"2"},{"name":"KILL TEAM BIKER","m":"12\"","t":"5","sv":"3+","invSv":"-","w":"3","ld":"6+","oc":"2"},{"name":"CHAPLAIN CASSIUS","m":"6\"","t":"4","sv":"3+","invSv":"4","w":"4","ld":"5+","oc":"2"},{"name":"KILL TEAM TERMINATOR","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Deathwatch twin boltgun","type":"Ranged","profiles":[{"name":"Deathwatch twin boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"TWIN-LINKED"}]},{"name":"Frag cannon","type":"Ranged","profiles":[{"name":"Frag cannon","range":"18","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-1","d":"2","desc":"blast, heavy, rapid fire d3"}]},{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Long Vigil ranged weapon","type":"Ranged","profiles":[{"name":"Long Vigil ranged weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Psychic Cleanse","type":"Ranged","profiles":[{"name":"Psychic Cleanse","range":"24","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"-1","d":"D3","desc":"psychic"}]},{"name":"Artificer crozius","type":"Melee","profiles":[{"name":"Artificer crozius","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"6","ap":"-1","d":"2","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"5","ap":"-3","d":"D3","desc":"psychic"}]},{"name":"Long Vigil melee weapon","type":"Melee","profiles":[{"name":"Long Vigil melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Power fist","type":"Melee","profiles":[{"name":"Power fist","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Twin lightning claws","type":"Melee","profiles":[{"name":"Twin lightning claws","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"twin-linked"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Kill Team Terminator models, Kill Team Outrider models, Kill Team Biker models and models equipped with a jump pack each take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the Terminator, Mounted or Jump Pack keywords. For the purposes of interacting with terrain features, all models in units with this ability are considered INFANTRY models, even though similar models in other units may have the MOUNTED or JUMP PACK keywords. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated movement, TRANSPORT and Benefit of Cover rules.","type":"Faction"},{"name":"Catechism of Death","description":"While this unit contains Chaplain Cassius, melee weapons equipped by models in this unit have the [DEVASTATING WOUNDS] ability.","type":"Datasheet"},{"name":"Unflinching","description":"You can re-roll Battle-shock tests for this unit.","type":"Datasheet"},{"name":"Jump Pack","description":"The bearer has a Move characteristic of 12\" and can move over models and terrain as if they were not there.","type":"Wargear"},{"name":"Psychic Hood","description":"Models in the bearer’s unit have the Feel No Pain 4+ ability against Psychic Attacks.","type":"Wargear"},{"name":"CASSIUS","description":"Your army cannot contain both Chaplain Cassius and KILL TEAM CASSIUS.","type":"Special (правая колонка)"}],"keywords":["Ordo Xenos","Imperium","Grenades","Kill Team","Infantry","Epic Hero","Character","Kill Team Cassius","Deathwatch"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Chaplain Cassius – EPIC HERO","8 Kill Team Veterans: Vael DonatusZameon GydraelRodricus GryttAntor DelassioEdryc SetoraxJensus NatorianDrenn RedbladeEnnox Sorrlock","1 Kill Team Terminator (Garran Branatar)","1 Kill Team Biker (Jetek Suberei)"],"points":[{"models":"11 models","cost":"220"}],"canLead":[],"ledBy":["000002760","000003814","000003815","000001579"]},{"id":"000003812","name":"Ministorum Priest","role":"Characters","loadout":"This model is equipped with: zealot’s vindictor.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"You can attach this model to an INQUISITORIAl AGENTS unit, even if one INQUISITOR has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":false,"models":[{"name":"Ministorum Priest","m":"6\"","t":"3","sv":"6+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Holy pistol","type":"Ranged","profiles":[{"name":"Holy pistol","range":"12","type":"Ranged","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pISTOl"}]},{"name":"Zealot’s vindictor","type":"Ranged","profiles":[{"name":"Zealot’s vindictor","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"IGNORES COvER, TORRENT"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"Zealot's vindictor","type":"Melee","profiles":[{"name":"Zealot's vindictor","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Holy Hatred","description":"While this model is leading a unit, melee weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Zealot","description":"Once per battle, in the Fight phase, this model can use this ability. If it does, until the end of the phase, improve the Strength and Attacks characteristics of melee weapons equipped by this model by 3.","type":"Datasheet"}],"keywords":["Ministorum Priest","Imperium","Infantry","Character","Ordo Hereticus"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Ministorum Priest"],"points":[{"models":"1 model","cost":"40"}],"canLead":["000002683","000002767","000002685","000002587","000002684","000003818","000004074"],"ledBy":[]},{"id":"000002765","name":"Navigator","role":"Characters","loadout":"This model is equipped with: laspistol; force-orb cane.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Navigator","m":"6\"","t":"3","sv":"5+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Laspistol","type":"Ranged","profiles":[{"name":"Laspistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Force-orb cane","type":"Melee","profiles":[{"name":"Force-orb cane","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Gaze into the Empyrean (Psychic)","description":"Enemy units that are set up on the battlefield as Reinforcements cannot be set up within 12\" of this model.","type":"Datasheet"},{"name":"Third Eye (Psychic)","description":"At the start of your Shooting phase, select one enemy unit within 12\" of and visible to this model. That unit must take a Battle-shock test, subtracting 2 from the result if it is an INFANTRY unit. If the test is failed, that enemy unit suffers 3 mortal wounds.","type":"Datasheet"}],"keywords":["Infantry","Character","Psyker","Imperium","Voidfarers","Navigator"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Navigator"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"60"},{"models":"1 model (Assigned Agent)","cost":"75"}],"canLead":["000002509","000002587"],"ledBy":[]},{"id":"000002764","name":"Neyam Shai Murad","role":"Characters","loadout":"This model is equipped with: negotiator pistols; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Neyam Shai Murad","m":"6\"","t":"3","sv":"4+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Negotiator pistol","type":"Ranged","profiles":[{"name":"Negotiator pistol","range":"12","type":"Ranged","a":"4","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"precision"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Backroom Deals","description":"If your army contains one or more units with this ability, during the Declare Battle Formations step, select one of those units. While the selected unit is leading a unit, models in that unit have the Infiltrators ability.","type":"Datasheet"},{"name":"Warrant of Trade","description":"If your army includes one or more units with this ability, after both players have deployed their armies, select up to D3 Imperium Battleline units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves, regardless of how many units are already in Strategic Reserves.","type":"Datasheet"}],"keywords":["Infantry","Grenades","Imperium","Character","Epic Hero","Neyam Shai Murad","Voidfarers"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Neyam Shai Murad – EPIC HERO"],"points":[{"models":"1 model","cost":"40"}],"canLead":["000002509","000002587"],"ledBy":[]},{"id":"000003824","name":"Proteus Kill Team","role":"Other","loadout":"Every Kill Team Veteran is equipped with: boltgun; Long Vigil melee weapon; close combat weapon. Every Kill Team Veteran with Jump Pack is equipped with: Long Vigil melee weapon; close combat weapon; jump pack. Every Kill Team Biker is equipped with: twin boltgun; close combat weapon. Every Kill Team Terminator is equipped with: storm bolter; power fist.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"KILL TEAM VETERANS","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"1"},{"name":"KILL TEAM BIKER","m":"12\"","t":"5","sv":"3+","invSv":"-","w":"3","ld":"6+","oc":"2"},{"name":"KILL TEAM TERMINATOR","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Assault cannon","type":"Ranged","profiles":[{"name":"Assault cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"0","d":"1","desc":"DEVASTATING WOUNDS"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Cyclone missile launcher – frag","type":"Ranged","profiles":[{"name":"Cyclone missile launcher – frag","range":"36","type":"Ranged","a":"2D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"BLAST"},{"name":"Cyclone missile launcher – krak","range":"36","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null}]},{"name":"Frag cannon","type":"Ranged","profiles":[{"name":"Frag cannon","range":"18","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-1","d":"2","desc":"blast, heavy, rapid fire d3"}]},{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"IGNORES COVER, TORRENT"}]},{"name":"Infernus heavy bolter – heavy bolter","type":"Ranged","profiles":[{"name":"Infernus heavy bolter – heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"HEAVY, SUSTAINED HITS 1"},{"name":"Infernus heavy bolter – heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"IGNORES COVER, TORRENT"}]},{"name":"Long Vigil ranged weapon","type":"Ranged","profiles":[{"name":"Long Vigil ranged weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"}]},{"name":"Plasma cannon – standard","type":"Ranged","profiles":[{"name":"Plasma cannon – standard","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-2","d":"1","desc":"BLAST, HEAVY"},{"name":"Plasma cannon – supercharge","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"8","ap":"-3","d":"2","desc":"BLAST, HAZARDOUS, HEAVY"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Twin boltgun","type":"Ranged","profiles":[{"name":"Twin boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"twin-linked"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Chainfist","type":"Melee","profiles":[{"name":"Chainfist","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"anti-vehicle 3+"}]},{"name":"Deathwatch thunder hammer","type":"Melee","profiles":[{"name":"Deathwatch thunder hammer","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"10","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Long Vigil melee weapon","type":"Melee","profiles":[{"name":"Long Vigil melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Power fist","type":"Melee","profiles":[{"name":"Power fist","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Terminator thunder hammer","type":"Melee","profiles":[{"name":"Terminator thunder hammer","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"8","ap":"-2","d":"2","desc":"devastating wounds"}]},{"name":"Twin lightning claws","type":"Melee","profiles":[{"name":"Twin lightning claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"twin-linked"}]}],"abilities":[{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Kill Team Terminator models, Kill Team Outrider models, Kill Team Biker models and models equipped with a jump pack each take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the Terminator, Mounted or Jump Pack keywords. For the purposes of interacting with terrain features, all models in units with this ability are considered INFANTRY models, even though similar models in other units may have the MOUNTED or JUMP PACK keywords. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated movement, TRANSPORT and Benefit of Cover rules.","type":"Faction"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Proteus Doctrines","description":"Each time a model in this unit makes an attack that targets a unit that is not Below Half-strength, add 1 to the Hit roll.","type":"Datasheet"},{"name":"Astartes Shield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"},{"name":"Jump Pack","description":"The bearer has a Move characteristic of 12\" and can move over models and terrain features as if they were not there.","type":"Wargear"},{"name":"Storm Shield","description":"The bearer has a Wounds characteristic of 4.","type":"Wargear"},{"name":"ATTACHED UNIT","description":"If a Character unit from your army with the Leader ability can be attached to a Deathwatch Kill Team, it can be attached to this unit instead.","type":"Special (правая колонка)"}],"keywords":["Retinue","Ordo Xenos","Imperium","Grenades","Deathwatch","Kill Team","Infantry","Proteus Kill Team"],"factionKeywords":["Agents of the Imperium"],"composition":["10 MODELS MAXIMUM","5-10 Kill Team Veterans","0-4 Kill Team Veterans with Jump Packs","0-2 Kill Team Bikers","0-4 Kill Team Terminators"],"points":[{"models":"5 models","cost":"160"},{"models":"10 models","cost":"320"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000000877","000003814","000003815","000001579","000004173"]},{"id":"000002762","name":"Rogue Trader Entourage","role":"Characters","loadout":"The Rogue Trader is equipped with: household pistol; monomolecular cane-rapier. The Death Cult Assassin is equipped with: dartmask; Death Cult power blade. The Lectro-Maester is equipped with: voltaic pistol; close combat weapon. The Rejuvenat Adept is equipped with: laspistol; close combat weapon; healing serum.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"ROGUE TRADER","m":"6\"","t":"3","sv":"4+","invSv":"4","w":"4","ld":"6+","oc":"1"},{"name":"OTHER MODELS","m":"6\"","t":"3","sv":"4+","invSv":"4","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Dartmask","type":"Ranged","profiles":[{"name":"Dartmask","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"2","ap":"-1","d":"D3","desc":"anti-infantry 2+, pistol, precision"}]},{"name":"Household pistol","type":"Ranged","profiles":[{"name":"Household pistol","range":"12","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"pistol, devastating wounds"}]},{"name":"Laspistol","type":"Ranged","profiles":[{"name":"Laspistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Voltaic pistol","type":"Ranged","profiles":[{"name":"Voltaic pistol","range":"12","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"pistol, sustained hits 2"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Death Cult power blade","type":"Melee","profiles":[{"name":"Death Cult power blade","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"precision"}]},{"name":"Monomolecular cane-rapier","type":"Melee","profiles":[{"name":"Monomolecular cane-rapier","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Backroom Deals","description":"If your army contains one or more units with this ability, during the Declare Battle Formations step, select one of those units. While the selected unit is leading a unit, models in that unit have the Infiltrators ability.","type":"Datasheet"},{"name":"Warrant of Trade","description":"If your army includes one or more units with this ability, after both players have deployed their armies, select upto D3 IMpERIUM BATTlElINE units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves, regardless of how many units are already in Strategic Reserves.","type":"Datasheet"},{"name":"Healing Serum","description":"At the start of your Command phase, if the bearer’s unit is below its Starting Strength, you can return up to D3 destroyed models (excluding CHARACTERS) to the bearer’s unit.","type":"Wargear"}],"keywords":["Voidfarers","Infantry","Grenades","Rogue Trader Entourage","Imperium","Character"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Rogue Trader","1 Death Cult Assassin","1 Lectro-Maester","1 Rejuvenat Adept"],"points":[{"models":"4 models (AGENTS OF THE IMPERIUM Detachment)","cost":"75"},{"models":"4 models (Assigned Agent)","cost":"105"}],"canLead":["000002509","000002587"],"ledBy":[]},{"id":"000004074","name":"Sanctifiers","role":"Other","loadout":"The Miraculist is equipped with: holy fire; burning hands. The Salvationist is equipped with: close combat weapon; Salvationist medikit. The Death Cult Assassin is equipped with: Death Cult blades. 1 Missionary is equipped with: plasma gun; Sanctifier melee weapon. 1 Missionary is equipped with: Ministorum flamer; Sanctifier melee weapon. Every Sanctifier is equipped with: Ministorum hand flamer; Sanctifier melee weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"","m":"6\"","t":"3","sv":"6+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Holy fire","type":"Ranged","profiles":[{"name":"Holy fire","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"2","desc":"ignores cover, one shot, torrent"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Plasma gun – standard","type":"Ranged","profiles":[{"name":"Plasma gun – standard","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"7","ap":"-2","d":"1","desc":"rapid fire 1"}]},{"name":"Plasma gun – supercharge","type":"Ranged","profiles":[{"name":"Plasma gun – supercharge","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"8","ap":"-3","d":"2","desc":"hazardous, rapid fire 1"}]},{"name":"Burning hands","type":"Melee","profiles":[{"name":"Burning hands","range":"Melee","type":"Melee","a":"1","bsWs":"2","s":"6","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Death Cult blades","type":"Melee","profiles":[{"name":"Death Cult blades","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"precision"}]},{"name":"Sanctifier melee weapon","type":"Melee","profiles":[{"name":"Sanctifier melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"},{"name":"Ministorum Sermon","description":"While this unit contains a MINISTORUM PRIEST, each time a model in this unit makes a melee attack, add 1 to the Wound roll.","type":"Datasheet"},{"name":"Cherub","description":"Once per battle, you can target this unit with the Command Re-roll Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase. Designer’s Note: Place a Cherub token next to the unit, removing it once this ability has been used.","type":"Datasheet"},{"name":"ATTACHED UNIT","description":"If a Ministorum Priest or Inquisitor model from your army with the Leader ability can be attached to a Sisters of Battle Squad, it can be attached to this unit instead. If a MINISTORUM PRIEST or INQUISITOR model from your army is attached to this unit during the Declare Battle Formations step, that model gains the Scouts 6\" ability.","type":"Fortification (левая колонка)"},{"name":"Salvationist Medikit","description":"In your Command phase, if the bearer is on the battlefield, you can return up to D3 destroyed models (excluding CHARACTER models) to this unit.","type":"Wargear"},{"name":"Simulacrum Imperialis","description":"Improve the Leadership characteristic of models in the bearer’s unit by 1.","type":"Wargear"}],"keywords":["Grenades","Imperium","Retinue","Sanctifiers","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Miraculist","1 Salvationist","1 Death Cult Assassin","2 Missionaries","4 Sanctifiers"],"points":[{"models":"9 models","cost":"100"}],"canLead":[],"ledBy":["000002760","000000874","000000877","000003812"]},{"id":"000003819","name":"Sisters of Battle Immolator","role":"Dedicated Transports","loadout":"This model is equipped with: heavy bolter; immolation flamers; armoured tracks.","transport":"This model has a transport capacity of 6 ORDO HERETICUS INFANTRy models. At the start of the Declare Battle Formations step, you can select one SISTERS OF BATTlE SQUAD from your army. If you do, that unit is split into two units, each containing as equal a number of models as possible (when splitting a unit in this way, make a note of which models form each of the two new units). One of these units must start the battle embarked within this TRANSPORT; the other can start the battle embarked within another TRANSPORT, or it can be deployed as a separate unit.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Immolator","m":"12\"","t":"10","sv":"3+","invSv":"6","w":"11","ld":"7+","oc":"2"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Immolation flamers","type":"Ranged","profiles":[{"name":"Immolation flamers","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Twin heavy bolter","type":"Ranged","profiles":[{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 2, twin-linked"}]},{"name":"Twin multi-melta","type":"Ranged","profiles":[{"name":"Twin multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2, twin-linked"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Purge and Cleanse","description":"Each time this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Transport","Dedicated Transport","Imperium","Ordo Hereticus","Immolator","Smoke","Vehicle"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Immolator"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"100"},{"models":"1 model (Assigned Agent)","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000003818","name":"Sisters of Battle Squad","role":"Other","loadout":"Every model is equipped with: bolt pistol; boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Battle Sisters Squad","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Artificer-crafted storm bolter","type":"Ranged","profiles":[{"name":"Artificer-crafted storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"2","desc":"rapid fire 2"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"}]},{"name":"Condemnor boltgun","type":"Ranged","profiles":[{"name":"Condemnor boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ANTI-PSYKER 2+, DEVASTATING WOUNDS, PRECISION, RAPID FIRE 1"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"heavy, sustained hits 1"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"MElTA 2, pISTOl"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"IGNORES COvER, pISTOl, TORRENT"}]},{"name":"Ministorum heavy flamer","type":"Ranged","profiles":[{"name":"Ministorum heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma pistol - standard","type":"Ranged","profiles":[{"name":"Plasma pistol - standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pISTOl"}]},{"name":"Plasma pistol - supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol - supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"pISTOl, HAzARDOUS"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"-1","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"-1","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Defenders of the Faith","description":"If you control an objective marker at the end of your Command phase and this unit is within range of that objective marker, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.","type":"Datasheet"},{"name":"Incensor Cherub","description":"Once per battle, you can target this unit with the Command Re-roll Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase. Designer’s Note: Place an Incensor Cherub token next to the unit, removing it once this ability has been used.","type":"Datasheet"},{"name":"Simulacrum Imperials","description":"Improve the Leadership characteristic of models in the bearer’s unit by 1.","type":"Wargear"}],"keywords":["Requisitioned","Ordo Hereticus","Grenades","Infantry","Imperium","Sisters of Battle Squad"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Sister Superior","9 Battle Sisters"],"points":[{"models":"10 models (AGENTS OF THE IMPERIUM Detachment)","cost":"100"},{"models":"1 model (Assigned Agent)","cost":"115"}],"canLead":[],"ledBy":["000002760","000000874","000000877","000003812","000004173"]},{"id":"000003827","name":"Spectrus Kill Team","role":"Other","loadout":"Every Kill Team Infiltrator is equipped with: bolt pistol; marksman bolt carbine; close combat weapon. Every Kill Team Infiltrator with bolt sniper rifle is equipped with: bolt pistol; bolt sniper rifle; close combat weapon. Every Kill Team Infiltrator with jump pack is equipped with: bolt pistol; accelerator autocannon; close combat weapon; jump pack. Every Kill Team Infiltrator with occulus bolt carbine is equipped with: bolt pistol; occulus bolt carbine; paired combat blades. Every Kill Team Infiltrator with combat knife is equipped with: special-issue bolt pistol; combat knife.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Spectrus Kill Team","m":"6\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"1"}],"weapons":[{"name":"Accelerator autocannon","type":"Ranged","profiles":[{"name":"Accelerator autocannon","range":"48","type":"Ranged","a":"3","bsWs":"4","s":"8","ap":"-1","d":"2","desc":"heavy"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Bolt carbine","type":"Ranged","profiles":[{"name":"Bolt carbine","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"precision"}]},{"name":"Bolt sniper rifle","type":"Ranged","profiles":[{"name":"Bolt sniper rifle","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"5","ap":"-2","d":"3","desc":"heavy, precision"}]},{"name":"Las fusil","type":"Ranged","profiles":[{"name":"Las fusil","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-3","d":"D6","desc":"heavy"}]},{"name":"Marksman bolt carbine","type":"Ranged","profiles":[{"name":"Marksman bolt carbine","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"heavy"}]},{"name":"Occulus bolt carbine","type":"Ranged","profiles":[{"name":"Occulus bolt carbine","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"assault, ignores cover"}]},{"name":"Special-issue bolt pistol","type":"Ranged","profiles":[{"name":"Special-issue bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol, precision"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Combat knife","type":"Melee","profiles":[{"name":"Combat knife","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"0","d":"1","desc":"precision"}]},{"name":"Paired combat blades","type":"Melee","profiles":[{"name":"Paired combat blades","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Kill Team","description":"Each time an attack targets this unit, if it contains models with different Toughness characteristics, until the attacking unit has finished making its attacks, use the Toughness characteristic of the majority of the models in that unit when determining what roll is required for that attack to successfully wound. If two or more Toughness characteristics are tied for majority, use the highest value. For the purposes of determining which models in this unit can embark within a Transport, Kill Team Terminator models, Kill Team Outrider models, Kill Team Biker models and models equipped with a jump pack each take up the space of 2 models, but can otherwise embark within any TRANSPORT their unit can embark within, even though similar models in other units have the Terminator, Mounted or Jump Pack keywords. For the purposes of interacting with terrain features, all models in units with this ability are considered INFANTRY models, even though similar models in other units may have the MOUNTED or JUMP PACK keywords. Designer’s Note: While the abstractions in the above rule cause some models to behave differently to similar models in other units, they are designed to minimise complicated movement, TRANSPORT and Benefit of Cover rules.","type":"Faction"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Spectrus Doctrines","description":"At the end of your opponent’s turn, if this unit is more than 6\" away from all enemy units, you can remove this unit from the battlefield and place it into Strategic Reserves.","type":"Datasheet"},{"name":"Helix Gauntlet","description":"Models in the bearer’s unit have the Feel No Pain 6+ ability.","type":"Wargear"},{"name":"Infiltrator Comms Array","description":"Each time you target the bearer’s unit with a Stratagem, roll one D6: on a 5+, you gain 1CP.","type":"Wargear"},{"name":"Jump Pack","description":"The bearer has a Move characteristic of 12\" and can move over models and terrain features as if they were not there.","type":"Wargear"},{"name":"ATTACHED UNIT","description":"If a Character from your army with the Leader ability can be attached to an Deathwatch Kill Team, it can be attached to this unit instead.","type":"Fortification (левая колонка)"},{"name":"TRANSPORT","description":"This unit cannot embark within an Imperial Rhino.","type":"Fortification (левая колонка)"}],"keywords":["Imperium","Ordo Xenos","Retinue","Deathwatch","Spectrus Kill Team","Infantry","Kill Team","Smoke","Grenades"],"factionKeywords":["Agents of the Imperium"],"composition":["10 MODELS MAXIMUM","5-10 Kill Team Infiltrators","0-2 Kill Team Infiltrators with bolt sniper rifles","0-2 Kill Team Infiltrators with jump packs","0-4 Kill Team Infiltrators with occulus bolt carbines","0-4 Kill Team Infiltrators with combat knives"],"points":[{"models":"5 models","cost":"90"},{"models":"10 models","cost":"180"}],"canLead":[],"ledBy":["000002090","000002760","000000874","000000876","000000877","000003814","000003815","000001579","000004173"]},{"id":"000002684","name":"Subductor Squad","role":"Other","loadout":"Every Proctor-Subductor and Subductor is equipped with: Arbites shotpistol; shock maul. The Cyber-mastiff is equipped with: mechanical bite.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Subductor Squad","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Arbites shotpistol","type":"Ranged","profiles":[{"name":"Arbites shotpistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Mechanical bite","type":"Melee","profiles":[{"name":"Mechanical bite","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Shock maul","type":"Melee","profiles":[{"name":"Shock maul","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Dedication to Duty","description":"Each time a model in this unit is destroyed by a melee attack, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.","type":"Datasheet"},{"name":"Nuncio Aquila","description":"Once per battle, at the start of any Command phase, you can select one objective marker within 6\" of the bearer. All enemy units (excluding MONSTERS and VEHICLES) within range of that objective marker must take a Battle-shock test. Each objective marker can only be targeted by this ability once per turn. Designer’s Note: Place one Nuncio-aquila token next to the bearer, removing it once it uses this ability.","type":"Wargear"}],"keywords":["Infantry","Adeptus Arbites","Retinue","Imperium","Grenades","Subductor Squad"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Proctor-Subductor","9 Subductors","1 Cyber-mastiff"],"points":[{"models":"11 models (AGENTS OF THE IMPERIUM Detachment)","cost":"85"},{"models":"11 models (Assigned Agent)","cost":"100"}],"canLead":[],"ledBy":["000002090","000000874","000000877","000003812","000001579","000004173","000000876","000002760"]},{"id":"000002766","name":"UR-025","role":"Characters","loadout":"This model is equipped with: Mk 1 assault weapon; power claw.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Ur-025","m":"5\"","t":"5","sv":"3+","invSv":"-","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Mk 1 assault weapon","type":"Ranged","profiles":[{"name":"Mk 1 assault weapon","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"ASSAULT"}]},{"name":"Power claw","type":"Melee","profiles":[{"name":"Power claw","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"8","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Self Repair","description":"At the start of your Command phase, this model regains 1 lost wound.","type":"Datasheet"},{"name":"Evade and Survive","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this model, if this model is not within Engagement Range of one or more enemy units, it can make a Normal move.","type":"Datasheet"}],"keywords":["Infantry","Imperium","Character","Epic Hero","UR-025"],"factionKeywords":["Agents of the Imperium"],"composition":["1 UR-025 – EPIC HERO"],"points":[{"models":"1 model","cost":"55"}],"canLead":[],"ledBy":[]},{"id":"000003823","name":"Veteran Bike Squad","role":"Other","loadout":"Every model is equipped with: bolt pistol; close combat weapon; twin boltgun.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Veteran Bike Squad","m":"12\"","t":"5","sv":"3+","invSv":"-","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Long Vigil ranged weapon","type":"Ranged","profiles":[{"name":"Long Vigil ranged weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Twin boltgun","type":"Ranged","profiles":[{"name":"Twin boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"twin-linked"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Long Vigil melee weapon","type":"Melee","profiles":[{"name":"Long Vigil melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":null}]},{"name":"Xenophase blade","type":"Melee","profiles":[{"name":"Xenophase blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Turbo-boost","description":"Each time this unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in this unit.","type":"Datasheet"},{"name":"Astartes Shield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"}],"keywords":["Imperium","Veteran Bike Squad","Deathwatch","Retinue","Ordo Xenos","Grenades","Mounted"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Veteran Biker Sergeant","2-5 Veteran Bikers"],"points":[{"models":"3 models","cost":"70"},{"models":"6 models","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000002683","name":"Vigilant Squad","role":"Battleline","loadout":"Every Proctor-Vigilant and Vigilant is equipped with: Arbites combat shotgun; Arbites shotpistol; close combat weapon. The Cyber-mastiff is equipped with: mechanical bite.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Vigilant Squad","m":"6\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Arbites combat shotgun","type":"Ranged","profiles":[{"name":"Arbites combat shotgun","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":"assault"}]},{"name":"Arbites grenade launcher – frag","type":"Ranged","profiles":[{"name":"Arbites grenade launcher – frag","range":"24","type":"Ranged","a":"D3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Arbites grenade launcher – krak","type":"Ranged","profiles":[{"name":"Arbites grenade launcher – krak","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"9","ap":"-2","d":"D3","desc":null}]},{"name":"Arbites shotpistol","type":"Ranged","profiles":[{"name":"Arbites shotpistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Executioner shotgun","type":"Ranged","profiles":[{"name":"Executioner shotgun","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"ignores cover, precision"}]},{"name":"Heavy stubber","type":"Ranged","profiles":[{"name":"Heavy stubber","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"rapid fire 3"}]},{"name":"Webber","type":"Ranged","profiles":[{"name":"Webber","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"2","ap":"0","d":"1","desc":"assault, devastating wounds, torrent"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Mechanical bite","type":"Melee","profiles":[{"name":"Mechanical bite","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Merciless Judgement","description":"Each time a model in this unit makes a ranged attack that targets a unit that is Below Half-strength, add 1 to the Wound roll.","type":"Datasheet"},{"name":"Nuncio Aquila (Aura)","description":"Once per battle, at the start of any Command phase, you can select one objective marker within 6\" of the bearer. All enemy units (excluding MONSTERS and VEHICLES) within range of that objective marker must take a Battle-shock test. Each objective marker can only be targeted by this ability once per turn. Designer’s Note: Place one Nuncio-aquila token next to the bearer, removing it once it uses this ability.","type":"Wargear"}],"keywords":["Imperium","Battleline","Infantry","Grenades","Adeptus Arbites","Vigilant Squad","Retinue"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Proctor-Vigilant","9 Vigilants","1 Cyber-mastiff"],"points":[{"models":"11 models","cost":"85"}],"canLead":[],"ledBy":["000002090","000002090","000002760","000002760","000000874","000000874","000000876","000000876","000003812","000001579","000000877","000001579","000004173","000004173","000000877"]},{"id":"000000870","name":"Vindicare Assassin","role":"Characters","loadout":"This model is equipped with: exitus pistol; exitus rifle; Vindicare combat knife.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Vindicare Assassin","m":"7\"","t":"4","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Exitus pistol","type":"Ranged","profiles":[{"name":"Exitus pistol","range":"12","type":"Ranged","a":"3","bsWs":"2","s":"6","ap":"-2","d":"3","desc":"devastating wounds, ignores cover, pistol, precision"}]},{"name":"Exitus rifle","type":"Ranged","profiles":[{"name":"Exitus rifle","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-3","d":"D3+3","desc":"devastating wounds, heavy, ignores cover, precision"}]},{"name":"Vindicare combat knife","type":"Melee","profiles":[{"name":"Vindicare combat knife","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Deadshot","description":"Each time this model makes a ranged attack, when selecting targets for that attack, you can ignore the Lone Operative ability.","type":"Datasheet"},{"name":"Shieldbreaker","description":"Once per battle, when selecting targets for this model’s exitus rifle, it can fire a shieldbreaker round. If it does, until the end of the phase, each time this model makes an attack with that weapon, add 1 to the Wound roll and any successful Wound roll scores a Critical Wound.","type":"Datasheet"},{"name":"SHADOW ASSIGNMENT","description":"This model cannot be selected to be your WARLORD. If your army faction is AGENTS OF THE IMPERIUM, then during the Declare Battle Formations step, you can replace this model with a different OFFICIO ASSASSINORUM model, provided the total points value of the new model does not exceed the points value of the model it replaced. Your army cannot include duplicates of the same model (i.e. after replacing a model with this rule, your army cannot have more than 1 VINDICARE ASSASSIN, it cannot have more than 1 CUlExUS ASSASSIN, it cannot have more than 1 EvERSOR ASSASSIN and it cannot have more than 1 CAllIDUS ASSASSIN).","type":"Special (правая колонка)"}],"keywords":["Officio Assassinorum","Infantry","Vindicare Assassin","Character","Epic Hero","Smoke","Imperium"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Vindicare Assassin – EPIC HERO"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"110"},{"models":"1 model (Assigned Agent)","cost":"125"}],"canLead":[],"ledBy":[]},{"id":"000002509","name":"Voidsmen-at-arms","role":"Other","loadout":"The Voidmaster is equipped with: artificer shotgun; laspistol; close combat weapon. One Voidsman is equipped with: laspistol; Voidsman rotor cannon; close combat weapon. Every other Voidsman is equipped with: lasgun; laspistol; close combat weapon. The Canid is equipped with: vicious bite.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Voidsmen-at-arms","m":"6\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Artificer shotgun","type":"Ranged","profiles":[{"name":"Artificer shotgun","range":"12","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"2","desc":"assault"}]},{"name":"Lasgun","type":"Ranged","profiles":[{"name":"Lasgun","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Laspistol","type":"Ranged","profiles":[{"name":"Laspistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Voidsman rotor cannon","type":"Ranged","profiles":[{"name":"Voidsman rotor cannon","range":"24","type":"Ranged","a":"6","bsWs":"5","s":"6","ap":"0","d":"1","desc":"heavy, sustained hits 1"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Vicious bite","type":"Melee","profiles":[{"name":"Vicious bite","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Masters of Close Confines","description":"Each time a model in this unit makes a ranged attack that targets the closest eligible target, that attack has the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"NAVY BODYGUARD","description":"If your Army Faction is not AGENTS OF THE IMPERIUM, then for each Voidfarers Character unit you include in your army, you can include one VOIDSMEN-AT-ARMS unit in your army that does not count towards the number of RETINUE units your army can include (see Assigned Agents)","type":"Special (правая колонка)"}],"keywords":["Voidsmen-at-Arms","Voidfarers","Imperium","Grenades","Retinue","Infantry"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Voidmaster","4 Voidsmen","1 Canid"],"points":[{"models":"6 models (AGENTS OF THE IMPERIUM Detachment)","cost":"50"},{"models":"6 models (Assigned Agent)","cost":"70"}],"canLead":[],"ledBy":["000002762","000002763","000002764","000002765"]},{"id":"000003814","name":"Watch Captain Artemis","role":"Characters","loadout":"This model is equipped with: Hellfire Extremis; master-crafted power weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Watch Captain Artemis","m":"6\"","t":"4","sv":"3+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Hellfire Extremis","type":"Ranged","profiles":[{"name":"Hellfire Extremis","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"anti-infantry 4+, devastating wounds, ignores cover, torrent"}]},{"name":"Master-crafted power weapon","type":"Melee","profiles":[{"name":"Master-crafted power weapon","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Tactical Instinct","description":"While this model is leading a unit, weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Unstoppable Champion","description":"The first time this model is destroyed, roll one D6 at the end of the phase. On a 2+, set this model back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with 1 wound remaining.","type":"Datasheet"}],"keywords":["Imperium","Deathwatch","Watch Captain Artemis","Character","Infantry","Ordo Xenos","Grenades","Epic Hero"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Watch Captain Artemis"],"points":[{"models":"1 model","cost":"65"}],"canLead":["000003816","000003821","000003822","000003824","000003825","000003826","000003827","000004174"],"ledBy":[]},{"id":"000003815","name":"Watch Master","role":"Characters","loadout":"This model is equipped with: vigil spear.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Watch Master","m":"6\"","t":"4","sv":"2+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Vigil spear","type":"Ranged","profiles":[{"name":"Vigil spear","range":"24","type":"Ranged","a":"2","bsWs":"2","s":"4","ap":"-1","d":"2","desc":null}]},{"name":"Vigil spear","type":"Melee","profiles":[{"name":"Vigil spear","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"6","ap":"-2","d":"D3","desc":"lance"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Assigned Agents","description":"If your Army Faction is AGENTS OF THE IMPERIUM, then in the Select Detachment Rules step, you can select one of the available Detachments from this book as normal. If your Army Faction is not AGENTS OF THE IMPERIUM, but every model in your army has the IMPERIUM keyword, you can include AGENTS OF THE IMPERIUM units in your army even if they do not have the Faction keyword you selected in the Select Army Faction step. In this case, the maximum number of AGENTS OF THE IMPERIUM units you can include in your army depends on the battle size, as shown below. BATTLE SIZERETINUE UNITSCHARACTER UNITSREQUISITIONED UNITSIncursion111Strike Force221Onslaught332 Note that you can include AGENTS OF THE IMPERIUM DEDICATED TRANSPORT units in such an army as normal, but each unit must start the battle with one or more units embarked within it, or it cannot be deployed for that battle and will count as having been destroyed during the first battle round.","type":"Faction"},{"name":"Strategic Knowledge","description":"While this model is leading a unit, that unit is eligible to shoot and declare a charge in a turn in which it Advanced or Fell Back.","type":"Datasheet"},{"name":"Rites of Battle","description":"Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP.","type":"Datasheet"}],"keywords":["Infantry","Character","Grenades","Imperium","Ordo Xenos","Deathwatch","Watch Master"],"factionKeywords":["Agents of the Imperium"],"composition":["1 Watch Master"],"points":[{"models":"1 model (AGENTS OF THE IMPERIUM Detachment)","cost":"95"},{"models":"1 model (Assigned Agent)","cost":"105"}],"canLead":["000003822","000003827","000003824","000003826","000003825","000003816","000003821","000004174"],"ledBy":[]}]}