{"id":"AS","name":"Adepta Sororitas","lastUpdate":"2026-02-17 13:32:38","detachments":[{"name":"Army of Faith","rules":[{"name":"Sacred Rites","description":"Each ADEPTA SORORITAS unit from your army can perform up to two Acts of Faith per phase, instead of just one."}],"enhancements":[{"name":"Litanies of Faith","description":"CANONESS or PALATINE model only. At the start of your Command phase, if the bearer is on the battlefield, take a Leadership test for the bearer. If that test is passed, you gain 1 Miracle dice.","cost":"10"},{"name":"Blade of Saint Ellynor","description":"ADEPTA SORORITAS model only. Improve the Strength and Armour Penetration characteristics of the bearer’s melee weapons by 1, and those weapons have the [PRECISION] ability. In addition, each time the bearer fights, if one or more enemy models are destroyed by those attacks, you gain 1 Miracle dice.","cost":"15"},{"name":"Divine Aspect","description":"ADEPTA SORORITAS model only. In your Movement phase, you can select one enemy unit within 12\" of the bearer; that unit must take a Battle-shock test. If that test is failed, you gain 1 Miracle dice.","cost":"5"},{"name":"Triptych of the Macharian Crusade","description":"ADEPTA SORORITAS model only. Each time the bearer uses an Act of Faith to substitute a saving throw, that saving throw is successful, irrespective of the value of the Miracle dice used.","cost":"20"}],"stratagems":[{"name":"DIVINE GUIDANCE","type":"Army of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: That ADEPTA SORORITAS unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack, improve the Armour Penetration characteristic of that attack by 1. If one or more enemy models are destroyed as the result of any of those attacks, you gain 1 Miracle dice."},{"name":"FAITH AND FURY","type":"Army of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [LANCE] ability. If one or more enemy models are destroyed as the result of your unit's attacks this phase, you gain 1 Miracle dice."},{"name":"SHIELD OF FAITH","type":"Army of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just after an ADEPTA SORORITAS unit from your army suffers a mortal wound. TARGET: That ADEPTA SORORITAS unit, or one friendly ADEPTA SORORITAS JUMP PACK unit within 3\" of it. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds. If you targeted an ADEPTA SORORITAS JUMP PACK unit from your army with this Stratagem, then until the end of the phase, while a friendly ADEPTA SORORITAS unit is unit is within 3\" of your unit, models in that unit have the Feel No Pain 5+ ability against mortal wounds."},{"name":"LIGHT OF THE EMPEROR","type":"Army of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Command phase. TARGET: One ADEPTA SORORITAS unit from your army. EFFECT: Until the end of the turn, your unit is blessed. While a unit is blessed, it can ignore any or all modifiers to the following: the profile characteristics of its models; the Weapon Skill or Ballistic Skill characteristics of weapons equipped by its models; any roll or test made for it (excluding modifiers to saving throws). If your unit has the JUMP PACK keyword, until the end of the turn, while a friendly ADEPTA SORORITAS unit is within 3\" of your unit, that friendly unit is also blessed."},{"name":"ANGELIC DESCENT","type":"Army of Faith – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: One ADEPTA SORORITAS JUMP PACK unit from your army. EFFECT: Remove your unit from the battlefield and place it into Strategic Reserves. RESTRICTIONS: You cannot select a unit that is within Engagement Range of one or more enemy units."},{"name":"BLINDING RADIANCE","type":"Army of Faith – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTA SORORITAS unit from your army that was selected as the target of one or more of the attacking unit's attacks, or one friendly ADEPTA SORORITAS JUMP PACK unit within 3\" of such a unit. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll. If you targeted an ADEPTA SORORITAS JUMP PACK unit from your army with this Stratagem, then until the end of the phase, while a friendly ADEPTA SORORITAS unit is unit is within 3\" of your unit, each time an attack targets that unit, subtract 1 from the Hit roll."}]},{"name":"Bringers of Flame","rules":[{"name":"Fervent Purgation","description":"Ranged weapons equipped by ADEPTA SORORITAS models from your army have the [ASSAULT] ability, and each time an attack made with such a weapon targets a unit within 6\", add 1 to the Strength characteristic of that attack."}],"enhancements":[{"name":"Righteous Rage","description":"ADEPTA SORORITAS model only. Each time the bearer is selected to fight, you can first discard up to 3 Miracle dice. For each Miracle dice just discarded, until the end of the phase, add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons.","cost":"15"},{"name":"Manual of Saint Griselda","description":"ADEPTA SORORITAS model only. At the start of your Command phase, you can discard up to 2 Miracle dice. Then, add 1 Miracle dice to your Miracle Dice pool showing a value equal to the sum of the two Miracle dice you just discarded (to a maximum of 6).","cost":"20"},{"name":"Fire and Fury","description":"ADEPTA SORORITAS model only. While the bearer is leading a unit, add 1 to the Attacks characteristic of Torrent weapons equipped by models in that unit, and all other ranged weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.","cost":"30"},{"name":"Iron Surplice of Saint Istalela","description":"CANONESS or PALATINE model only. The bearer has a Save characteristic of 2+ and the Feel No Pain 5+ ability.","cost":"10"}],"stratagems":[{"name":"RIGHTEOUS BLOWS","type":"Bringers of Flame – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [LETHAL HITS] ability. If one or more enemy models are destroyed as the result of attacks made by those weapons this phase, select one of those destroyed models; that destroyed model’s unit must take a Battle-shock test."},{"name":"SHIELD OF AVERSION","type":"Bringers of Flame – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTA SORORITAS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1."},{"name":"CLEANSING FLAMES","type":"Bringers of Flame – Battle Tactic Stratagem","cost":"2","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, Torrent weapons equipped by models in your unit have the [DEVASTATING WOUNDS] ability"},{"name":"BLAZING IRE","type":"Bringers of Flame – Battle Tactic Stratagem","cost":"2","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has shot. TARGET: One ADEPTA SORORITAS TRANSPORT unit from your army that was selected as the target of one or more of the attacking unit's attacks. EFFECT: One unit embarked within your TRANSPORT can disembark as if it were your Movement phase, and can then shoot as if it were your Shooting phase, but must target only that enemy unit when doing so, and can only do so if that enemy unit is an eligible target."},{"name":"RITES OF FIRE","type":"Bringers of Flame – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One ADEPTA SORORITAS unit from your army that disembarked from a TRANSPORT this turn and has not been selected to shoot this phase. EFFECT: Until the end of the phase, each time a model in your unit makes a ranged attack that targets an enemy unit within 6\" that is also within range of an objective marker, add 1 to the Wound roll. If one or more enemy models are destroyed as the result of those attacks, select one of those destroyed models; that destroyed model’s unit must take a Battle-shock test."},{"name":"CARRY FORTH THE FAITHFUL","type":"Bringers of Flame – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just before an ADEPTA SORORITAS TRANSPORT model from your army Advances. TARGET: That ADEPTA SORORITAS TRANSPORT model. EFFECT: Until the end of the turn, you can re-roll Advance rolls made for your TRANSPORT, and units can disembark from your TRANSPORT even though it Advanced. Units that do so count as having made a Normal move, and cannot declare a charge this turn"}]},{"name":"Champions of Faith","rules":[{"name":"Righteous Purpose","description":"In your Command phase, you can select up to 3 Adepta Sororitas units from your army (including units that are embarked within Transports), until the start of your next Command phase, those units are Righteous. While a unit is Righteous: Add 1\" to the Move characteristic of models in that unit.Improve the Leadership characteristic of models in that unit by 1.Improve the Weapon Skill and Ballistic Skill characteristics of weapons equipped by Battle Sisters Squad, Celestian Sacresants and Paragon Warsuits models in that unit by 1. Keywords While a CELESTIAN SACRESANTS unit from your army is not Battle-shocked, add 1 to the Objective Control characteristic of Celestian Sacresants models in that unit."}],"enhancements":[{"name":"Triptych of Judgement","description":"ADEPTA SORORITAS model only. Each time a model in the bearer’s unit makes an attack, you can ignore any or all modifiers to that attack’s Ballistic Skill or Weapon Skill characteristics and/or any or all modifiers to the Hit roll.","cost":"15"},{"name":"Mark of Devotion","description":"ADEPTA SORORITAS model only. Add 1 to the Attacks characteristic of the bearer’s melee weapons. While the bearer’s unit is Righteous, add 2 to the Attacks characteristic and add 1 to the Damage characteristic of the bearer’s melee weapons instead.","cost":"30"},{"name":"Eyes of the Oracle","description":"ADEPTA SORORITAS model only. The bearer’s weapons have the [PRECISION] ability. Each time the bearer’s unit destroys an enemy CHARACTER model, you gain 1CP.","cost":"10"},{"name":"Sanctified Amulet","description":"ADEPTA SORORITAS model only. Enemy units that are set up on the battlefield from Reserves cannot be set up within 12\" of the bearer.","cost":"25"}],"stratagems":[{"name":"TO THE HEART OF HERESY","type":"Champions of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the turn, improve the Strength characteristic of melee weapons equipped by models in your unit by 1. If your unit is Righteous, until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1 as well."},{"name":"PATH OF THE RIGHTEOUS","type":"Champions of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the turn, each time a model in your unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\". When doing so, if your unit is Righteous, it does not need to end that move closer to the closest enemy model, provided it ends that move as close as possible to the closest enemy unit."},{"name":"BASTION OF FAITH","type":"Champions of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Celestian Sacresants unit that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll. In addition, if your unit is Righteous, you can select one other CELESTIAN SACRESANTS unit from your army that is not Battle-shocked and is within 6\" of your unit. Until the end of the phase, each time an attack targets that CELESTIAN SACRESANTS unit, subtract 1 from the Hit roll as well."},{"name":"SHIELD OF DENIAL","type":"Champions of Faith – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just after a mortal wound is allocated to an ADEPTA SORORITAS unit from your army. TARGET: That ADEPTA SORORITAS unit. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 6+ ability against mortal wounds. If your unit is Righteous, until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds instead."},{"name":"INDEFATIGABLE DEDICATION","type":"Champions of Faith – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after an ADEPTA SORORITAS unit from your army Falls Back. TARGET: That ADEPTA SORORITAS unit. EFFECT: Until the end of the turn, your unit is eligible to shoot in a turn in which it Fell Back. If your unit is Righteous, until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back instead."},{"name":"SUFFER NOT THE UNFAITHFUL","type":"Champions of Faith – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that is Righteous and that has not been selected to shoot or fight this phase. EFFECT: Select either the [LETHAL HITS] or [SUSTAINED HITS 1] ability. Until the end of the phase, weapons equipped by models in your unit have the selected ability."}]},{"name":"Hallowed Martyrs","rules":[{"name":"The Blood of Martyrs","description":"Each time an ADEPTA SORORITAS model from your army makes an attack, add 1 to the Hit roll if that model’s unit is below its Starting Strength, and add 1 to the Wound roll as well if that model’s unit is Below Half-strength."}],"enhancements":[{"name":"Saintly Example","description":"ADEPTA SORORITAS model only. When the bearer is destroyed, you gain an additional D3 Miracle dice.","cost":"10"},{"name":"Through Suffering, Strength","description":"ADEPTA SORORITAS model only. Add 1 to the Attacks, Strength and Damage characteristics of the bearer’s melee weapons. If the bearer has lost one or more wounds, add 2 to the Attacks, Strength and Damage characteristics of the bearer’s melee weapons instead.","cost":"25"},{"name":"Chaplet of Sacrifice","description":"ADEPTA SORORITAS model only. At the end of your Command phase, if the bearer is on the battlefield, you can re-roll 1 Miracle dice from your Miracle dice pool and return it to your Miracle dice pool showing the new result you rolled. When doing so, if the bearer's unit is below its Starting Strength, you can re-roll up to 3 Miracle dice in this way instead.","cost":"25"},{"name":"Mantle of Ophelia","description":"Canoness or Palatine model only. Each time an attack is allocated to the bearer, change the Damage characteristic of that attack to 1.","cost":"20"}],"stratagems":[{"name":"RIGHTEOUS VENGEANCE","type":"Hallowed Martyrs – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes a melee attack, you can re-roll the Hit roll and, if your unit is Below Half-strength, you can re-roll the Wound roll as well."},{"name":"DIVINE INTERVENTION","type":"Hallowed Martyrs – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One Adepta Sororitas Character unit from your army that was just destroyed. You can use this Stratagem on that unit even though it was just destroyed. EFFECT: You can discard 1-3 Miracle dice. At the end of the phase, set the last destroyed model from your unit back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy models. Roll one D3, adding 1 to the result for each Miracle dice you discarded. That model is set back up with that number of wounds remaining (up to its starting number of wounds). RESTRICTIONS: You cannot select Saint Celestine as the target of this Stratagem. You cannot select the same CHARACTER as the target of this Stratagem more than once per battle."},{"name":"SANCTIFIED IMMOLATION","type":"Hallowed Martyrs – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One ADEPTA SORORITAS VEHICLE model from your army with the Deadly Demise ability that was just destroyed. You can use this Stratagem on that model even though It was just destroyed. EFFECT: Do not roll one D6 to determine whether mortal wounds are inflicted by your model's Deadly Demise ability. Instead, mortal wounds are automatically inflicted."},{"name":"SUFFERING AND SACRIFICE","type":"Hallowed Martyrs – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Start of the Fight phase. TARGET: One Adepta Sororitas Infantry or Adepta Sororitas Walker unit from your army. EFFECT: Until the end of the phase, each time an enemy model within Engagement Range of your unit selects its targets, it must select your unit as the target of its attacks."},{"name":"SPIRIT OF THE MARTYR","type":"Hallowed Martyrs – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTA SORORITAS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, do not remove it from play. The destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play."},{"name":"PRAISE THE FALLEN","type":"Hallowed Martyrs – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has shot. TARGET: One ADEPTA SORORITAS unit from your army that had one or more of its models destroyed as a result of the attacking unit’s attacks. EFFECT: Your unit can shoot as if it were your Shooting phase, but it must target only that enemy unit when doing so, and can only do so if that enemy unit is an eligible target."}]},{"name":"Penitent Host","rules":[{"name":"Desperate for Redemption","description":"At the start of the battle round, you can select one of the following Vows of Atonement to be active for your army until the start of the next battle round. You can only select each Vow of Atonement once per battle.The Path of the PenitentWith psalms on their lips, the faithful hurl themselves forward.Add 3\" to the Move characteristic of PENITENT models from your army.Absolution in BattleThe penitents smite the Emperor's foes with unmatched zeal.Each time a unit from your army is selected to fight, if that unit made a Charge move this turn, until the end of the phase, add 1 to the Attacks and Strength characteristics of melee weapons equipped by PENITENT models in that unit.Death Before DisgraceEven the most grievous wound cannot stop a penitent warrior in their quest to earn redemption in the eyes of the Emperor.Each time a PENITENT model from your army is destroyed by a melee attack, if that model has not fought this phase, roll one D6. On a 2+, do not remove it from play; the destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play."}],"enhancements":[{"name":"Psalm of Righteous Judgement","description":"ADEPTA SORORITAS model only. While the bearer is on the battlefield, each time an enemy unit is destroyed by a penitent unit from you army, you can discard 1 Miracle dice then gain 1 Miracle dice showing a value of 6.","cost":"30"},{"name":"Verse of Holy Piety","description":"PENITENT model only. Once per battle, at the start of the battle round, select one Vow of Atonement. Until the start of the next battle round, that Vow of Atonement is active for the bearer’s unit in addition to any that is active for your army, even if you have already selected that Vow of Atonement this battle.","cost":"15"},{"name":"Refrain of Enduring Faith","description":"PENITENT model only. While the bearer is leading a unit, models in that unit have a 5+ invulnerable save.","cost":"25"},{"name":"Catechism of Divine Penitence","description":"CANONESS, PALATINE or MINISTORUM PRIEST model only. The bearer gains the PENITENT keyword and, during the Declare Battle Formations step, can be attached to a REPENTIA SOUAD unit.","cost":"20"}],"stratagems":[{"name":"LASH OF GUILT","type":"Penitent Host – Battle Tactic Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just before a PENITENT unit from your army Advances. TARGET: That PENITENT unit. EFFECT: Until the end of the turn, your unit is eligible to declare a charge in a turn in which it Advanced. If your unit has the PENITENT ENGINES keyword, do not make an Advance roll for it; instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit."},{"name":"PASSION OF THE PENITENT","type":"Penitent Host – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One PENITENT unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, each time a PENITENT model in your unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit."},{"name":"PURITY OF SUFFERING","type":"Penitent Host – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One PENITENT unit from your army that was selected as the target of one or more of the attacking unit's attacks. EFFECT: Until the end of the phase, PENITENT models in your unit have the Feel No Pain 4+ ability."},{"name":"FINAL REDEMPTION","type":"Penitent Host – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One PENITENT unit from your army that was just destroyed while it was within range of an objective marker you controlled. You can use this Stratagem on that unit even though it was just destroyed. EFFECT: That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn."},{"name":"BOUNDLESS ZEAL","type":"Penitent Host – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after an ADEPTA SORORITAS unit from your army Falls Back. TARGET: That ADEPTA SORORITAS unit. EFFECT: Until the end of the turn, your unit is eligible to shoot or declare a charge in a turn in which it Fell Back. If your unit has the PENITENT keyword, it is eligible to shoot and declare a charge in a turn in which it Fell Back instead."},{"name":"DEVOUT FANATICISM","type":"Penitent Host – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has shot. TARGET: One PENITENT unit from your army that was selected as the target as one or more of the attacking unit’s attacks. EFFECT: Roll one D6: your unit can be moved a distance in inches up to the result, but it must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, models in your unit can be moved within Engagement Range of enemy units."}]},{"name":"Penitents and Pilgrims","rules":[{"name":"Bloody Redemption","description":"The first time each turn that you gain 1 Miracle dice as the result of an ARCO-FLAGELLANTS or REPENTiA SqUAD unit from your army being destroyed, do not roll a D6; that Miracle dice has a value of 6 instead."}],"enhancements":[{"name":"Fervent Ferocity","description":"The bearer has the Feel No Pain 4+ ability.","cost":"0"},{"name":"Sanctification Rituals","description":"The bearer can perform the Secure Site Tactical Manoeuvre as if it had the BATTLELINE keyword.","cost":"0"}],"stratagems":[{"name":"SLICK WITH GORE","type":"Penitents and Pilgrims – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an ADEPTA SORORITAS unit from your army destroys an enemy unit. TARGET: That ADEPTA SORORITAS unit. EFFECT: Until the end of the battle, your unit is slick with gore. In the Battle-shock step of your opponent's Command phase, if an enemy unit that is below its Starting Strength is within 6\" of and visible to a unit from your army that is slick with gore, that enemy unit must take a Battle-shock test. If that enemy unit is also Below Half-strength, subtract 1 from that test. This cannot cause a unit to take two Battle-shock tests in the same phase. RESTRICTIONS: You cannot use this Stratagem while a unit from your army that is slick with gore is on the battlefield."},{"name":"CONTEMPT FOR DEATH","type":"Penitents and Pilgrims – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTA SORORITAS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, if the Strength characteristic of that attack is greater than the Toughness characteristic of your unit, subtract 1 from the Wound roll."},{"name":"SAVAGE FRENZY","type":"Penitents and Pilgrims – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit is selected to Fall Back. TARGET: One ARcO-fLAGELLANTS or REPENTIA SqUAD unit from your army within Engagement Range of that enemy unit. EFFECT: Until the end of the phase, when that enemy unit Falls Back, models in it must take Desperate Escape tests as if their unit was Battle-shocked. When doing so, if that enemy unit is also Battle-shocked by other means, subtract 1 from each of those Desperate Escape tests."},{"name":"FEVERED ZEALOTS","type":"Penitents and Pilgrims – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after an ADEPTA SORORITAS unit from your army opens a Hatchway. TARGET: That ADEPTA SORORITAS unit. EFFECT: Until the end of the turn, your unit has the Fights First ability."}]},{"name":"Pious Protectors","rules":[{"name":"The Emperor Protects","description":"Each time an attack targets an ADEPTA SORORITAS unit from your army (excluding ARCO-FLAGELLANTS and REPENTiA SqUAD units), if that unit is within range of an objective marker, models in that unit have a 4+ invulnerable save against that attack. If that unit also performed the Secure Site Tactical Manoeuvre in your previous Shooting phase, models in it have a 3+ invulnerable save against that attack instead."}],"enhancements":[{"name":"Martial Discipline","description":"At the start of your Shooting phase, you can select one friendly ADEPTA SORORITAS unit within 6\" of the bearer. Until the end of the phase, that unit is eligible to shoot in a turn in which it Advanced or Fell Back.","cost":"0"},{"name":"Limitless Resolve","description":"While the bearer is on the battlefield, friendly Battle-shocked ADEPTA SORORITAS models (excluding ARCO-FLAGELLANTS and REPENTiA SqUAD models) have an Objective Control characteristic of 1.","cost":"0"}],"stratagems":[{"name":"PRAYER OF PRECISION","type":"Pious Protectors – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One ADEPTA SORORITAS unit from your army that has not been selected to shoot this phase. EFFECT: You can discard 1 Miracle dice. Until the end of the phase, each time a model in your unit makes an attack, re-roll a Hit roll of 1. If you discarded a Miracle dice, you can re-roll the Hit roll instead."},{"name":"FINAL TESTAMENT","type":"Pious Protectors – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One ADEPTA SORORITAS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: You can discard 1 Miracle dice. Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 to the result if you discarded a Miracle dice: on a 4+, do not remove the destroyed model from play; it can fight after the attacking unit has finished making its attacks, and is then removed from play."},{"name":"RADIANT ILLUMINATION","type":"Pious Protectors – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: Your opponent’s Charge phase, just after an enemy unit has declared a charge. TARGET: One ADEPTA SORORITAS unit from your army (excluding ARcO-fLAGELLANTS and REPENTIA SqUAD units) that was selected as a target of that charge. EFFECT: You can discard 1 Miracle dice. Until the end of the phase, subtract 1 from Charge rolls made for that enemy unit. If you discarded a Miracle dice, subtract 2 from Charge rolls made forthat enemy unit instead."},{"name":"REPEL BOARDERS","type":"Pious Protectors – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement or Charge phase","description":"WHEN: Your opponent’s Movement or Charge phase. TARGET: One ADEPTA SORORITAS unit from your army that has not fired Overwatch this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack while firing Overwatch, an unmodified Hit roll of 5+ is required to score a hit, instead of an unmodified 6. In addition, until the end of the phase, each time you roll to determine the number of attacks made with a weapon equipped by a model in your unit, you can re-roll the result."}]}],"datasheets":[{"id":"000002480","name":"Aestred Thurga And Agathae Dolan","role":"Characters","loadout":"Aestred Thurga is equipped with: bolt pistol; Blade of Vigil. Agathae Dolan is equipped with: bolt pistol; scribe’s staff.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"AESTRED THURGA","m":"6\"","t":"3","sv":"2+","invSv":"4","w":"4","ld":"6+","oc":"1"},{"name":"AGATHAE DOLAN","m":"6\"","t":"3","sv":"6+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Blade of Vigil","type":"Melee","profiles":[{"name":"Blade of Vigil","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Scribe’s staff","type":"Melee","profiles":[{"name":"Scribe’s staff","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Auto-Tapestry of the Emperor’s Judgement","description":"While this unit is leading a unit and contains an Aestred Thurga model, weapons equipped by models in that unit have the [DEVASTATING WOUNDS] ability","type":"Datasheet"},{"name":"Recount the Deeds of the Saints","description":"While this unit is leading a unit and contains an Agathae Dolan model, each time that unit destroys an enemy unit, you gain 1 Miracle dice. When that Agathae Dolan model is destroyed, you gain D3 Miracle dice.","type":"Datasheet"}],"keywords":["Aestred Thurga","Agathae Dolan","Grenades","Infantry","Epic Hero","Character","Imperium"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Aestred Thurga – EPIC HERO","1 Agathae Dolan – EPIC HERO"],"points":[{"models":"2 models","cost":"70"}],"canLead":["000000908","000000894","000002481","000000903","000004189","000000909","000002507"],"ledBy":[]},{"id":"000000896","name":"Arco-flagellants","role":"Other","loadout":"Every model is equipped with: arco-flails.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Arco-flagellants","m":"7\"","t":"3","sv":"7+","invSv":"6","w":"2","ld":"8+","oc":"1"}],"weapons":[{"name":"Arco-flails","type":"Melee","profiles":[{"name":"Arco-flails","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"5","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Extremis Trigger Word","description":"Each time this unit is selected to fight, you can choose to invoke its extremis trigger word. If you do, then until the end of the phase, arco-flails equipped by models in this unit have an Attacks characteristic of 6 and the [HAZARDOUS] ability.","type":"Datasheet"}],"keywords":["Arco-flagellants","Penitent","Imperium","Infantry"],"factionKeywords":["Adepta Sororitas"],"composition":["3-10 Arco-flagellants"],"points":[{"models":"3 models","cost":"45"},{"models":"10 models","cost":"140"}],"canLead":[],"ledBy":["000001553"]},{"id":"000002068","name":"Battle Sanctum","role":"Fortifications","loadout":"This model is equipped with: nothing.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Battle Sanctum","m":"-","t":"11","sv":"3+","invSv":"-","w":"20","ld":"7+","oc":"0"}],"weapons":[{"name":"","type":"","profiles":[{"name":"","range":"","type":"","a":"0","bsWs":"-","s":"-","ap":"0","d":"-","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Consecrated Ground","description":"When this FORTIFICATION is set up, all parts of it must be set up within 1\" of another part. Friendly Adepta Sororitas Infantry models can be set up or end any type of move on top of the floor sections of this FORTIFICATION. While an ADEPTA SORORITAS unit from your army is within 1\" of this FORTIFICATION, that unit can perform one additional Act of Faith per phase.","type":"Datasheet"},{"name":"Holy Cover","description":"Each time a ranged attack is allocated to a model, if that model is not fully visible to every model in the attacking unit because of this Fortification, that model has the Benefit of Cover against that attack.","type":"Datasheet"},{"name":"FORTIFICATION","description":"While an enemy unit is only within Engagement Range of one or more Fortifications from your army: That unit can still be selected as the target of ranged attacks, but each time such an attack is made, unless it is made with a Pistol, subtract 1 from the Hit roll. Models in that unit do not need to take Desperate Escape tests due to Falling Back while Battle- shocked, except for those that will move over enemy models when doing so.","type":"Primarch"}],"keywords":["Imperium","Battle Sanctum","Towering","Fortification"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Battle Sanctum"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000903","name":"Battle Sisters Squad","role":"Battleline","loadout":"Every model is equipped with: bolt pistol; boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Battle Sisters Squad","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Artificer-crafted storm bolter","type":"Ranged","profiles":[{"name":"Artificer-crafted storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"2","desc":"rapid fire 2"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"}]},{"name":"Condemnor boltgun","type":"Ranged","profiles":[{"name":"Condemnor boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ANTI-PSYKER 2+, DEVASTATING WOUNDS, PRECISION, RAPID FIRE 1"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"heavy, sustained hits 1"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"MELTA 2, PISTOL"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"IGNORES COVER, PISTOL, TORRENT"}]},{"name":"Ministorum heavy flamer","type":"Ranged","profiles":[{"name":"Ministorum heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"PISTOL"},{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS, PISTOL"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Cherub","description":"Once per battle, after this unit has performed an Act of Faith, you gain 1 Miracle dice. Designer’s Note: Place a Cherub token next to the unit, removing it once this ability has been used.","type":"Datasheet"},{"name":"Defenders of the Faith","description":"At the end of your Command phase, if this unit is within range of an objective marker you control, that objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.","type":"Datasheet"},{"name":"Simulacrum Imperialis","description":"At the end of your Command phase, for each objective marker you control that has one or more units from your army with this ability within range of it, roll one D6: on a 4+, you gain 1 Miracle dice showing a value equal to that result.","type":"Wargear"}],"keywords":["Infantry","Grenades","Battleline","Imperium","Battle Sisters Squad"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Sister Superior","9 Battle Sisters"],"points":[{"models":"10 models","cost":"105"}],"canLead":[],"ledBy":["000001553","000002063","000002064","000002480","000002482","000002472","000002760","000000874","000000876","000000877","000000899","000000900","000000901","000000902","000001579","000004173","000002090"]},{"id":"000000899","name":"Canoness","role":"Characters","loadout":"This model is equipped with: bolt pistol; hallowed chainsword.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Canoness","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Brazier of holy fire","type":"Ranged","profiles":[{"name":"Brazier of holy fire","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"2","desc":"ignores cover, one shot, torrent"}]},{"name":"Condemnor boltgun","type":"Ranged","profiles":[{"name":"Condemnor boltgun","range":"24","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"0","d":"1","desc":"anti-psyker 2+, devastating wounds, precision, rapid fire 1"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-4","d":"D3","desc":"melta 2, pistol"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Blessed blade","type":"Melee","profiles":[{"name":"Blessed blade","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"6","ap":"-2","d":"2","desc":"lethal hits"}]},{"name":"Hallowed Chainsword","type":"Melee","profiles":[{"name":"Hallowed Chainsword","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"3","ap":"-1","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Sacred Command","description":"Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"The Emperor’s Grace","description":"Once per battle, at the start of any phase, this model can use this ability. If it does, until the end of the phase, this model has a 2+ invulnerable save.","type":"Datasheet"},{"name":"Null Rod","description":"Models in the bearer’s unit have the Feel No Pain 4+ ability against mortal wounds and Psychic Attacks.","type":"Wargear"},{"name":"Rod of Office","description":"Each time a model in the bearer’s unit makes an attack, re-roll a Hit roll of 1.","type":"Wargear"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Imperium","Canoness","Grenades","Infantry","Character"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Canoness"],"points":[{"models":"1 model","cost":"60"}],"canLead":["000000908","000000894","000002481","000000903","000004189","000000909","000002507"],"ledBy":[]},{"id":"000003714","name":"Canoness with Jump Pack","role":"Characters","loadout":"This model is equipped with: blessed halberd.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Canoness","m":"12\"","t":"3","sv":"3+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Blessed halberd","type":"Melee","profiles":[{"name":"Blessed halberd","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Holy Eviscerator","type":"Melee","profiles":[{"name":"Holy Eviscerator","range":"Melee","type":"Melee","a":"3","bsWs":"2","s":"6","ap":"-2","d":"2","desc":"sustained hits 1"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Sacred Command","description":"Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Divine Deliverance","description":"Once per battle, at the start of the Fight phase, this model can use this ability. If it does, until the end of the phase, add 3 to the Attacks characteristic of melee weapons equipped by this model and those weapons have the [DEVASTATING WOUNDS] ability.","type":"Datasheet"}],"keywords":["Canoness","Infantry","Character","Jump Pack","Fly","Grenades","Imperium"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Canoness With Jump Pack"],"points":[{"models":"1 model","cost":"75"}],"canLead":["000002066","000000904"],"ledBy":[]},{"id":"000002484","name":"Castigator","role":"Other","loadout":"This model is equipped with: Castigator autocannons; 3 heavy bolters; armoured tracks.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Castigator","m":"10\"","t":"10","sv":"3+","invSv":"6","w":"11","ld":"7+","oc":"3"}],"weapons":[{"name":"Castigator autocannons","type":"Ranged","profiles":[{"name":"Castigator autocannons","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"rapid fire 4, twin-linked"}]},{"name":"Castigator battle cannon","type":"Ranged","profiles":[{"name":"Castigator battle cannon","range":"48","type":"Ranged","a":"D6+3","bsWs":"3","s":"10","ap":"-1","d":"3","desc":"blast, ignores cover"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Rites of Castigation","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the turn, each time a friendly ADEPTA SORORITAS unit makes a ranged attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1. The same enemy unit can only be affected by this ability once per turn.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Castigator","Imperium","Smoke","Vehicle"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Castigator"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000004189","name":"Celestian Insidiants","role":"Other","loadout":"Each model is equipped with: condemnor bolt pistol; null mace.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Celestian Insidiants","m":"6\"","t":"3","sv":"3+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Condemnor bolt pistol","type":"Ranged","profiles":[{"name":"Condemnor bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"anti-psyker 4+, devastating wounds, pistol"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"melta 2, pistol"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Blessed sword","type":"Melee","profiles":[{"name":"Blessed sword","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"2","desc":"lethal hits"}]},{"name":"Null mace","type":"Melee","profiles":[{"name":"Null mace","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"anti-psyker 4+, devastating wounds"}]},{"name":"Virge of admonition","type":"Melee","profiles":[{"name":"Virge of admonition","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-2","d":"3","desc":"anti-psyker 4+, devastating wounds"}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Rituale Nullificatus","description":"Models in this unit have the Feel No Pain 4+ ability against Psychic Attacks and mortal wounds.","type":"Datasheet"},{"name":"Virtue of Intolerance","description":"At the start of the battle, select one unit from your opponent’s army to be this unit’s quarry. Each time a model in this unit makes an attack that targets its quarry, that attack has the [PRECISION] ability and you can re-roll the Hit roll. This ability can be used even if this unit is embarked within a Transport.","type":"Datasheet"},{"name":"Simulacrum Imperialis","description":"At the end of your Command phase, for each objective marker you control that has one or more units from your army with this ability within range of it, roll one D6: on a 4+, you gain 1 Miracle dice showing a value equal to that result.","type":"Wargear"},{"name":"Denuncia Oratory","description":"Each time the bearer’s unit’s quarry is destroyed, you can select a new unit from your opponent’s army to be its quarry.","type":"Wargear"},{"name":"ATTACHED UNIT","description":"If a Character unit from your army can be attached to a Dominion Squad unit, it can be attached to this unit instead.","type":"Fortification (левая колонка)"}],"keywords":["Infantry","Imperium","Grenades","Celestian Insidiants"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Celestian Insidiant Superior","9 Celestian Insidiants"],"points":[{"models":"10 models","cost":"120"}],"canLead":[],"ledBy":["000001553","000002064","000002480","000002482","000002472","000000899","000000900","000000901","000000902"]},{"id":"000003811","name":"Celestian Sacresant Aveline","role":"Characters","loadout":"This model is equipped with: Ministorum hand flamer; The Thorn of the White Rose.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Celestian Sacresant Aveline","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"The Thorn of the White Rose","type":"Melee","profiles":[{"name":"The Thorn of the White Rose","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Instrument of the Emperor’s Wrath","description":"Once per battle, at the start of the Fight phase, this model can use this ability. If it does, until the end of the phase, add 3 to the Attacks characteristic of melee weapons equipped by this model and those weapons have the [DEVASTATING WOUNDS] ability.","type":"Datasheet"},{"name":"Daemonbreaker","description":"Each time this model makes an attack that targets a DAEMON unit, you can re-roll the Hit roll and you can re-roll the Wound roll.","type":"Datasheet"}],"keywords":["Celestian Sacresant Aveline","Infantry","Character","Imperium","Grenades","Epic Hero"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Celestian Sacresant Aveline – EPIC HERO"],"points":[{"models":"1 model","cost":"45"}],"canLead":[],"ledBy":[]},{"id":"000002481","name":"Celestian Sacresants","role":"Other","loadout":"Every model is equipped with: bolt pistol; hallowed mace.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Celestian Sacresants","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"melta 2, pistol"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Anointed halberd","type":"Melee","profiles":[{"name":"Anointed halberd","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"sustained hits 1"}]},{"name":"Hallowed mace","type":"Melee","profiles":[{"name":"Hallowed mace","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-1","d":"2","desc":"lethal hits"}]},{"name":"Spear of the faithful","type":"Melee","profiles":[{"name":"Spear of the faithful","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Sworn Protectors","description":"While an ADEPTA SORORITAS CHARACTER is leading this unit, each time an attack targets this unit, subtract 1 from the Wound roll.","type":"Datasheet"}],"keywords":["Infantry","Grenades","Imperium","Celestian Sacresants"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Sacresant Superior","4-9 Celestian Sacresants"],"points":[{"models":"5 models","cost":"70"},{"models":"10 models","cost":"140"}],"canLead":[],"ledBy":["000002064","000002480","000002482","000002472","000000899","000000900","000000901","000000902"]},{"id":"000000894","name":"Crusaders","role":"Other","loadout":"Every model is equipped with: power weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Crusaders","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Spiritual Fortitude","description":"Models in this unit have the Feel No Pain 4+ ability against Psychic Attacks and mortal wounds.","type":"Datasheet"},{"name":"ATTACHED UNIT","description":"If a Character unit from your army with the Leader ability can be attached to a Battle Sisters Squad, it can be attached to this unit instead.","type":"Fortification (левая колонка)"}],"keywords":["Infantry","Imperium","Crusaders"],"factionKeywords":["Adepta Sororitas"],"composition":["2-4 Crusaders"],"points":[{"models":"2 models","cost":"40"},{"models":"4 models","cost":"80"}],"canLead":[],"ledBy":["000001553","000002063","000002064","000002480","000002472","000000900","000002482","000000899","000000901","000000902"]},{"id":"000002771","name":"Daemonifuge","role":"Characters","loadout":"Ephrael Stern is equipped with: bolt pistol; Sanctity. Kyganil of the Bloody Tears is equipped with: the Outcast’s Weapons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"EPHRAEL STERN","m":"8\"","t":"3","sv":"3+","invSv":"4","w":"5","ld":"7+","oc":"1"},{"name":"KYGANIL OF THE BLOODY TEARS","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Sanctity","type":"Melee","profiles":[{"name":"Sanctity","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"6","ap":"-2","d":"2","desc":"anti-chaos 2+, precision"}]},{"name":"The Outcast’s Weapons","type":"Melee","profiles":[{"name":"The Outcast’s Weapons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"precision"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Holy Judgement","description":"At the start of your Shooting phase, select one enemy unit within 12\" of and visible to this unit's Ephrael Stern model. That unit must take a Battle-shock test, subtracting 2 from the result if it is a CHAOS unit. If the test is failed, that enemy unit suffers 3 mortal wounds.","type":"Datasheet"},{"name":"Mysterious Saviours","description":"You can target this unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase.","type":"Datasheet"}],"keywords":["Imperium","Daemonifuge","Infantry","Grenades","Character","Epic Hero"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Ephrael Stern – EPIC HERO","1 Kyganil of the Bloody Tears – EPIC HERO"],"points":[{"models":"2 models","cost":"85"}],"canLead":[],"ledBy":[]},{"id":"000000895","name":"Death Cult Assassins","role":"Other","loadout":"Every model is equipped with: Death Cult power blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Death Cult Assassins","m":"7\"","t":"3","sv":"5+","invSv":"5","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Death Cult power blades","type":"Melee","profiles":[{"name":"Death Cult power blades","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"precision"}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Death Cult","description":"Each time a model in this unit makes an attack that targets a CHARACTER unit, re-roll a Wound roll.","type":"Datasheet"}],"keywords":["Imperium","Infantry","Death Cult Assassins"],"factionKeywords":["Adepta Sororitas"],"composition":["2-4 Death Cult Assassins"],"points":[{"models":"2 models","cost":"55"},{"models":"4 models","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000000902","name":"Dialogus","role":"Characters","loadout":"This model is equipped with: bolt pistol; Dialogus staff.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"This model can be attached to a Battle Sisters Squad, even if one Canoness, Palatine, Junith Eruita or AESTRED THURGA model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":false,"models":[{"name":"Dialogus","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Dialogus staff","type":"Melee","profiles":[{"name":"Dialogus staff","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Laud Hailer","description":"Once per battle, at the start of any phase, you can select one friendly ADEPTA SORORITAS unit that is Battle-shocked and within 12\" of this model. That unit is no longer Battle-shocked.","type":"Datasheet"},{"name":"Stirring Rhetoric","description":"While this model is leading a unit, each time this model’s unit performs an Act of Faith, the value of one of the Miracle dice used in that Act of Faith is first changed to a 6.","type":"Datasheet"}],"keywords":["Imperium","Infantry","Dialogus","Character"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Dialogus"],"points":[{"models":"1 model","cost":"40"}],"canLead":["000002507","000000908","000000894","000002481","000000903","000004189","000000909"],"ledBy":[]},{"id":"000002482","name":"Dogmata","role":"Characters","loadout":"This model is equipped with: bolt pistol; mace of the righteous.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"This model can be attached to a Battle Sisters Squad, even if one Canoness, Palatine, Junith Eruita or AESTRED THURGA model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":false,"models":[{"name":"Dogmata","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Mace of the righteous","type":"Melee","profiles":[{"name":"Mace of the righteous","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Executioner of Heretics (Aura)","description":"While an enemy unit is within 6\" of this model, worsen the Leadership characteristic of models in that unit by 1.","type":"Datasheet"},{"name":"Unflinching Determination","description":"While this model is leading a unit, add 1 to the Objective Control characteristic of models in that unit.","type":"Datasheet"}],"keywords":["Infantry","Character","Imperium","Dogmata","Grenades"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Dogmata"],"points":[{"models":"1 model","cost":"45"}],"canLead":["000000908","000002481","000000903","000004189","000000909","000000894"],"ledBy":[]},{"id":"000000909","name":"Dominion Squad","role":"Other","loadout":"Every model is equipped with: bolt pistol; boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Dominion Squad","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Artificer-crafted storm bolter","type":"Ranged","profiles":[{"name":"Artificer-crafted storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"2","desc":"assault, rapid fire 2"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"assault, rapid fire 1"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Condemnor boltgun","type":"Ranged","profiles":[{"name":"Condemnor boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"anti-psyker 2+, devastating wounds, precision, rapid fire 1"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"MELTA 2, PISTOL"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"assault, melta 2"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"assault, ignores cover, torrent"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"PISTOL"},{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS, PISTOL"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Cherub","description":"Once per battle, after this unit has performed an Act of Faith, you gain 1 Miracle dice. Designer’s Note: Place a Cherub token next to the unit, removing it once this ability has been used.","type":"Datasheet"},{"name":"Righteous Awareness","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, if this unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to D6\".","type":"Datasheet"},{"name":"Holy Vanguard","description":"If this unit has a Leader unit attached to it during the Declare Battle Formations step and this unit starts the battle embarked within a TRANSPORT, that Leader unit gains the Scouts 6\" ability.","type":"Special (правая колонка)"},{"name":"Simulacrum Imperialis","description":"At the end of your Command phase, for each objective marker you control that has one or more units from your army with this ability within range of it, roll one D6: on a 4+, you gain 1 Miracle dice showing a value equal to that result.","type":"Wargear"}],"keywords":["Infantry","Grenades","Imperium","Dominion Squad"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Dominion Superior","9 Dominions"],"points":[{"models":"10 models","cost":"120"}],"canLead":[],"ledBy":["000001553","000002064","000002480","000002482","000002472","000000899","000000900","000000901","000000902"]},{"id":"000000912","name":"Exorcist","role":"Other","loadout":"This model is equipped with: Exorcist missile launcher; heavy bolter; armoured tracks.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Exorcist","m":"10\"","t":"10","sv":"3+","invSv":"6","w":"11","ld":"7+","oc":"3"}],"weapons":[{"name":"Exorcist conflagration rockets","type":"Ranged","profiles":[{"name":"Exorcist conflagration rockets","range":"36","type":"Ranged","a":"3D6","bsWs":"3","s":"6","ap":"-1","d":"1","desc":"blast, ignores cover, indirect fire"}]},{"name":"Exorcist missile launcher","type":"Ranged","profiles":[{"name":"Exorcist missile launcher","range":"36","type":"Ranged","a":"D6+2","bsWs":"3","s":"10","ap":"-3","d":"D6","desc":"indirect fire"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Devastating Refrain","description":"In your Shooting phase, after this model has shot, if one or more of those attacks made with an Indirect Fire weapon scored a hit against an enemy unit, that unit must take a Battle-shock test. Each time such an attack destroys an enemy model that has the Deadly Demise ability, that model’s Deadly Demise ability inflicts mortal wounds on a D6 roll of 5+ instead of on a 6.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Imperium","Exorcist","Vehicle","Smoke"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Exorcist"],"points":[{"models":"1 model","cost":"210"}],"canLead":[],"ledBy":[]},{"id":"000000901","name":"Hospitaller","role":"Characters","loadout":"This model is equipped with: bolt pistol; chirurgeon’s tools.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"This model can be attached to a Battle Sisters Squad, even if one Canoness, Palatine, Junith Eruita or AESTRED THURGA model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":false,"models":[{"name":"Hospitaller","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Chirurgeon’s tools","type":"Melee","profiles":[{"name":"Chirurgeon’s tools","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Medicus Ministorum","description":"While this model is leading a unit, models in that unit have the Feel No Pain 5+ ability.","type":"Datasheet"},{"name":"Sacred Healing","description":"While this model is leading a unit, in your Command phase, you can return up to 1 destroyed model (excluding CHARACTER models) to that unit. If you wish, you can first discard 1 Miracle dice; if you do, you can return up to D3+1 destroyed models (excluding CHARACTER models) to that unit instead.","type":"Datasheet"}],"keywords":["Imperium","Character","Infantry","Hospitaller"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Hospitaller"],"points":[{"models":"1 model","cost":"60"}],"canLead":["000002507","000000908","000000894","000002481","000000903","000004189","000000909"],"ledBy":[]},{"id":"000000900","name":"Imagifier","role":"Characters","loadout":"This model is equipped with: bolt pistol; boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":"This model can be attached to a Battle Sisters Squad, even if one Canoness, Palatine, Junith Eruita or AESTRED THURGA model has already been attached to it. If you do, and that Bodyguard unit is destroyed, the Leader units attached to it become separate units, with their original Starting Strengths.","isForgeWorld":false,"isLegends":false,"models":[{"name":"Imagifier","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Litany of Deeds","description":"Each time you gain a Miracle dice as the result of an ADEPTA SORORITAS unit or model from your army being destroyed, if that unit or model was destroyed within 12\" of this model, you can re-roll the result of that Miracle dice before adding it to your Miracle dice pool.","type":"Datasheet"},{"name":"Stanchion of Holy Martyrs","description":"While this model is leading a unit, models in that unit have a Save characteristic of 2+ and a 4+ invulnerable save.","type":"Datasheet"}],"keywords":["Character","Imperium","Imagifier","Infantry","Grenades"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Imagifier"],"points":[{"models":"1 model","cost":"65"}],"canLead":["000000894","000000908","000002481","000000903","000004189","000000909"],"ledBy":[]},{"id":"000000911","name":"Immolator","role":"Dedicated Transports","loadout":"This model is equipped with: heavy bolter; immolation flamers; armoured tracks.","transport":"This model has a transport capacity of 6 Adepta Sororitas Infantry models. It cannot transport Jump Pack models or the Triumph of Saint Katherine. At the start of the Declare Battle Formations step, you can select one Battle Sisters Squad, Dominion Squad or Sisters Novitiate Squad from your army. If you do, that unit is split into two units, each containing as equal a number of models as possible (when splitting a unit in this way, make a note of which models form each of the two new units. If you are splitting a unit that has the Cherub ability, only one of the new units can use that ability during the battle – make a note of which of the new units this will be). One of these units must start the battle embarked within this TRANSPORT; the other can start the battle embarked within another Transport, or it can be deployed as a separate unit.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Immolator","m":"12\"","t":"10","sv":"3+","invSv":"6","w":"11","ld":"7+","oc":"2"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Immolation flamers","type":"Ranged","profiles":[{"name":"Immolation flamers","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Twin heavy bolter","type":"Ranged","profiles":[{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 2, twin-linked"}]},{"name":"Twin multi-melta","type":"Ranged","profiles":[{"name":"Twin multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2, twin-linked"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Purge and Cleanse","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Dedicated Transport","Imperium","Immolator","Smoke","Vehicle","Transport"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Immolator"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000002064","name":"Junith Eruita","role":"Characters","loadout":"This model is equipped with: twin Ministorum heavy flamer; Mace of Castigation.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Junith Eruita","m":"8\"","t":"5","sv":"2+","invSv":"4","w":"8","ld":"6+","oc":"2"}],"weapons":[{"name":"Twin Ministorum heavy flamer","type":"Ranged","profiles":[{"name":"Twin Ministorum heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Mace of Castigation","type":"Melee","profiles":[{"name":"Mace of Castigation","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"6","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"The Pulpit of Saint Holline’s Basilica","description":"While this model is leading a unit, each time an attack targets that unit, subtract 1 from the Hit roll.","type":"Datasheet"},{"name":"Fiery Conviction","description":"If this model is on the battlefield at the start of your Command phase, you can choose one of the following: Discard 1 Miracle dice and gain 1CP.Take a Leadership test for this model, if that test is passed, gain 1CP.","type":"Datasheet"}],"keywords":["Mounted","Fly","Junith Eruita","Imperium","Epic Hero","Character"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Junith Eruita – EPIC HERO"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000000908","000000894","000002481","000000903","000004189","000000909","000002507"],"ledBy":[]},{"id":"000001553","name":"Ministorum Priest","role":"Characters","loadout":"This model is equipped with: zealot’s vindictor.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Preacher","m":"6\"","t":"3","sv":"6+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Holy pistol","type":"Ranged","profiles":[{"name":"Holy pistol","range":"12","type":"Ranged","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Zealot’s vindictor","type":"Ranged","profiles":[{"name":"Zealot’s vindictor","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Power Weapon","type":"Melee","profiles":[{"name":"Power Weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"Zealot’s vindictor","type":"Melee","profiles":[{"name":"Zealot’s vindictor","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Righteous Smiting","description":"While this model is leading a unit, each time a model in that unit makes a melee attack, add 1 to the Wound roll.","type":"Datasheet"},{"name":"Zealot","description":"Once per battle, in the Fight phase, this model can use this ability. If it does, until the end of the phase, improve the Strength and Attacks characteristics of melee weapons equipped by this model by 3.","type":"Datasheet"},{"name":"Holy Mission","description":"If this model is attached to a DOMINION SQUAD during the Declare Battle Formations step, it gains the Scouts 6\" ability. If this model is attached to a SISTERS NOVITIATE SQUAD during the Declare Battle Formations step, it gains the Infiltrators ability.","type":"Special (правая колонка)"}],"keywords":["Imperium","Character","Penitent","Ministorum Priest","Infantry"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Preacher"],"points":[{"models":"1 model","cost":"50"}],"canLead":["000002507","000000894","000004189","000000896","000000903","000000909","000004075"],"ledBy":[]},{"id":"000002067","name":"Mortifiers","role":"Other","loadout":"Every model is equipped with: 2 heavy bolters; twin penitent buzz-blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Mortifiers","m":"8\"","t":"6","sv":"4+","invSv":"6","w":"5","ld":"7+","oc":"2"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Mortifier flamer","type":"Ranged","profiles":[{"name":"Mortifier flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Penitent buzz-blade","type":"Melee","profiles":[{"name":"Penitent buzz-blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"10","ap":"-3","d":"2","desc":"sustained hits 1"}]},{"name":"Penitent flail","type":"Melee","profiles":[{"name":"Penitent flail","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"sustained hits 1"}]},{"name":"Twin penitent buzz-blades","type":"Melee","profiles":[{"name":"Twin penitent buzz-blades","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"10","ap":"-3","d":"2","desc":"sustained hits 1, twin-linked"}]},{"name":"Twin penitent flails","type":"Melee","profiles":[{"name":"Twin penitent flails","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"sustained hits 1, twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Anguish of the Unredeemed","description":"Each time a model in this unit is destroyed by a melee attack, if that model has not fought this phase, roll one D6. On a 2+, do not remove it from play; That destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play.","type":"Datasheet"},{"name":"Anchorite Sarcophagus","description":"The bearer has a Move characteristic of 7\" and a Save characteristic of 3+.","type":"Wargear"}],"keywords":["Mortifiers","Penitent","Imperium","Walker","Vehicle"],"factionKeywords":["Adepta Sororitas"],"composition":["1-2 Mortifiers"],"points":[{"models":"1 model","cost":"70"},{"models":"2 models","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000002479","name":"Morvenn Vahl","role":"Characters","loadout":"This model is equipped with: Fidelis; Paragon missile launcher; Lance of Illumination.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Morvenn Vahl","m":"8\"","t":"7","sv":"2+","invSv":"4","w":"8","ld":"6+","oc":"3"}],"weapons":[{"name":"Fidelis","type":"Ranged","profiles":[{"name":"Fidelis","range":"36","type":"Ranged","a":"3","bsWs":"2","s":"6","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Paragon missile launcher – prioris","type":"Ranged","profiles":[{"name":"Paragon missile launcher – prioris","range":"36","type":"Ranged","a":"2","bsWs":"2","s":"9","ap":"-2","d":"D6","desc":null}]},{"name":"Paragon missile launcher – sanctorum","type":"Ranged","profiles":[{"name":"Paragon missile launcher – sanctorum","range":"36","type":"Ranged","a":"2D6","bsWs":"2","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Lance of Illumination – strike","type":"Melee","profiles":[{"name":"Lance of Illumination – strike","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"8","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Lance of Illumination – sweep","type":"Melee","profiles":[{"name":"Lance of Illumination – sweep","range":"Melee","type":"Melee","a":"10","bsWs":"2","s":"5","ap":"-1","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Abbess Sanctorum","description":"While this model is leading a unit, each time a model in that unit makes an attack, you can re-roll the Hit roll and you can re-roll the Wound roll.","type":"Datasheet"},{"name":"Righteous Repugnance","description":"Each time this model’s unit is selected to shoot or fight, you can discard 1 Miracle dice. If you do, until the end of the phase, add 3 to the Attacks characteristic of Fidelis and the Lance of Illumination. Each time an enemy unit is destroyed by this model, you gain 1 Miracle dice.","type":"Datasheet"},{"name":"SUPREME COMMANDER","description":"If this model is in your army, it must be your Warlord.","type":"Special (правая колонка)"}],"keywords":["Character","Vehicle","Walker","Epic Hero","Imperium","Morvenn Vahl"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Morvenn Vahl – EPIC HERO"],"points":[{"models":"1 model","cost":"185"}],"canLead":["000002483"],"ledBy":[]},{"id":"000002472","name":"Palatine","role":"Characters","loadout":"This model is equipped with: bolt pistol; Palatine blade.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Palatine","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Palatine blade","type":"Melee","profiles":[{"name":"Palatine blade","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Fury of the Righteous","description":"While this model is leading a unit, weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Rapturous Blows","description":"Each time this model’s unit is selected to fight, you can discard 1 Miracle dice. If you do, then until the end of the phase, each time a melee attack made by this model scores a wound, the target of that attack suffers 1 mortal wound in addition to any normal damage.","type":"Datasheet"}],"keywords":["Character","Palatine","Imperium","Infantry","Grenades"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Palatine"],"points":[{"models":"1 model","cost":"50"}],"canLead":["000000908","000000894","000002481","000000903","000004189","000000909","000002507"],"ledBy":[]},{"id":"000002483","name":"Paragon Warsuits","role":"Other","loadout":"Every model is equipped with: bolt pistol; heavy bolter; Paragon storm bolters; Paragon war blade.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Paragon Warsuits","m":"8\"","t":"7","sv":"2+","invSv":"4","w":"4","ld":"7+","oc":"2"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]},{"name":"Ministorum heavy flamer","type":"Ranged","profiles":[{"name":"Ministorum heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Paragon grenade launchers","type":"Ranged","profiles":[{"name":"Paragon grenade launchers","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-2","d":"D3","desc":"twin-linked"}]},{"name":"Paragon storm bolters","type":"Ranged","profiles":[{"name":"Paragon storm bolters","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2, twin-linked"}]},{"name":"Paragon war blade","type":"Melee","profiles":[{"name":"Paragon war blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Paragon war mace","type":"Melee","profiles":[{"name":"Paragon war mace","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"12","ap":"-1","d":"3","desc":null}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Righteous Paragons","description":"Each time a model in this unit makes an attack that targets a MONSTER or VEHICLE unit, add 1 to the Hit roll and add 1 to the Wound roll.","type":"Datasheet"}],"keywords":["Paragon Warsuits","Walker","Grenades","Vehicle","Imperium"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Paragon Superior","2 Paragons"],"points":[{"models":"3 models","cost":"210"}],"canLead":[],"ledBy":["000002479"]},{"id":"000000897","name":"Penitent Engines","role":"Other","loadout":"Every model is equipped with: penitent flamers; twin penitent buzz-blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Penitent Engines","m":"8\"","t":"6","sv":"4+","invSv":"6","w":"5","ld":"7+","oc":"2"}],"weapons":[{"name":"Penitent flamers","type":"Ranged","profiles":[{"name":"Penitent flamers","range":"12","type":"Ranged","a":"2D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"assault, ignores cover, torrent, twin-linked"}]},{"name":"Penitent buzz-blade","type":"Melee","profiles":[{"name":"Penitent buzz-blade","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"10","ap":"-3","d":"2","desc":"sustained hits 1"}]},{"name":"Penitent flail","type":"Melee","profiles":[{"name":"Penitent flail","range":"Melee","type":"Melee","a":"8","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"sustained hits 1"}]},{"name":"Twin penitent buzz-blades","type":"Melee","profiles":[{"name":"Twin penitent buzz-blades","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"10","ap":"-3","d":"2","desc":"sustained hits 1, twin-linked"}]},{"name":"Twin penitent flails","type":"Melee","profiles":[{"name":"Twin penitent flails","range":"Melee","type":"Melee","a":"8","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"sustained hits 1, twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Endless Suffering","description":"This unit is eligible to declare a charge in a turn in which it Advanced.","type":"Datasheet"}],"keywords":["Walker","Imperium","Vehicle","Penitent Engines","Penitent"],"factionKeywords":["Adepta Sororitas"],"composition":["1-2 Penitent Engines"],"points":[{"models":"1 model","cost":"75"},{"models":"2 models","cost":"150"}],"canLead":[],"ledBy":[]},{"id":"000000907","name":"Repentia Squad","role":"Other","loadout":"The Repentia Superior is equipped with: bolt pistol; neural whips. Each Sister Repentia is equipped with: penitent eviscerator.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"REPENTIA SUPERIOR","m":"7\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"1"},{"name":"SISTERS REPENTIA","m":"7\"","t":"3","sv":"7+","invSv":"6","w":"1","ld":"8+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Neural whips","type":"Melee","profiles":[{"name":"Neural whips","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-1","d":"1","desc":"anti-infantry 4+"}]},{"name":"Penitent eviscerator","type":"Melee","profiles":[{"name":"Penitent eviscerator","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"6","ap":"-2","d":"2","desc":"sustained hits 1"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Overseer of Redemption","description":"While this unit contains a Repentia Superior model, each time a Sisters Repentia model in this unit makes a melee attack, you can re-roll the Hit roll and you can re-roll the Wound roll.","type":"Datasheet"}],"keywords":["Imperium","Penitent","Repentia Squad","Infantry","Grenades"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Repentia Superior","4-9 Sisters Repentia"],"points":[{"models":"5 models","cost":"75"},{"models":"10 models","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000001199","name":"Repressor","role":"Dedicated Transports","loadout":"This model is equipped with: Repressor twin heavy flamer; storm bolter; dozer ram.","transport":"This model has a transport capacity of 12 Adepta Sororitas Infantry models. It cannot transport Jump Pack models or the Triumph of Saint Katherine.","damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Repressor","m":"12\"","t":"10","sv":"3+","invSv":"6","w":"12","ld":"7+","oc":"2"}],"weapons":[{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Repressor twin heavy flamer","type":"Ranged","profiles":[{"name":"Repressor twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Dozer ram","type":"Melee","profiles":[{"name":"Dozer ram","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"7","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Emergency Combat Embarkation","description":"Once per turn, in your opponent’s Charge phase, after an enemy unit has selected targets for its charge but before it makes a Charge move, you can select one ADEPTA SORORITAS unit from your army that was selected as a target of that charge. Provided that unit is not within Engagement Range of any enemy units and every model in that unit is within 3\" of this TRANSPORT, it can embark within this TRANSPORT.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Imperium","Dedicated Transport","Repressor","Transport","Smoke","Vehicle"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Repressor"],"points":[{"models":"1 model","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000000908","name":"Retributor Squad","role":"Other","loadout":"The Retributor Superior is equipped with: bolt pistol; boltgun; close combat weapon. Each Retributor is equipped with: bolt pistol; heavy bolter; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Retributor Squad","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"}]},{"name":"Condemnor boltgun","type":"Ranged","profiles":[{"name":"Condemnor boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ANTI-PSYKER 2+, DEVASTATING WOUNDS, PRECISION, RAPID FIRE 1"}]},{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"heavy, sustained hits 1"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"MELTA 2, PISTOL"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"IGNORES COVER, PISTOL, TORRENT"}]},{"name":"Ministorum heavy flamer","type":"Ranged","profiles":[{"name":"Ministorum heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"heavy, melta 2"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"PISTOL"},{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS, PISTOL"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Cherubs","description":"Twice per battle, after this unit has performed an Act of Faith, you gain 1 Miracle dice. Designer’s Note: Place two Cherub tokens next to the unit, removing one each time this ability has been used.","type":"Datasheet"},{"name":"Storm of Retribution","description":"Each time a model in this unit makes a ranged attack, re-roll a Hit roll of 1 and re-roll a Wound roll of 1. If such an attack targets an enemy unit that has destroyed one or more Adepta Sororitas units from your army during the battle, add 1 to the Hit roll and add 1 to the Wound roll as well.","type":"Datasheet"}],"keywords":["Infantry","Grenades","Imperium","Retributor Squad"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Retributor Superior","4 Retributors"],"points":[{"models":"5 models","cost":"120"}],"canLead":[],"ledBy":["000002064","000002480","000002482","000002472","000000899","000000900","000000901","000000902"]},{"id":"000000898","name":"Saint Celestine","role":"Characters","loadout":"Saint Celestine is equipped with: the Ardent Blade. Each Geminae Superia is equipped with: bolt pistol; power weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"CELESTINE","m":"12\"","t":"3","sv":"2+","invSv":"4","w":"5","ld":"6+","oc":"1"},{"name":"GEMINAE SUPERIA","m":"12\"","t":"3","sv":"2+","invSv":"4","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"The Ardent Blade","type":"Ranged","profiles":[{"name":"The Ardent Blade","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-2","d":"1","desc":"ignores cover, torrent"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"The Ardent Blade","type":"Melee","profiles":[{"name":"The Ardent Blade","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"6","ap":"-3","d":"2","desc":"devastating wounds"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Healing Tears","description":"While this unit contains a Celestine model, in your Command phase, if this unit is below its Starting Strength, either one destroyed Geminae Superia model or up to D3 other Bodyguard models are returned to this unit.","type":"Datasheet"},{"name":"Lifewards","description":"While this unit contains one or more Geminae Superia models, Celestine has the Feel No Pain 4+ ability.","type":"Datasheet"},{"name":"Miraculous Intervention","description":"The first time this unit’s Celestine model is destroyed, roll one D6 at the end of the phase. On a 2+, set that Celestine model back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with its full wounds remaining.","type":"Datasheet"}],"keywords":["Saint Celestine","Epic Hero","Character","Imperium","Grenades","Fly","Jump Pack","Infantry"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Celestine – EPIC HERO","2 Geminae Superia"],"points":[{"models":"3 models","cost":"150"}],"canLead":["000002066","000000904"],"ledBy":[]},{"id":"000004075","name":"Sanctifiers","role":"Other","loadout":"The Miraculist is equipped with: holy fire; burning hands. The Salvationist is equipped with: close combat weapon; Salvationist medikit. The Death Cult Assassin is equipped with: Death Cult blades. 1 Missionary is equipped with: plasma gun; Sanctifier melee weapon. 1 Missionary is equipped with: Ministorum flamer; Sanctifier melee weapon. Every Sanctifier is equipped with: Ministorum hand flamer; Sanctifier melee weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"","m":"6\"","t":"3","sv":"6+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Holy fire","type":"Ranged","profiles":[{"name":"Holy fire","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"2","desc":"ignores cover, one shot, torrent"}]},{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Plasma gun – standard","type":"Ranged","profiles":[{"name":"Plasma gun – standard","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"7","ap":"-2","d":"1","desc":"rapid fire 1"}]},{"name":"Plasma gun – supercharge","type":"Ranged","profiles":[{"name":"Plasma gun – supercharge","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"8","ap":"-3","d":"2","desc":"hazardous, rapid fire 1"}]},{"name":"Burning hands","type":"Melee","profiles":[{"name":"Burning hands","range":"Melee","type":"Melee","a":"1","bsWs":"2","s":"6","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Death Cult blades","type":"Melee","profiles":[{"name":"Death Cult blades","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"precision"}]},{"name":"Sanctifier melee weapon","type":"Melee","profiles":[{"name":"Sanctifier melee weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"},{"name":"Ministorum Sermon","description":"While this unit contains a MINISTORUM PRIEST, melee weapons equipped by models in this unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Cherub","description":"Once per battle, after this unit has performed an Act of Faith, you gain 1 Miracle dice. Designer’s Note: Place a Cherub token next to the unit, removing it once this ability has been used.","type":"Datasheet"},{"name":"ATTACHED UNIT","description":"If a Ministorum Priest from your army with the Leader ability can be attached to a Battle Sisters Squad, it can be attached to this unit instead. If a MINISTORUM PRIEST from your army is attached to this unit during the Declare Battle Formations step, that model gains the Scouts 6\" ability.","type":"Fortification (левая колонка)"},{"name":"Salvationist Medikit","description":"In your Command phase, if the bearer is on the battlefield, you can return up to D3 destroyed models (excluding CHARACTER models) to this unit.","type":"Wargear"},{"name":"Simulacrum Imperialis","description":"At the end of your Command phase, for each objective marker you control that has one or more units from your army with this ability within range of it, roll one D6: on a 4+, you gain 1 Miracle dice showing a value equal to that result.","type":"Wargear"}],"keywords":["Sanctifiers","Infantry","Grenades","Imperium"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Miraculist","1 Salvationist","1 Death Cult Assassin","2 Missionaries","4 Sanctifiers"],"points":[{"models":"9 models","cost":"110"}],"canLead":[],"ledBy":["000001553"]},{"id":"000000904","name":"Seraphim Squad","role":"Other","loadout":"Every model is equipped with: 2 bolt pistols; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Seraphim Squad","m":"12\"","t":"3","sv":"3+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Inferno pistol","type":"Ranged","profiles":[{"name":"Inferno pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"melta 2, pistol"}]},{"name":"Ministorum hand flamer","type":"Ranged","profiles":[{"name":"Ministorum hand flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Angelic Ascent","description":"In your Shooting phase, after this unit has shot, if it is not within Engagement Range of any enemy units, it can make a Normal move of up to 6\". If it does, until the end of the turn, this unit is not eligible to declare a charge.","type":"Datasheet"}],"keywords":["Grenades","Infantry","Jump Pack","Fly","Seraphim Squad","Imperium"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Seraphim Superior","4-9 Seraphim"],"points":[{"models":"5 models","cost":"80"},{"models":"10 models","cost":"160"}],"canLead":[],"ledBy":["000000898","000003714"]},{"id":"000002507","name":"Sisters Novitiate Squad","role":"Other","loadout":"The Novitiate Superior is equipped with: bolt pistol; boltgun; close combat weapon. Each Sister Novitiate is equipped with: autopistol; autogun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"NOVITIATE SUPERIOR","m":"6\"","t":"3","sv":"3+","invSv":"6","w":"1","ld":"7+","oc":"2"},{"name":"SISTER NOVITIATE","m":"6\"","t":"3","sv":"4+","invSv":"6","w":"1","ld":"8+","oc":"2"}],"weapons":[{"name":"Autopistol","type":"Ranged","profiles":[{"name":"Autopistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Autogun","type":"Ranged","profiles":[{"name":"Autogun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"3","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Boltgun","type":"Ranged","profiles":[{"name":"Boltgun","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 1"}]},{"name":"Ministorum flamer","type":"Ranged","profiles":[{"name":"Ministorum flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"0","d":"1","desc":"ignores cover, torrent"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Novitiate melee weapons","type":"Melee","profiles":[{"name":"Novitiate melee weapons","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Impetuous Fervour","description":"Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target of that attack is an enemy unit within range of an objective marker, you can re-roll the Hit roll instead.","type":"Datasheet"},{"name":"Sacred Banner","description":"You can re-roll Advance and Charge rolls made for the bearer’s unit.","type":"Wargear"},{"name":"Simulacrum Imperialis","description":"At the end of your Command phase, for each objective marker you control that has one or more units from your army with this ability within range of it, roll one D6: on a 4+, you gain 1 Miracle dice showing a value equal to that result.","type":"Wargear"}],"keywords":["Infantry","Grenades","Imperium","Sisters Novitiate Squad"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Novitiate Superior","9 Sisters Novitiate"],"points":[{"models":"10 models","cost":"100"}],"canLead":[],"ledBy":["000001553","000002480","000002472","000000902","000000901","000002064","000000899"]},{"id":"000000910","name":"Sororitas Rhino","role":"Dedicated Transports","loadout":"This model is equipped with: storm bolter; armoured tracks.","transport":"This model has a transport capacity of 12 Adepta Sororitas Infantry models. It cannot transport Jump Pack models or the Triumph of Saint Katherine.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Sororitas Rhino","m":"12\"","t":"9","sv":"3+","invSv":"6","w":"10","ld":"7+","oc":"2"}],"weapons":[{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]},{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Self Repair","description":"At the start of your Command phase, this model regains 1 lost wound.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Vehicle","Transport","Dedicated Transport","Smoke","Imperium","Sororitas Rhino"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Sororitas Rhino"],"points":[{"models":"1 model","cost":"75"}],"canLead":[],"ledBy":[]},{"id":"000002063","name":"Triumph Of Saint Katherine","role":"Characters","loadout":"This model is equipped with: bolt pistols; relic weapons.","transport":null,"damagedW":"1-6","damagedDescription":"While this model has 1-6 wounds remaining, the Attacks characteristics of all of its weapons are halved, and you can only select one ability when using its Relics of the Matriarchs ability, instead of up to two.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Triumph Of Saint Katherine","m":"6\"","t":"3","sv":"3+","invSv":"4","w":"18","ld":"6+","oc":"6"}],"weapons":[{"name":"Bolt pistols","type":"Ranged","profiles":[{"name":"Bolt pistols","range":"12","type":"Ranged","a":"6","bsWs":"2","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Relic weapons","type":"Melee","profiles":[{"name":"Relic weapons","range":"Melee","type":"Melee","a":"18","bsWs":"2","s":"5","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Relics of the Matriarchs","description":"At the start of the battle round, select up to two of the abilities in the Relics of the Matriarchs section (see left). Until the start of the next battle round, this model has those abilities.","type":"Datasheet"},{"name":"Solemn Procession","description":"Each time you gain 1 Miracle dice at the start of the battle round, if this model is on the battlefield, do not roll one D6 to determine the value of that Miracle dice; it has a value of 6.","type":"Datasheet"},{"name":"The Fiery Heart (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, add 2\" to that unit's Move characteristic and add 1 to Advance and Charge rolls made for that unit.","type":"Primarch"},{"name":"Censer of the Sacred Rose (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, you can re-roll Battle-shock tests taken for that unit.","type":"Primarch"},{"name":"Simulacrum of the Ebon Chalice (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, that unit can perform up to two Acts of Faith per phase, instead of only one.","type":"Primarch"},{"name":"Simulacrum of the Argent Shroud (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, each time a model in that unit makes a ranged attack, re-roll a Wound roll of 1.","type":"Primarch"},{"name":"Icon of the Valorous Heart (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, models in that unit have the Feel No Pain 6+ ability.","type":"Primarch"},{"name":"Petals of the Bloody Rose (Aura)","description":"While a friendly ADEPTA SORORITAS unit is within 6\" of this model, improve the Armour Penetration characteristic of melee weapons equipped by models in that unit by 1.","type":"Primarch"}],"keywords":["Grenades","Character","Epic Hero","Imperium","Triumph of Saint Katherine","Infantry"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Triumph of Saint Katherine – EPIC HERO"],"points":[{"models":"1 model","cost":"235"}],"canLead":["000000894","000000903"],"ledBy":[]},{"id":"000002066","name":"Zephyrim Squad","role":"Other","loadout":"Every model is equipped with: bolt pistol; power weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Zephyrim Squad","m":"12\"","t":"3","sv":"3+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Bolt pistol","type":"Ranged","profiles":[{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – standard","type":"Ranged","profiles":[{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"pistol"}]},{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Acts of Faith","description":"If your Army Faction is ADEPTA SORORITAS, each unit from your army with this ability can perform one Act of Faith per phase. This is done using Miracle dice. GAINING MIRACLE DICE If your Army Faction is ADEPTA SORORITAS, you gain 1 Miracle dice: At the start of each battle round.Each time an ADEPTA SORORITAS unit from your army is destroyed. Each time you gain a Miracle dice, roll one D6. The number you roll is the value of that Miracle dice. This value cannot be changed or re-rolled, unless a rule specifically states otherwise. Keep your Miracle dice to one side - this is your Miracle dice pool. PERFORMING AN ACT OF FAITH Before making a dice roll for a model or unit from your army with the Acts of Faith ability, if you have one or more dice in your Miracle dice pool, that unit can perform an Act of Faith. If it does, select one of the dice from your Miracle dice pool to substitute that dice roll (if a roll involves more than one dice, e.g. a Charge roll or Battle-shock test, only a single dice can be substituted). The dice that is being substituted is not rolled; instead, the value of the selected Miracle dice is used as if it had been rolled ( this counts as an unmodified dice roll of that value for all rules purposes). Each Miracle dice can only be selected for substitution once. Once all Miracle dice substitutions have been made, remove the chosen Miracle dice from your Miracle dice pool, and roll all remaining, unsubstituted dice that are a part of the dice roll. You can use Miracle dice when a unit performs an Act of Faith for any of the following types of dice roll: Advance rollBattle-shock testCharge rollDamage rollHit rollSaving throwWound roll Example: Instead of rolling 2D6 to take a unit’s Battle-shock test, you could use one dice from your Miracle dice pool. If the value of that dice was 4, the unit’s Battle-shock test would be determined by rolling one D6 and adding 4 to it (i.e. it would be D6+4).","type":"Faction"},{"name":"Embodied Prophecy","description":"Each time this unit is selected to fight, select one of the following abilities to apply to melee weapons equipped by models in this unit until the end of the phase: [SUSTAINED HITS 1][LETHAL HITS]If this unit made a Charge move this turn, until the end of the phase, select both abilities above to apply to melee weapons equipped by models in this unit instead.","type":"Datasheet"},{"name":"Sacred Banner","description":"You can re-roll Advance and Charge rolls made for the bearer’s unit.","type":"Wargear"}],"keywords":["Imperium","Jump Pack","Fly","Infantry","Grenades","Zephyrim Squad"],"factionKeywords":["Adepta Sororitas"],"composition":["1 Zephyrim Superior","4-9 Zephyrim"],"points":[{"models":"5 models","cost":"80"},{"models":"10 models","cost":"160"}],"canLead":[],"ledBy":["000000898","000003714"]}]}