{"id":"DRU","name":"Drukhari","lastUpdate":"2026-02-17 13:32:38","detachments":[{"name":"Covenite Coterie","rules":[{"name":"Stitchflesh Abominations","description":"Each time an attack targets a Haemonculus Covens unit from your army, if the Strength characteristic of that attack is greater than the Toughness characteristic of your unit, subtract 1 from the Wound roll."}],"enhancements":[{"name":"Master Regenesist","description":"Haemonculus model only. Each time the bearer uses its Fleshcraft ability, you can return up to D3+3 destroyed Bodyguard models to the bearer’s unit instead of D3+1.","cost":"25"},{"name":"Master Nemesine","description":"Haemonculus model only. The bearer’s weapons have the [anti-beast 2+] and [anti-monster 4+] abilities.","cost":"5"},{"name":"Master Artisan","description":"Haemonculus model only. Add 1 to the bearers Wounds characteristic and add 1 to the Toughness characteristic of models in the bearer’s unit.","cost":"20"},{"name":"Master Repugnomancer (Aura)","description":"Haemonculus model only. Add 3\" to the range of the bearer’s Fear Incarnate ability, and each time a friendly Drukhari unit within 9\" of the bearer fails a Battle-shock test or is destroyed, roll one D6: on a 4+, you gain 1 Pain token.","cost":"15"}],"stratagems":[{"name":"CONNOISSEURS OF PAIN","type":"Covenite Coterie – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Drukhari unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Spend 1 Pain token. Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1. At the end of the phase, if your unit is still on the battlefield and it is a Haemonculus Covens unit, you gain 1 Pain token."},{"name":"SYMPHONY OF SUFFERING","type":"Covenite Coterie – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a Drukhari unit from your army destroys an enemy unit. TARGET: That DRUKHARI unit. EFFECT: Each enemy unit within 9\" of and visible to your unit must take a Battle-shock test, subtracting 1 from that test if your unit is a Haemonculus Covens unit."},{"name":"POISONER’S ART","type":"Covenite Coterie – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a Haemonculus Covens unit from your army has fought. TARGET: That HAEMONCULUS COVENS unit. EFFECT: Select one enemy unit (excluding VEHICLES) hit by one or more of your unit’s attacks this phase. Until the end of the battle, that enemy unit is poisoned. At the start of each Command phase, roll one D6 for each poisoned unit on the battlefield: on a 4+, that unit suffers D3 mortal wounds."},{"name":"POSTMORTALITY","type":"Covenite Coterie – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One Haemonculus model from your army that was just destroyed. You can use this Stratagem on that model even though it was just destroyed. EFFECT: Spend 1-3 Pain tokens. At the end of the phase, set the destroyed model back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with a number of wounds remaining equal to the number of Pain tokens you just spent. RESTRICTIONS: You cannot use this Stratagem if you have 0 Pain tokens, and you cannot target the same HAEMONCULUS model with this Stratagem more than once per battle."},{"name":"DISTILLERS OF FEAR","type":"Covenite Coterie – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One Haemonculus Covens unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack that targets an enemy unit that is Battle-shocked, that attack has the [DEVASTATING WOUNDS] ability."},{"name":"ENFOLDING NIGHTMARE","type":"Covenite Coterie – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has shot. TARGET: One Haemonculus Covens unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Roll one D6: your unit can be moved a number of inches up to the result, but it must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, those models can be moved within Engagement Range of that enemy unit."}]},{"name":"Kabalite Cartel","rules":[{"name":"Murderous Agenda","description":"At the start of the first battle round, select one of the Contracts below, then select one unit from your opponent’s army that matches the ‘Contract’ description in that Contract. Until that Contract is completed, that unit is your Contract unit and Kabal and Blades for Hire units from your army have the ability stated in that Contract. At the start of your Command phase, if your Contract unit is destroyed, that Contract is completed and you gain 3 Pain tokens. Trophy Hunters Contract: One CHARACTER unit. Ability: Each time a KABAL or BLADES FOR HIRE model in this unit makes an attack that targets the Contract unit, that attack has the [precision] ability. Sow Fear and Terror Contract: One INFANTRY or MOUNTED unit (excluding units containing only CHARACTER models). At the start of your Command phase, this Contract is completed if all non-CHARACTER models in that unit are destroyed. Ability: Each time a KABAL or BLADES FOR HIRE model in this unit makes an attack that targets an INFANTRY or MOUNTED unit, that attack has the [sustained hits 1] ability. Show of Strength Contract: One MONSTER or VEHICLE unit. Ability: Each time a KABAL or BLADES FOR HIRE model in this unit makes an attack that targets a MONSTER or VEHICLE unit, that attack has the [lethal hits] ability."}],"enhancements":[{"name":"Leechbite Plate","description":"Archon model only. The bearer has a Save characteristic of 3+. At the start of either player’s Command phase, you can spend 1 Pain token: if you do, the bearer regains all of its lost wounds.","cost":"5"},{"name":"Webway Awl","description":"Archon model only. Models in the bearer’s unit have the Deep Strike ability, and you can target the bearer’s unit with the Rapid Ingress Stratagem for 0CP.","cost":"25"},{"name":"Informant Network","description":"Archon model only. At the start of the Declare Battle Formations step, select up to three Kabalite Warriors and/or Hand of the Archon units from your army; those units gain the Infiltrators ability.","cost":"30"},{"name":"Towering Arrogance","description":"Archon model only. While the bearer is leading a unit, improve the Leadership and Objective Control characteristics of models in that unit by 1.","cost":"20"}],"stratagems":[{"name":"MAKING A POINT","type":"Kabalite Cartel – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Kabalite Warriors or Hand of the Archon unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, improve the Ballistic Skill and Armour Penetration characteristics of ranged weapons equipped by models in your unit by 1."},{"name":"TAKEN ALIVE","type":"Kabalite Cartel – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One Drukhari unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack, add 1 to the Hit roll. If your Contract unit is destroyed as a result of those attacks, every unit in your opponent’s army must take a Battle-shock test. You cannot gain more than 3 Pain tokens as a result of failed Battle-shock tests caused by this Stratagem."},{"name":"ENEMIES WITHOUT NUMBER","type":"Kabalite Cartel – Epic Deed Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase, just after you complete a Contract. TARGET: One Archon WARLORD from your army. EFFECT: Select one new Contract (this can be one you have already completed), then select one unit from your opponent’s army that is on the battlefield and matches the ‘Contract’ description in that Contract. Until that Contract is completed, that unit is your Contract unit and the Murderous Agenda Detachment rule applies as normal."},{"name":"TAILORED TOXINS","type":"Kabalite Cartel – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One Kabal or Blades for Hire unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack that targets your Contract unit, an unmodified Hit roll of 5+ scores a Critical Hit."},{"name":"DOUBLE-CROSS","type":"Kabalite Cartel – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Kabal or Blades for Hire unit from your army that was selected as the target of one or more of the attacking unit’s attacks, and one friendly Drukhari unit (excluding Vehicles). EFFECT: Until the end of the phase, each time you would allocate an attack to a model in your KABAL or BLADES FOR HIRE unit, if your DRUKHARI unit is within Engagement Range of the attacking model, no saving throw is made for that attack; instead, your DRUKHARI unit suffers a number of mortal wounds equal to the Damage characteristic of that attack."},{"name":"DEADLY DECEIVERS","type":"Kabalite Cartel – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Kabal or Blades for Hire unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\"."}]},{"name":"Kabalite Corsairs","rules":[{"name":"Raid and Pillage","description":"Each time a DRUKHARi unit from your army destroys an enemy unit, if that enemy unit was within range of an objective marker controlled by your opponent at the start of the phase, you gain 1 Pain token. In addition, in your Command phase, you can select one objective marker you control that has one or more KAbAL units from your army within range of it, then expend 1 Pain token from your Pain token pool. If you do, that objective marker is Secured by your army."}],"enhancements":[{"name":"Dark Charisma","description":"The bearer has an Objective Control characteristic of 5 and you can re-roll Battle-shock tests taken for the bearer.","cost":"0"},{"name":"Malevolent Cunning","description":"The first time in each battle round that your opponent targets a unit from their army that is within 3\" of the bearer with a Stratagem, increase that Stratagems cost by 1CP for that usage.","cost":"0"}],"stratagems":[{"name":"ELUSIVE DUELLISTS","type":"Kabalite Corsairs – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One DRUKHARI unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll and, if your unit has the INcUBI keyword, models in your unit have a 4+ invulnerable save."},{"name":"DECKPLATE SWEEPERS","type":"Kabalite Corsairs – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One KABAL unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, improve the Armour Penetration characteristic of splinter cannons, splinter rifles and splinter pistols equipped by models in your unit by 1."},{"name":"TAKE THEM ALIVE","type":"Kabalite Corsairs – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase, just after a KABAL unit from your army has shot. TARGET: That KABAL unit. EFFECT: Select one enemy unit hit by one or more of your unit’s attacks this phase (excluding those made with Pistols). That enemy unit must take a Battle-shock test, subtracting 1 from the result if your unit is within 6” of it."},{"name":"OPPORTUNISTIC THIEVES","type":"Kabalite Corsairs – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Fight phase","description":"WHEN: End of your Fight phase. TARGET: One KABAL unit from your army that is not within Engagement Range of one or more enemy units. EFFECT: Select one objective marker you do not control that is visible to your unit. Your unit can make a Normal move of up to D6\", but if it does, every model in that unit must end that move as close as possible to that objective marker."}]},{"name":"Painbringers","rules":[{"name":"Regenerative Agony","description":"Each time four or more Feel No Pain rolls are successful for HAEMONCULUS COvENS models from your army in a single phase, you gain 1 Pain token. In addition, each battle round, the first time a HAEMONCULUS COVENS unit from your army becomes Empowered in that battle round, roll one D6: on a 2-5, one model in that unit regains 1 lost wound or, if that unit has the WRACKS keyword, one destroyed model is returned to it with its full wounds remaining; on a 6, one model in that unit regains up to 2 lost wounds or, if that unit has the WRACKS keyword, one destroyed model is returned to it with its full wounds remaining."}],"enhancements":[{"name":"Rending Chain-Flails","description":"Each time an enemy unit within Engagement Range of the bearer is selected to Fall Back, roll one D6: on a 2-4, that enemy unit suffers 1 mortal wound; on a 5+, that enemy unit suffers 2 mortal wounds.","cost":"0"},{"name":"Vile Surgeon","description":"The bearers Haemonculus tools and scissorhands have a Damage characteristic of 3 while targeting CHARACTER units.","cost":"0"}],"stratagems":[{"name":"MOULDED MUSCULATURE","type":"Painbringers – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One HAEMONcULUS COvENS unit from your army that has not been selected to fight this phase. EFFECT: Select any number of models in your unit. Until the end of the phase, improve the Strength and Armour Penetration characteristics of melee weapons equipped by the selected models by 1, and each time you select targets for attacks made by those models, they must target an enemy unit that is wholly on the opposite side of a Hatchway from them."},{"name":"UNFEELING ABOMINATIONS","type":"Painbringers – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One HAEMONcULUS COvENS unit from your army that was selected as the target of one or more of the attacking unit's attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 if your unit has the GROTESqUES keyword: on a 4+, do not remove the destroyed model from play; it can fight after the attacking unit has finished making its attacks, and is then removed from play. RESTRICTIONS: If your unit has the GROTESQUES keyword, until the end of the phase, it loses the Mindless Killing Machines ability."},{"name":"TERRIFYING AURA","type":"Painbringers – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent's Shooting phase, just after an enemy unit has selected its targets. TARGET: One HAEMONcULUS COvENS unit from your army that was selected as the target of one or more of the attacking unit's attacks and is within 6\" of the attacking unit. EFFECT: That enemy unit must take a Leadership test, subtracting 1 if it is within 3\" of your unit: if failed, until the end of the phase, each time a model in that enemy unit makes an attack that targets your unit, an unmodified Hit roll of 6 is required to score a hit, irrespective of the attacking weapon’s Ballistic Skill or any modifiers."},{"name":"HORRIFYING FORM","type":"Painbringers – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: End of any phase, when an objective marker Secured by your army would be Seized by an enemy unit. TARGET: One HAEMONcULUS COvENS unit from your army within range of that objective marker. EFFECT: Until the end of your next turn, while you have one or more DRUKHARI units within range of that objective marker (excluding Battle-shocked units), that objective marker remains Secured by your army and cannot be Seized by enemy units. RESTRICTIONS: You can only use this Stratagem once per battle round."}]},{"name":"Realspace Raiders","rules":[{"name":"Alliance of Agony","description":"At the start of the battle, you gain 2 Pain tokens for each of the following combinations your army contains (these do not need to be in the same Attached unit): One or more Archon models and one or more Kabalite Warriors units.One or more Succubus models and one or more Wyches units.One or more Haemonculus models and one or more Wracks units. Designer’s Note: These are all cumulative, so if your army contains at least one of all of the combinations listed above, you start the battle with 6 Pain tokens."}],"enhancements":[{"name":"Dark Vitality","description":"DRUKHARI model only. The bearer’s unit is always Empowered - you do not need to spend any Pain tokens to activate that unit’s Pain abilities.","cost":"25"},{"name":"Labyrinthine Cunning","description":"Archon model only. At the start of your Command phase, if the bearer is on the battlefield, you can do one of the following: Spend 1 Pain token and gain 1CP.Roll one D6: on a 4+, you gain 1CP.","cost":"25"},{"name":"Eye of Spite","description":"Succubus model only. Improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 1. Each time the bearer’s unit is selected to fight, you can spend 1 Pain token; if you do, until the end of the phase, improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 2 instead.","cost":"15"},{"name":"Crucible of Malediction","description":"Haemonculus model only. Once per battle, in your Shooting phase, the bearer can use this Enhancement. If it does, you can spend 1 Pain token. Then, each enemy unit within 12\" of the bearer must take a Battle-shock test, subtracting 1 from that test if you spent 1 Pain token. Each time a PSYKER unit fails that test, it suffers 3 mortal wounds.","cost":"20"}],"stratagems":[{"name":"INSENSIBLE TO PAIN","type":"Realspace Raiders – Battle Tactic Stratagem","cost":"2","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Haemonculus Covens unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack is allocated to a model in your unit, subtract 1 from the Damage characteristic of that attack."},{"name":"INSTINCTIVE SPITE","type":"Realspace Raiders – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Start of your Shooting phase or the start of the Fight phase. TARGET: Up to two Drukhari Battleline units from your army, or one other Drukhari unit from your army. EFFECT: You can spend 1 Pain token. Until the end of the phase, each time a model in each of those units makes an attack that targets an enemy unit that is Below Half-strength, add 1 to the Hit roll. If you spent 1 Pain token, add 1 to the Wound roll as well."},{"name":"FIGHTING SHADOWS","type":"Realspace Raiders – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Drukhari unit from your army (excluding Haemonculus Covens units) that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"EAGER FOR THE KILL","type":"Realspace Raiders – Battle Tactic Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Start of your Movement phase. TARGET: Up to two Wyches units from your army, or one other Drukhari unit from your army, that have not been selected to move this phase. EFFECT: Until the end of the phase, each time one of those units Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in that unit (this is not cumulative with the Reavers’ Matchless Swiftness ability)."},{"name":"DARK HARVEST","type":"Realspace Raiders – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Start of the Fight phase. TARGET: Up to two Wracks units from your army, or one other Drukhari unit from your army. EFFECT: Until the end of the phase, melee weapons equipped by models in each of those units have the [LETHAL HITS] ability."},{"name":"RAID AND FADE","type":"Realspace Raiders – Strategic Ploy Stratagem","cost":"2","when":"Your turn – Shooting phase","description":"WHEN: End of your Shooting phase. TARGET: Up to two Kabalite Warriors units from your army, or one other Drukhari unit from your army (excluding ScouRGES and Aircraft). EFFECT: Each of those units can make a Normal move of up to 6\". RESTRICTIONS: You cannot select units that are within Engagement Range of one or more enemy units. Until the end of the turn, those units are not eligible to declare a charge."}]},{"name":"Reaper’s Wager","rules":[{"name":"Callous Competition","description":"At the start of the battle, Drukhari units from your army are winning the wager. Each time a DRUKHARI unit from your army destroys an enemy unit, DRUKHARI units from your army are winning the wager. Each time a Harlequins unit from your army destroys an enemy unit, HARLEQUIN units from your army are winning the wager. While DRUKHARI units from your army are winning the wager, HARLEQUIN units from your army are losing the wager, and vice versa. Each time a DRUKHARI or HARLEQUINS model from your army makes an attack, if that model’s unit is winning the wager, re-roll a Hit roll of 1. If that model’s unit is losing the wager, re-roll a Hit roll of 1 and re-roll a Wound roll of 1 instead. HARLEQUINS You can include Harlequins units in your army (see Codex: Aeldari). The combined points cost of such units depends on your battle size: Incursion: Up to 500 ptsStrike Force: Up to 1000 ptsOnslaught: Up to 1500 pts No HARLEQUINS models from your army can be your WARLORD. If you select this Detachment, you cannot use the Corsairs and Travelling Players army rule."}],"enhancements":[{"name":"Archraider","description":"Harlequins or Drukhari model only. In the Declare Battle Formations step, if the bearer starts the battle embarked within a Dedicated Transport, that DEDICATED TRANSPORT has the Scouts 9\" ability.","cost":"15"},{"name":"Webway Walker","description":"Harlequins or Drukhari model only. Models in the bearer’s unit have the Deep Strike ability. Each time the bearer’s unit is set up on the battlefield using the Deep Strike ability, if that unit is currently losing the wager, until the end of the turn, you can re-roll Charge rolls made for that unit.","cost":"15"},{"name":"Reaper’s Cowl","description":"Harlequins model only. Models in the bearer’s unit have the Stealth and Infiltrators abilities.","cost":"25"},{"name":"Conductor of Torment","description":"Drukhari model only. In your Command phase, you can do one of the following: If your DRUKHARI units are currently losing the wager, you can gain 1 Pain token. If you do, DRUKHARI units from your army are now winning the wager.If your DRUKHARI units are currently winning the wager, you can discard 1 Pain token. If you do, Harlequins units from your army are now winning the wager.","cost":"20"}],"stratagems":[{"name":"MURDERER’S CIRCUS","type":"Reaper’s Wager – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Drukhari or Harlequins unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"MALICIOUS FRENZY","type":"Reaper’s Wager – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One Drukhari or Harlequins unit from your army that has not been selected to shoot or fight this phase. EFFECT: Select [LETHAL HITS] or [SUSTAINED HITS 1]. Until the end of the phase, weapons equipped by models in your unit have the selected ability."},{"name":"DANCE MACABRE","type":"Reaper’s Wager – Strategic Ploy Stratagem","cost":"2","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move. TARGET: One Drukhari Infantry or Harlequins Infantry unit from your army that is within 9\" of that enemy unit. EFFECT: Your unit can make a Normal move of up to D6\". If your unit is currently losing the wager, it can make a Normal move of up to 6\" instead."},{"name":"SCINTILLATING TEMPO","type":"Reaper’s Wager – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement or Charge phase","description":"WHEN: Your Movement phase or your Charge phase, just after a Drukhari or Harlequins unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. TARGET: That unit. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at your unit."},{"name":"SHORTEN THE ODDS","type":"Reaper’s Wager – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a Drukhari or Harlequins unit from your army has Advanced. TARGET: That unit. EFFECT: Until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Advanced."},{"name":"FATEFUL ROLE","type":"Reaper’s Wager – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Drukhari or Harlequins unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 to the result if that unit is losing the wager: on a 4+, do not remove it from play. That destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play."}]},{"name":"Ship-killer Cult","rules":[{"name":"Appetite for Adulation","description":"In the Fight phase, if two or more enemy units were destroyed by DRUKHARi units from your army that phase, you gain 1 Pain token. In addition, each time a WYCH CULT unit from your army becomes Empowered in the Fight phase, until the end of the phase, melee weapons equipped by models in that unit have the [ANTi-iNFANTRY 4+] ability."}],"enhancements":[{"name":"Stimm-Fervour","description":"The bearer is eligible to declare a charge in a turn in which it Advanced.","cost":"0"},{"name":"Blood-Drenched Champion","description":"In the Battle-shock step of your opponent’s Command phase, for each enemy unit that is below its Starting Strength and is within Engagement Range of the bearer, that unit must take a Battle-shock test. If that enemy unit is also Below Half-strength, subtract 1 from that test. This Enhancement cannot cause a unit to take two Battle-shock tests in the same phase.","cost":"0"}],"stratagems":[{"name":"HYPERAGILITY","type":"Ship-killer Cult – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent's Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One WYcH CULT unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll and subtract 1 from the Wound roll."},{"name":"NO OBSTACLE","type":"Ship-killer Cult – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Charge phase","description":"WHEN: Your Charge phase. TARGET: One WYCH CULT unit from your army that opened a Hatchway this turn. EFFECT: Until the end of the phase, your unit can declare a charge that includes one or more targets that are not visible to it, provided each of those units that are not visible to it are wholly on the opposite side of that Hatchway from your unit."},{"name":"TOYING WITH THE PREY","type":"Ship-killer Cult – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a WYcH CULT unit from your army has fought. TARGET: That WYCH CULT unit. EFFECT: If your unit destroyed one or more enemy models this phase, select one of those enemy models. Until the end of your opponent’s next turn, subtract 1 from the Objective Control characteristic of models in that enemy model's unit (to a minimum of l)."},{"name":"PHANTASM GRENADES","type":"Ship-killer Cult – Wargear Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a WYcH CULT unit from your army ends a Normal move, before any enemy units fire Overwatch. TARGET: That WYCH CULT unit. EFFECT: Select one enemy unit within 9\" of and visible to your unit. That enemy unit must take a Battle-shock test, subtracting 1 from the result: if failed, until the end of the turn, that enemy unit cannot fire Overwatch."}]},{"name":"Skysplinter Assault","rules":[{"name":"Rain Of Cruelty","description":"Each time a Drukhari unit from your army disembarks from a Transport, until the end of the turn: Ranged weapons equipped by models in that disembarking unit have the [ignores cover] ability.Melee weapons equipped by models in that disembarking unit have the [lance] ability."}],"enhancements":[{"name":"Phantasmal Smoke","description":"DRUKHARI model only. While the bearer’s unit is wholly within 6\" of a friendly Drukhari Transport: Models in the bearer’s unit have the Stealth ability.Each time a ranged attack targets the bearer’s unit, models in that unit have the Benefit of Cover against that attack.","cost":"15"},{"name":"Sadistic Fulcrum","description":"DRUKHARI model only. Each time you spend 1 Pain token to Empower the bearer’s unit in the Shooting phase, select one friendly Drukhari Transport within 6\" of the bearer’s unit; until the end of the phase, each time that TRANSPORT makes an attack, you can re-roll the Hit roll.","cost":"15"},{"name":"Spiteful Raider","description":"DRUKHARI model only. Each time the bearer’s unit destroys an enemy unit in the Fight phase, if that enemy unit was within range of one or more objective markers when the bearer’s unit was selected to fight, you gain 1 additional Pain token.","cost":"10"},{"name":"Nightmare Shroud","description":"DRUKHARI model only. Each time the bearer’s unit disembarks from a Transport, until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at the bearer’s unit.","cost":"20"}],"stratagems":[{"name":"SKYBORNE ANNIHILATION","type":"Skysplinter Assault – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Drukhari unit from your army that has not been selected to shoot this phase and that disembarked from a Transport this turn. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [SUSTAINED HITS 1] ability, or the [SUSTAINED HITS 2] ability if your unit is a Kabalite Warriors or Hand of the Archon unit."},{"name":"SWOOPING MOCKERY","type":"Skysplinter Assault – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move. TARGET: One Drukhari Transport from your army that is within 9\" of that enemy unit. EFFECT: Your TRANSPORT can make a Normal move of up to 6\"."},{"name":"VICIOUS BLADES","type":"Skysplinter Assault – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a Drukhari Transport from your army has selected its targets. TARGET: That TRANSPORT. EFFECT: After your TRANSPORT has fought, select one enemy unit that was the target of one or more of those attacks and roll one D6 for each model embarked within your TRANSPORT, adding 1 to the result if that embarked model is a Wracks model: for each 5+, that enemy unit suffers 1 mortal wound (to a maximum of 6 mortal wounds)."},{"name":"WRAITHLIKE RETREAT","type":"Skysplinter Assault – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: End of the Fight phase. TARGET: One Drukhari Infantry unit from your army that fought this phase. EFFECT: Your unit can make a Normal or Fall Back move, but unless it is a Wyches unit, it must end that move wholly within 3\" horizontally and 5\" vertically of a friendly Drukhari Transport and must embark within that TRANSPORT at the end of that move (otherwise, it cannot make that move)."},{"name":"POUNCE ON THE PREY","type":"Skysplinter Assault – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a Drukhari Infantry unit from your army disembarks from a Transport that made a Normal move this phase. TARGET: That INFANTRY unit. EFFECT: Until the end of the turn, your unit is eligible to declare a charge."},{"name":"NIGHT SHIELD","type":"Skysplinter Assault – Wargear Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Drukhari Vehicle unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have a 4+ invulnerable save."}]},{"name":"Space Lane Raiders","rules":[{"name":"Commorrite Rivalries","description":"Each time a DRUKHARi CHARACTER model from your army destroys an enemy CHARACTER unit, you gain 1 Pain token. In addition, each time you use the Battlefield Command Stratagem, you can expend 1 Pain token from your Pain token pool. If you do, decrease that Stratagems cost by 1CP for that usage."}],"enhancements":[{"name":"Power and Greed","description":"The first time in each turn that the bearer is Empowered, roll one D6: on a 3+, you gain 1 Pain token.","cost":"0"},{"name":"Spiteful Demise","description":"When the bearer is destroyed, if it has not fought this phase, roll one D6: on a 2+, do not remove it from play. The bearer can fight after the attacking unit has finished making its attacks, and is then removed from play.","cost":"0"}],"stratagems":[{"name":"CREW-THIEVES","type":"Space Lane Raiders – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One WRAcKS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [ANTI-INFANTRY 3+] ability."},{"name":"SHIPBOARD SHADES","type":"Space Lane Raiders – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One DRUKHARI unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"VOIDSHIP GLADIATORS","type":"Space Lane Raiders – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One WYcHES unit from your army that has not been selected to move this phase. EFFECT: Roll one D6: on a 2+, until the end of the turn, enemy units cannot fire Overwatch at your unit."},{"name":"VETERAN PIRATES","type":"Space Lane Raiders – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase, just after a KABALITE WARRIORS unit from your army has shot. TARGET: That KABALITE WARRIORS unit. EFFECT: Your unit can make a Normal move of up to 3\"."}]},{"name":"Spectacle of Spite","rules":[{"name":"Combat Drugs","description":"At the start of your Command phase, select which Combat Drugs will be active for your army until the start of your next Command phase. To do so, either select one from the list below (you cannot select the same Combat Drug more than once per battle), or randomly select two by rolling two D6. When doing so randomly, Combat Drugs you have previously selected can become active again, but if you randomly select one that is already active for your army, it has no additional effect. 1. Adrenalight Add 1 to the Attacks characteristic of melee weapons equipped by Wych Cult models from your army. 2. Hypex Add 2\" to the Move characteristic of WYCH CULT models from your army. 3. Serpentin Improve the Weapon Skill characteristic of melee weapons equipped by WYCH CULT models from your army by 1. 4. Painbringer Add 1 to the Toughness characteristic of WYCH CULT models from your army. 5. Grave Lotus Add 1 to the Strength characteristic of melee weapons equipped by WYCH CULT models from your army. 6. Splintermind Improve the Leadership characteristic of WYCH CULT models from your army by 1, and improve the Ballistic Skill characteristic of ranged weapons equipped by WYCH CULT models from your army by 1."}],"enhancements":[{"name":"Pharmacophex","description":"Succubus model only. At the start of your Command phase, after selecting which Combat Drugs will be active for your army, roll one D6 and consult the Combat Drugs list. The result rolled applies to the bearer’s unit until the start of your next Command phase in addition to any other Combat Drugs that are active for your army. If you randomly select one that is already active for your army, it has no additional effect.","cost":"15"},{"name":"Chronoshard","description":"Succubus model only. Once per battle, at the start of the Fight phase, the bearer can use this Enhancement. If it does, until the end of the phase, models in the bearer’s unit have the Fights First ability.","cost":"15"},{"name":"Periapt of Torments","description":"Succubus model only. Enemy units cannot use the Fire Overwatch Stratagem to shoot at the bearer’s unit.","cost":"25"},{"name":"Morghenna’s Curse","description":"Succubus model only. Improve the Armour Penetration and Damage characteristics of the bearers melee weapons by 1.","cost":"20"}],"stratagems":[{"name":"DEADLY DEBUT","type":"Spectacle of Spite – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One DRUKHARI unit from your army that made a Charge move this turn and has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [LETHAL HITS] ability. If your unit is a Wyches unit, until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1 as well."},{"name":"ACROBATIC DISPLAY","type":"Spectacle of Spite – Battle Tactic Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Wych Cult unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have a 5+ invulnerable save."},{"name":"A CHALLENGE MET","type":"Spectacle of Spite – Battle Tactic Stratagem","cost":"2","when":"Opponent’s turn – Movement phase","description":"WHEN: End of your opponent’s Movement phase. TARGET: One WYCH CULT unit from your army that would be able to declare a charge if it were your Charge phase. EFFECT: Select one enemy unit within 9\" of your unit that was set up on the battlefield this phase or that ended a Normal or Advance move this phase. Your unit now declares a charge that targets only that enemy unit, and you resolve that charge. RESTRICTIONS: Even if that charge is successful, your unit does not receive any Charge bonus this turn."},{"name":"BERSERK FUGUE","type":"Spectacle of Spite – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Wych Cult unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, do not remove it from play. The destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play."},{"name":"FEIGNED WEAKNESS","type":"Spectacle of Spite – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a Drukhari unit from your army Falls Back. TARGET: That DRUKHARI unit. EFFECT: Until the end of the turn, your unit is eligible to shoot and declare a charge in turn in which it Fell Back."},{"name":"PRETERNATURAL AGILITY","type":"Spectacle of Spite – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement or Charge phase","description":"WHEN: Start of your Movement or Charge phase. TARGET: One Wych Cult unit from your army. EFFECT: Until the end of the phase, each time your unit makes a Normal, Advance or Charge move, you can ignore any or all modifiers to its Move characteristic and to Advance and Charge rolls made for it and, until the end of the turn, each time a model in your unit makes such a move, it can move horizontally through models (when doing so, such a model can move within Engagement Range of such models but cannot end a Normal or Advance move within Engagement Range of them)."}]}],"datasheets":[{"id":"000000634","name":"Archon","role":"Characters","loadout":"This model is equipped with: splinter pistol; huskblade; shadowfield.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Archon","m":"7\"","t":"3","sv":"4+","invSv":"2","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-3","d":"D3","desc":"pistol"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Agoniser","type":"Melee","profiles":[{"name":"Agoniser","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]},{"name":"Huskblade","type":"Melee","profiles":[{"name":"Huskblade","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"3","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Master-crafted power weapon","type":"Melee","profiles":[{"name":"Master-crafted power weapon","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"4","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Hatred Eternal (Pain)","description":"In your Shooting phase or the Fight phase, when you select this model’s unit to shoot or fight, you can spend 1 Pain token to Empower that unit. While that unit is Empowered, each time a model in that unit makes an attack, you can re-roll the Hit roll.","type":"Datasheet"},{"name":"Overlord","description":"Once per battle, at the start of any phase, you can select one friendly Drukhari unit that is Battle-shocked and within 12\" of this model. That unit is no longer Battle-shocked.","type":"Datasheet"},{"name":"Devious Mastermind","description":"Once per battle round, one model from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Shadowfield","description":"You cannot re-roll invulnerable saving throws made for the bearer. The first time an invulnerable saving throw made for the bearer is failed, until the end of the battle, the bearer has no invulnerable save.","type":"Wargear"},{"name":"Soul Trap","description":"Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. The first time the bearer makes a melee attack that destroys an enemy model, after all the bearer’s attacks have been resolved, until the end of the battle, add an additional 1 to the Attacks and Strength characteristics of the bearer’s melee weapons.","type":"Wargear"}],"keywords":["Kabal","Infantry","Archon","Aeldari","Character"],"factionKeywords":["Drukhari"],"composition":["1 Archon"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000004156","000000648","000000644"],"ledBy":[]},{"id":"000000652","name":"Beastmaster","role":"Characters","loadout":"The Beastmaster is equipped with: splinter pods; agoniser. Every Clawed Fiend is equipped with: Clawed Fiend fists. Every Khymerae is equipped with: Khymerae talons. Every Razorwing Flock is equipped with: Razorwing feathers.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"BEASTMASTER","m":"12\"","t":"4","sv":"6+","invSv":"6","w":"3","ld":"7+","oc":"1"},{"name":"CLAWED FIEND","m":"12\"","t":"4","sv":"6+","invSv":"6","w":"5","ld":"8+","oc":"1"},{"name":"KHYMERAE","m":"12\"","t":"4","sv":"6+","invSv":"6","w":"2","ld":"8+","oc":"1"},{"name":"RAZORWING FLOCK","m":"12\"","t":"4","sv":"6+","invSv":"6","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Splinter pods","type":"Ranged","profiles":[{"name":"Splinter pods","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, twin-linked"}]},{"name":"Agoniser","type":"Melee","profiles":[{"name":"Agoniser","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]},{"name":"Clawed Fiend fists","type":"Melee","profiles":[{"name":"Clawed Fiend fists","range":"Melee","type":"Melee","a":"5","bsWs":"4","s":"5","ap":"-2","d":"2","desc":"devastating wounds"}]},{"name":"Khymerae talons","type":"Melee","profiles":[{"name":"Khymerae talons","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"lethal hits"}]},{"name":"Razorwing feathers","type":"Melee","profiles":[{"name":"Razorwing feathers","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"3","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Goaded Savagery (Pain)","description":"In the Fight phase, when you select this unit to fight, you can spend 1 of your Pain tokens to Empower this unit. While this unit is Empowered, if it contains a BEASTMASTER model, each time a BEAST model in this unit makes a melee attack, you can re-roll the Hit roll and you can re-roll the Wound roll.","type":"Datasheet"},{"name":"Beastmaster","description":"While this unit contains a BEASTMASTER model, you can re-roll Charge rolls made for this unit.","type":"Datasheet"}],"keywords":["Aeldari","Fly","Mounted","Character","Fly","Beastmaster","Beasts"],"factionKeywords":["Drukhari"],"composition":["1 Beastmaster","1 Clawed Fiends","2 Khymerae","3 Razorwing Flocks"],"points":[{"models":"7 models","cost":"135"}],"canLead":[],"ledBy":[]},{"id":"000004170","name":"Corsair Cloud Dancer Band","role":"Other","loadout":"Every model is equipped with: brace of pistols; twin shuriken catapult; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Corsair Cloud Dancer Band","m":"14\"","t":"4","sv":"3+","invSv":"-","w":"2","ld":"6+","oc":"2"}],"weapons":[{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 1"},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Twin shuriken catapult","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-3","d":"1","desc":"assault, twin-linked"},{"name":"Brace of pistols","range":"12","type":"Ranged","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":"assault, pistol"},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Void sabre","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null},{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+2","desc":null},{"name":"Dissonance cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"devastating wounds"},{"name":"Dissonance pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"6","ap":"-1","d":"1","desc":"devastating wounds, pistol"},{"name":"Scatter laser","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Reckless Abandon","description":"You can target this unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already used that Stratagem on a different unit this phase.","type":"Datasheet"}],"keywords":["Corsair Cloud Dancer Band","Anhrathe","Grenades","Mounted"],"factionKeywords":["Aeldari","Drukhari"],"composition":["0-1 Cloud Dancer Felarch","3-6 Corsair Cloud Dancers"],"points":[{"models":"3 models","cost":"105"},{"models":"4 models","cost":"140"},{"models":"6 models","cost":"210"},{"models":"7 models","cost":"245"}],"canLead":[],"ledBy":[]},{"id":"000004171","name":"Corsair Reaver Band","role":"Other","loadout":"Every model is equipped with: brace of pistols; Corsair firearm; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Corsair Reaver Band","m":"7\"","t":"3","sv":"5+","invSv":"-","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Shredder","type":"Ranged","profiles":[{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"},{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 1"},{"name":"Dissonance pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"6","ap":"-1","d":"1","desc":"devastating wounds, pistol"},{"name":"Flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"assault, ignores cover, torrent"},{"name":"Fusion gun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault, melta 2"},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Aeldari missile launcher – starshot","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"10","ap":"-2","d":"D6","desc":null},{"name":"Aeldari missile launcher – sunburst","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"BLAST"},{"name":"Brace of pistols","range":"12","type":"Ranged","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":"assault, pistol"},{"name":"Corsair firearm","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"4","ap":"0","d":"1","desc":"assault, lethal hits"},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"4","s":"12","ap":"-3","d":"D6+2","desc":"heavy"},{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"},{"name":"Void sabre","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null},{"name":"Spar-glaive","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Reaver Band","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, if this unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to D6\".","type":"Datasheet"},{"name":"CORSAIRS","description":"If a model from your army with the Leader ability can be attached to a Corsair Voidreavers unit, it can be attached to this unit instead.","type":"Special (правая колонка)"}],"keywords":["Infantry","Anhrathe","Aeldari","Corsair Reaver Band","Grenades"],"factionKeywords":["Asuryani","Drukhari"],"composition":["0-1 Corsair Reaver Felarch","5-10 Corsair Reavers"],"points":[{"models":"5 models","cost":"125"},{"models":"6 models","cost":"150"},{"models":"10 models","cost":"250"},{"models":"11 models","cost":"275"}],"canLead":[],"ledBy":[]},{"id":"000004172","name":"Corsair Skyreaver Band","role":"Other","loadout":"Every model is equipped with: brace of pistols; Corsair firearm; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Corsair Skyreaver Band","m":"14\"","t":"3","sv":"5+","invSv":"-","w":"3","ld":"6+","oc":"1"}],"weapons":[{"name":"Shuriken catapult","type":"Ranged","profiles":[{"name":"Shuriken catapult","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault"},{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"ASSAULT, TORRENT"},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Dissonance pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"6","ap":"-1","d":"1","desc":"devastating wounds, pistol"},{"name":"Fusion gun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault, melta 2"},{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, heavy, sustained hits 1"},{"name":"Flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"0","d":"1","desc":"assault, ignores cover, torrent"},{"name":"Aeldari missile launcher – sunburst","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"BLAST"},{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"4","s":"12","ap":"-3","d":"D6+2","desc":"heavy"},{"name":"Corsair firearm","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"4","ap":"0","d":"1","desc":"assault, lethal hits"},{"name":"Brace of pistols","range":"12","type":"Ranged","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":"assault, pistol"},{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"ASSAULT"},{"name":"Aeldari missile launcher – starshot","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"10","ap":"-2","d":"D6","desc":null},{"name":"Void sabre","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null},{"name":"Spar-glaive","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Shardcarbine","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"sustained hits 1"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Skyleap","description":"At the end of your opponent’s turn, if this unit is not within Engagement Range of one or more enemy units, you can remove this unit from the battlefield and place it into Strategic Reserves.","type":"Datasheet"}],"keywords":["Grenades","Infantry","Fly","Anhrathe","Jump Pack","Aeldari","Corsair Skyreaver Band"],"factionKeywords":["Drukhari","Asuryani"],"composition":["0-1 Corsair Skyreaver Felarch","5-10 Corsair Skyreavers"],"points":[{"models":"5 models","cost":"125"},{"models":"6 models","cost":"150"},{"models":"10 models","cost":"250"},{"models":"11 models","cost":"275"}],"canLead":[],"ledBy":[]},{"id":"000004168","name":"Corsair Voidreavers","role":"Battleline","loadout":"Every model is equipped with: shuriken pistol; power sword; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Corsair Voidreavers","m":"7\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"lethal hits"},{"name":"Shuriken pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, pistol"},{"name":"Wraithcannon","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":null},{"name":"Shuriken rifle","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, rapid fire 1"},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Power sword","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null},{"name":"Neuro disruptor","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+, assault, pistol"},{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Reavers of the Void","description":"Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target of that attack is within range of an objective marker, you can re-roll the Hit roll instead.","type":"Datasheet"},{"name":"Mistshield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"}],"keywords":["Anhrathe","Battleline","Aeldari","Grenades","Infantry","Corsair Voidreavers"],"factionKeywords":["Drukhari","Asuryani"],"composition":["1 Voidreaver Felarch","4-9 Corsair Voidreavers"],"points":[{"models":"5 models","cost":"65"},{"models":"10 models","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000004169","name":"Corsair Voidscarred","role":"Other","loadout":"Every Corsair Voidscarred and Voidscarred Felarch is equipped with: shuriken pistol; power sword; close combat weapon. A Shade Runner is equipped with: shuriken pistol; paired Hekatarii blades. A Soul Weaver is equipped with: shuriken pistol; power sword; channeller stones. A Way Seeker is equipped with: shuriken pistol; Executioner; witch staff.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Corsair Voidscarred","m":"7\"","t":"3","sv":"4+","invSv":"-","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Paired Hekatarii blades","type":"Melee","profiles":[{"name":"Paired Hekatarii blades","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"3","ap":"-2","d":"1","desc":"twin-linked"},{"name":"Power sword","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null},{"name":"Witch staff","range":"Melee","type":"Melee","a":"2","bsWs":"2","s":"3","ap":"0","d":"D3","desc":"anti-infantry 2+, psychic"},{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"},{"name":"Executioner","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-2","d":"D3","desc":"anti-infantry 2+, psychic"},{"name":"Long rifle","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"2","desc":"heavy, precision"},{"name":"Neuro disruptor","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+, assault, pistol"},{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"lethal hits"},{"name":"Shuriken pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, pistol"},{"name":"Shuriken rifle","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, rapid fire 1"},{"name":"Wraithcannon","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":null},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Fusion pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6","desc":"assault, melta 2, pistol"}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Piratical Raiders","description":"At the start of the battle, select one unit from your opponent’s army. Weapons equipped by models in this unit have the [LETHAL HITS] and [PRECISION] abilities while targeting that unit.","type":"Datasheet"},{"name":"Channeller Stones","description":"Once per turn, the first time a saving throw is failed for the bearer’s unit, change the Damage characteristic of that attack to 0.","type":"Wargear"},{"name":"Faolchú","description":"Ranged weapons equipped by models in the bearer’s unit have the [IGNORES COVER] ability.","type":"Wargear"},{"name":"Mistshield","description":"The bearer has a 4+ invulnerable save.","type":"Wargear"}],"keywords":["Infantry","Aeldari","Grenades","Anhrathe","Corsair Voidscarred","Psyker"],"factionKeywords":["Drukhari","Asuryani"],"composition":["This unit can contain a maximum of 10 models.","1 Voidscarred Felarch","4-9 Corsair Voidscarred","0-1 Shade Runner","0-1 Soul Weaver","0-1 Way Seeker"],"points":[{"models":"5 models","cost":"80"},{"models":"10 models","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000002471","name":"Court of the Archon","role":"Other","loadout":"A Lhamaean is equipped with: shaimeshi blade. A Medusae is equipped with: eyeburst; close combat weapon. A Sslyth is equipped with: shardcarbine; splinter pistol; Sslyth battle-blade. An Ur-ghul is equipped with: Ur-ghul talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Court Of The Archon","m":"7\"","t":"3","sv":"5+","invSv":"5","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Eyeburst","type":"Ranged","profiles":[{"name":"Eyeburst","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-2","d":"1","desc":"pistol, torrent"}]},{"name":"Shardcarbine","type":"Ranged","profiles":[{"name":"Shardcarbine","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Shaimeshi blade","type":"Melee","profiles":[{"name":"Shaimeshi blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+"}]},{"name":"Sslyth battle-blade","type":"Melee","profiles":[{"name":"Sslyth battle-blade","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Ur-ghul talons","type":"Melee","profiles":[{"name":"Ur-ghul talons","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Deadly Retinue (Pain)","description":"At the start of your Shooting phase or at the start of the Fight phase, you can spend 1 Pain token to Empower this unit. While this unit is Empowered: If it contains one or more Lhamaean models, melee weapons equipped by models in this unit have the [LETHAL HITS] ability.If it contains one or more Medusae models, ranged weapons equipped by models in this unit have the [IGNORES COVER] ability.If it contains one or more Sslyth models, each time a melee attack targets this unit, subtract 1 from the Wound roll.If this unit contains one or more Ur-ghul models, this unit has the Fights First ability.","type":"Datasheet"},{"name":"Court of the Archon","description":"While a CHARACTER model is leading a unit that contains one or more Lhamaean, Medusae, Sslyth and/or Ur-ghul models, that CHARACTER model has the Feel No Pain 4+ ability.","type":"Datasheet"},{"name":"COURT OF THE ARCHON","description":"This unit can be led by an Archon. Alternatively, in the Declare Battle Formations step, this unit can join one Kabalite Warriors or Hand of the Archon unit from your army that is being led by an ARCHON (a unit cannot have more than one COURT OF THE ARCHON unit joined to it). If it does, until the end of the battle, every model in this unit counts as part of that KABALITE WARRIORS or HAND OF THE ARCHON unit, and its Starting Strength is increased accordingly.","type":"Fortification (левая колонка)"}],"keywords":["Aeldari","Kabal","Infantry","Court of the Archon"],"factionKeywords":["Drukhari"],"composition":["1 Lhamaean","1 Medusae","1 Sslyth","1 Ur-ghul"],"points":[{"models":"4 models","cost":"95"}],"canLead":[],"ledBy":[]},{"id":"000000664","name":"Cronos","role":"Other","loadout":"Every Cronos is equipped with: spirit syphon; spirit-leech tentacles.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Cronos","m":"7\"","t":"7","sv":"3+","invSv":"6","w":"7","ld":"7+","oc":"2"}],"weapons":[{"name":"Spirit syphon","type":"Ranged","profiles":[{"name":"Spirit syphon","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Spirit vortex","type":"Ranged","profiles":[{"name":"Spirit vortex","range":"18","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"blast, ignores cover"}]},{"name":"Spirit-leech tentacles","type":"Melee","profiles":[{"name":"Spirit-leech tentacles","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"anti-infantry 2+"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Pain Parasite (Pain)","description":"In your Shooting phase or the Fight phase, when you select this unit to shoot or fight, you can spend 1 Pain token to Empower this unit. While Empowered, each time this unit shoots or fights, after it has resolved its attacks, if one or more enemy models were destroyed as a result of those attacks, one model in this unit regains up to 3 lost wounds (if all models in this unit have their starting number of wounds and this unit is below its Starting Strength, 1 model is returned to this unit with 3 wounds remaining).","type":"Datasheet"},{"name":"Pain Engine (Aura)","description":"Each time you spend 1 Pain token to Empower a friendly unit within 9\" of this unit, roll one D6, adding 1 to the result if one or more models in this unit are not equipped with a spirit vortex: on a 5+, you gain 1 Pain token. Designer’s Note: Pain tokens you spend for reasons other than Empowering a unit do not trigger this ability.","type":"Datasheet"}],"keywords":["Haemonculus Covens","Monster","Fly","Cronos","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1-2 Cronos"],"points":[{"models":"1 model","cost":"55"},{"models":"2 models","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000004158","name":"Death Jester","role":"Characters","loadout":"This model is equipped with: shrieker cannon; Jester’s blade; flip belt.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Death Jester","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Jester’s blade","type":"Melee","profiles":[{"name":"Jester’s blade","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"0","d":"1","desc":null},{"name":"Shrieker cannon","range":"24","type":"Ranged","a":"3","bsWs":"2","s":"6","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Death is Not Enough","description":"In your Shooting phase, after this model has shot, select one enemy unit (excluding MONSTERS and VEHICLES) hit by one or more of those attacks. That enemy unit must take a Battle-shock test. If one or more of those attacks destroyed a model in that enemy unit, subtract 1 from that test.","type":"Datasheet"},{"name":"Cruel Amusement","description":"In your Shooting phase, each time this model is selected to shoot, select one of the abilities below. Until the end of the phase, this model’s shrieker cannon has that ability. [IGNORES COVER][PRECISION][SUSTAINED HITS 3]","type":"Datasheet"},{"name":"Flip Belt","description":"Each time the bearer’s unit makes a Normal, Advance, Fall Back or Charge move, ignore any vertical distance when determining the total distance the bearer can be moved during that move.","type":"Wargear"},{"name":"TRAVELLING PLAYERS","description":"Unless otherwise stated, you cannot include more than one of this model in your army.","type":"Fortification (левая колонка)"}],"keywords":["Death Jester","Infantry","Character","Aeldari"],"factionKeywords":["Drukhari","Harlequins"],"composition":["1 Death Jester"],"points":[{"models":"1 model","cost":"90"}],"canLead":[],"ledBy":[]},{"id":"000000643","name":"Drazhar","role":"Characters","loadout":"This model is equipped with: Executioner’s demiklaives.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Drazhar","m":"7\"","t":"3","sv":"2+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Executioner’s demiklaives – single blade","type":"Melee","profiles":[{"name":"Executioner’s demiklaives – single blade","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"6","ap":"-2","d":"3","desc":"devastating wounds"}]},{"name":"Executioner’s demiklaives – dual blades","type":"Melee","profiles":[{"name":"Executioner’s demiklaives – dual blades","range":"Melee","type":"Melee","a":"8","bsWs":"2","s":"5","ap":"-2","d":"2","desc":"devastating wounds"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Master of Blades (Pain)","description":"In the Fight phase, when you select this model’s unit to fight, you can spend 1 Pain token to Empower that unit. While that unit is Empowered, each time a model in that unit makes a melee attack, add 1 to the Wound roll.","type":"Datasheet"},{"name":"Onslaught","description":"While this model is leading a unit, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".","type":"Datasheet"},{"name":"Silent Executioner","description":"Each time this model makes an attack that targets a unit that is below its Starting Strength, you can re-roll the Hit roll. If that target is Below Half-strength, you can re-roll the Wound roll as well.","type":"Datasheet"}],"keywords":["Aeldari","Character","Infantry","Epic Hero","Drazhar","Blades for Hire"],"factionKeywords":["Drukhari"],"composition":["1 Drazhar – EPIC HERO"],"points":[{"models":"1 model","cost":"85"}],"canLead":["000000648"],"ledBy":[]},{"id":"000000651","name":"Grotesques","role":"Other","loadout":"Every model is equipped with: paired monstrous weapons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Grotesques","m":"7\"","t":"5","sv":"6+","invSv":"6","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Liquifier gun","type":"Ranged","profiles":[{"name":"Liquifier gun","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"anti-infantry 3+, torrent"}]},{"name":"Monstrous weapons","type":"Melee","profiles":[{"name":"Monstrous weapons","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Paired monstrous weapons","type":"Melee","profiles":[{"name":"Paired monstrous weapons","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"twin-linked"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Macro-steroids (Pain)","description":"In the Fight phase, when you select this unit to fight, you can spend 1 of your Pain tokens to Empower this unit. While Empowered, melee weapons equipped by models in this unit have a Strength characteristic of 8 and the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Monstrous Charge","description":"Each time this unit ends a Charge move, select one enemy unit within Engagement Range of it, then roll one D6 for each model in this unit that is within Engagement Range of that enemy unit: for each 4+, that enemy unit suffers D3 mortal wounds.","type":"Datasheet"},{"name":"MONSTROUS HULKS","description":"This unit cannot embark within a Venom, but it can embark within other Drukhari Transports; when doing so, each Grotesque model takes up the space of 3 models.","type":"Fortification (левая колонка)"}],"keywords":["Grotesques","Infantry","Haemonculus Covens","Aeldari"],"factionKeywords":["Drukhari"],"composition":["3-6 Grotesques"],"points":[{"models":"3 models","cost":"80"},{"models":"6 models","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000641","name":"Haemonculus","role":"Characters","loadout":"This model is equipped with: stinger pistol; Haemonculus tools and scissorhands.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Haemonculus","m":"7\"","t":"4","sv":"5+","invSv":"6","w":"5","ld":"7+","oc":"1"}],"weapons":[{"name":"Stinger pistol","type":"Ranged","profiles":[{"name":"Stinger pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"2","ap":"-1","d":"D3","desc":"anti-infantry 2+, pistol, precision"}]},{"name":"Haemonculus tools and scissorhands","type":"Melee","profiles":[{"name":"Haemonculus tools and scissorhands","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"3","ap":"-1","d":"D3","desc":"anti-infantry 2+, precision"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Fleshcraft (Pain)","description":"In your Command phase, you can spend 1 Pain token to Empower this model’s unit. Each time you do, you can return up to D3+1 destroyed Bodyguard models to that unit.","type":"Datasheet"},{"name":"Fear Incarnate (Aura)","description":"While an enemy unit is within 6\" of this model, worsen the Leadership characteristic of models in that unit by 1. In addition, in the Battle-shock step of your opponent’s Command phase, if such an enemy unit is below its Starting Strength, it must take a Battle-shock test.","type":"Datasheet"},{"name":"Pain Adept","description":"In your Command phase, if one or more models from your army with this ability are on the battlefield, roll one D6: on a 4+, you gain 1 Pain token.","type":"Datasheet"}],"keywords":["Haemonculus","Aeldari","Haemonculus Covens","Infantry","Character"],"factionKeywords":["Drukhari"],"composition":["1 Haemonculus"],"points":[{"models":"1 model","cost":"70"}],"canLead":["000000650"],"ledBy":[]},{"id":"000004156","name":"Hand of the Archon","role":"Other","loadout":"Every model is equipped with: splinter rifle; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hand of the Archon","m":"7\"","t":"3","sv":"4+","invSv":"6","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"D3","desc":"pistol"}]},{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"}]},{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"4","s":"12","ap":"-3","d":"D6+2","desc":"heavy"}]},{"name":"Shardcarbine","type":"Ranged","profiles":[{"name":"Shardcarbine","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Shredder","type":"Ranged","profiles":[{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"}]},{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, heavy, sustained hits 1"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Splinter rifle","type":"Ranged","profiles":[{"name":"Splinter rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Stinger pistol","type":"Ranged","profiles":[{"name":"Stinger pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 2+, pistol"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Pain sculptors","type":"Melee","profiles":[{"name":"Pain sculptors","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"anti-infantry 4+, twin-linked"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]},{"name":"Razorflail","type":"Melee","profiles":[{"name":"Razorflail","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Assassins’ Poisons (Pain)","description":"In your Shooting phase or the Fight phase, when you select this unit to shoot or fight, you can spend 1 Pain token to Empower this unit. While Empowered, weapons equipped by models in this unit (excluding blast pistols, blasters and dark lances) have the [LETHAL HITS] and [PRECISION] abilities.","type":"Datasheet"},{"name":"Archon’s Will","description":"At the start of the first battle round, select one objective marker on the battlefield. Until the end of the battle, while this unit is within range of that objective marker, unless this unit is Battle-shocked, models in this unit have a 5+ invulnerable save and an Objective Control characteristic of 3.","type":"Datasheet"},{"name":"Kabalite Icon","description":"While the bearer’s unit is not Battle-shocked, add 1 to the bearer’s Objective Control characteristic.","type":"Wargear"},{"name":"Phantasm Grenade Launcher","description":"The bearer’s unit has the Smoke keyword.","type":"Wargear"},{"name":"Stimm-needler","description":"Once per turn, the first time a saving throw is failed for a model in the bearer’s unit, change the Damage characteristic of that attack to 0.","type":"Wargear"},{"name":"ARCHON’S RETINUE","description":"If this unit has a Leader unit attached to it during the Declare Battle Formations step, that Leader unit gains the Scouts 7\" ability.","type":"Special (правая колонка)"}],"keywords":["Kabal","Infantry","Grenades","Hand of the Archon","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Kabalite Archsybarite","9 Kabalite Agents"],"points":[{"models":"10 models","cost":"125"}],"canLead":[],"ledBy":["000000634","000004155"]},{"id":"000000659","name":"Hellions","role":"Other","loadout":"Every model is equipped with: splinter pods; hellglaive.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hellions","m":"14\"","t":"4","sv":"4+","invSv":"6","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Splinter pods","type":"Ranged","profiles":[{"name":"Splinter pods","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, twin-linked"}]},{"name":"Hellglaive","type":"Melee","profiles":[{"name":"Hellglaive","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"4","ap":"-1","d":"2","desc":"lance, sustained hits 1"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+, lance, sustained hits 1"}]},{"name":"Stunclaw","type":"Melee","profiles":[{"name":"Stunclaw","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-1","d":"1","desc":"devastating wounds, lance, precision"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Battlefield Butchery (Pain)","description":"In the Fight phase, when you select this unit to fight, you can spend 1 Pain token to Empower this unit. While Empowered, add 1 to the Attacks and Strength characteristics of this unit’s melee weapons.","type":"Datasheet"},{"name":"Skyboard Evasion","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, this unit can make a Normal move of up to D6\".","type":"Datasheet"},{"name":"Phantasm Grenade Launcher","description":"The bearer’s unit has the Smoke and Grenades keywords.","type":"Wargear"}],"keywords":["Mounted","Fly","Aeldari","Hellions","Wych Cult"],"factionKeywords":["Drukhari"],"composition":["1 Helliarch","4-9 Hellions"],"points":[{"models":"5 models","cost":"85"},{"models":"10 models","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000648","name":"Incubi","role":"Other","loadout":"Every model is equipped with: klaive.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"INCUBI","m":"7\"","t":"3","sv":"3+","invSv":"5","w":"1","ld":"6+","oc":"1"},{"name":"KLAIVEX","m":"7\"","t":"3","sv":"3+","invSv":"5","w":"2","ld":"6+","oc":"1"}],"weapons":[{"name":"Demiklaives – single blade","type":"Melee","profiles":[{"name":"Demiklaives – single blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Demiklaives – dual blades","type":"Melee","profiles":[{"name":"Demiklaives – dual blades","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"twin-linked"}]},{"name":"Klaive","type":"Melee","profiles":[{"name":"Klaive","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Decapitating Strikes (Pain)","description":"In the Fight phase, when you select this unit to fight, you can spend 1 Pain token to Empower this unit. While Empowered, each time a model in this unit makes a melee attack that targets an INFANTRY unit, that attack has the [DEVASTATING WOUNDS] ability.","type":"Datasheet"},{"name":"Tormentors","description":"At the start of the Fight phase, each enemy unit within Engagement Range of one or more units with this ability must take a Battle-shock test. Each time a model in this unit makes a melee attack that targets a Battle-shocked unit, add 1 to the Hit roll.","type":"Datasheet"},{"name":"Incubi Shrine Token","description":"Once per battle for each Incubi Shrine token this unit has, you can change the result of one Hit roll or one Wound roll made for a Klaivex or Incubi model in this unit to an unmodified 6. Designer's Note: Place an Incubi Shrine token next to the unit for each Incubi Shrine token it has, removing one each time this ability is used.","type":"Wargear"}],"keywords":["Infantry","Aeldari","Blades for Hire","Incubi"],"factionKeywords":["Drukhari"],"composition":["1 Klaivex","4-9 Incubi"],"points":[{"models":"5 models","cost":"90"},{"models":"10 models","cost":"180"}],"canLead":[],"ledBy":["000000634","000000643","000004155"]},{"id":"000000644","name":"Kabalite Warriors","role":"Battleline","loadout":"Every model is equipped with: splinter rifle; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Kabalite Warriors","m":"7\"","t":"3","sv":"4+","invSv":"6","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"D3","desc":"pistol"}]},{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"}]},{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"4","s":"12","ap":"-3","d":"D6+2","desc":"heavy"}]},{"name":"Shredder","type":"Ranged","profiles":[{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"}]},{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, heavy, sustained hits 1"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Splinter rifle","type":"Ranged","profiles":[{"name":"Splinter rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Sadistic Raiders (Pain)","description":"In your Shooting phase or the Fight phase, when you select this unit to shoot or fight, you can spend 1 Pain token to Empower this unit. While Empowered, each time a model in this unit makes an attack, re-roll a Wound roll of 1. If the target is within range of an objective marker, you can re-roll the Wound roll instead.","type":"Datasheet"},{"name":"Cruel Enforcers","description":"At the end of your Command phase, if this unit is within range of an objective marker you control, that objective marker remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase.","type":"Datasheet"},{"name":"Kabalite Icon","description":"While the bearer’s unit is not Battle-shocked, add 1 to the bearer’s Objective Control characteristic.","type":"Wargear"},{"name":"Phantasm Grenade Launcher","description":"The bearer’s unit has the Smoke and Grenades keywords.","type":"Wargear"}],"keywords":["Kabalite Warriors","Infantry","Kabal","Battleline","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Sybarite","9 Kabalite Warriors"],"points":[{"models":"10 models","cost":"115"}],"canLead":[],"ledBy":["000000634","000004155"]},{"id":"000004155","name":"Lady Malys","role":"Characters","loadout":"This model is equipped with: Lady’s Blade; razor fan.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Lady Malys","m":"7\"","t":"3","sv":"4+","invSv":"4","w":"5","ld":"6+","oc":"2"}],"weapons":[{"name":"Lady’s Blade","type":"Melee","profiles":[{"name":"Lady’s Blade","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"5","ap":"-3","d":"3","desc":"devastating wounds, hazardous"}]},{"name":"Razor fan","type":"Melee","profiles":[{"name":"Razor fan","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"3","ap":"0","d":"1","desc":"extra attacks"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Archon of the Poisoned Tongue (Pain)","description":"In your Shooting phase or the Fight phase, when you select this model’s unit to shoot or fight, you can spend 1 Pain token to Empower that unit. If you do, select one of the following abilities: [SUSTAINED HITS 1]; [LETHAL HITS]. Until the end of the phase, while that unit is Empowered, weapons equipped by models in that unit have that selected ability.","type":"Datasheet"},{"name":"Precognisant","description":"If your army includes this model, after both players have deployed their armies, select up to three Drukhari units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.","type":"Datasheet"},{"name":"Mind Like a Steel Trap (Aura)","description":"Each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this model, increase the cost of that use of that Stratagem by 1CP.","type":"Datasheet"}],"keywords":["Character","Kabal","Lady Malys","Epic Hero","Archon","Aeldari","Infantry"],"factionKeywords":["Drukhari"],"composition":["1 Lady Malys – EPIC HERO"],"points":[{"models":"1 model","cost":"100"}],"canLead":["000004156","000000648","000000644"],"ledBy":[]},{"id":"000000640","name":"Lelith Hesperax","role":"Characters","loadout":"This model is equipped with: Lelith’s blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Lelith Hesperax","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Lelith’s blades","type":"Melee","profiles":[{"name":"Lelith’s blades","range":"Melee","type":"Melee","a":"8","bsWs":"2","s":"3","ap":"-2","d":"1","desc":"anti-infantry 2+, precision, sustained hits 2"}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Brides of Death (Pain)","description":"In the Fight phase, when you select this model’s unit to fight, you can spend 1 Pain token to Empower that unit. While that unit is Empowered, each time a model in that unit makes a melee attack, improve the Strength and Armour Penetration characteristics of that attack by 1.","type":"Datasheet"},{"name":"Blur of Blades","description":"While this model is leading a unit, models in that unit have the Fights First ability.","type":"Datasheet"},{"name":"Thrilling Spectacle","description":"Once per battle, at the start of the Fight phase, this model can use this ability. If it does, until the end of the phase, this model has a 3+ invulnerable save and change the Attacks characteristic of melee weapons equipped by this model to 12.","type":"Datasheet"}],"keywords":["Wych Cult","Lelith Hesperax","Succubus","Aeldari","Epic Hero","Character","Infantry"],"factionKeywords":["Drukhari"],"composition":["1 Lelith Hesperax – EPIC HERO"],"points":[{"models":"1 model","cost":"85"}],"canLead":["000000646"],"ledBy":[]},{"id":"000000649","name":"Mandrakes","role":"Other","loadout":"Every model is equipped with: baleblast; glimmersteel blade.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Mandrakes","m":"8\"","t":"3","sv":"7+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Baleblast","type":"Ranged","profiles":[{"name":"Baleblast","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"assault, devastating wounds, ignores cover"}]},{"name":"Glimmersteel blade","type":"Melee","profiles":[{"name":"Glimmersteel blade","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Fade Away (Pain)","description":"At the end of your opponent’s Fight phase, if this unit is not within Engagement Range of one or more enemy units, you can spend 1 Pain token to Empower this unit. Each time you do, remove this unit from the battlefield and place it into Strategic Reserves.","type":"Datasheet"},{"name":"Shade Weavers","description":"This unit cannot be targeted by ranged attacks unless the attacking model is within 18\".","type":"Datasheet"}],"keywords":["Infantry","Blades for Hire","Aeldari","Mandrakes"],"factionKeywords":["Drukhari"],"composition":["1 Nightfiend","4-9 Mandrakes"],"points":[{"models":"5 models","cost":"75"},{"models":"10 models","cost":"150"}],"canLead":[],"ledBy":[]},{"id":"000000656","name":"Raider","role":"Dedicated Transports","loadout":"This model is equipped with: dark lance; bladevanes and chainsnares.","transport":"This model has a transport capacity of 11 Drukhari Infantry models (excluding Jump Pack models).","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Raider","m":"14\"","t":"8","sv":"4+","invSv":"6","w":"10","ld":"7+","oc":"2"}],"weapons":[{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+2","desc":null}]},{"name":"Disintegrator cannon","type":"Ranged","profiles":[{"name":"Disintegrator cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-3","d":"2","desc":null}]},{"name":"Bladevanes and chainsnares","type":"Melee","profiles":[{"name":"Bladevanes and chainsnares","range":"Melee","type":"Melee","a":"D3+3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Splinter Racks (Pain)","description":"In your Shooting phase, when you select this model to shoot, you can spend 1 Pain token to Empower this model. While Empowered, if one or more units are embarked within this model, each time this model makes an attack with a ranged weapon that has the [ANTI] ability, you can re-roll the Hit roll.","type":"Datasheet"},{"name":"Vanguard of the Dark City","description":"At the start of your Command phase, select one of the abilities in the Vanguard of the Dark City section (see above) for this model. Until the start of your next Command phase, this model has that ability.","type":"Datasheet"},{"name":"Masters of the Shadowed Sky","description":"At the end of your Command phase, if this model is within range of an objective marker you control, and if one or more Kabalite Warriors units are embarked within it, that objective marker remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase.","type":"Primarch"},{"name":"Speed of the Kill","description":"Each time a Wyches unit disembarks from this model (excluding Emergency Disembarkations), models in that WYCHES unit must be set up wholly within 6\" of this model.","type":"Primarch"},{"name":"Visions of Butchery","description":"While one or more Wracks units are embarked within this model, for each WRACKS model embarked within this model, add 1 to the Attacks characteristic of this model’s bladevanes and chainsnares.","type":"Primarch"},{"name":"Aethersails","description":"While one or more Drukhari units are embarked within this model, you can re-roll Advance and Charge rolls made for this model.","type":"Primarch"}],"keywords":["Dedicated Transport","Fly","Raider","Aeldari","Vehicle","Transport"],"factionKeywords":["Drukhari"],"composition":["1 Raider"],"points":[{"models":"1 model","cost":"85"}],"canLead":[],"ledBy":[]},{"id":"000000665","name":"Ravager","role":"Other","loadout":"This model is equipped with: 3 dark lances; bladevanes.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time it makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Ravager","m":"14\"","t":"9","sv":"4+","invSv":"6","w":"11","ld":"7+","oc":"3"}],"weapons":[{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+2","desc":null}]},{"name":"Disintegrator cannon","type":"Ranged","profiles":[{"name":"Disintegrator cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-3","d":"2","desc":null}]},{"name":"Bladevanes","type":"Melee","profiles":[{"name":"Bladevanes","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Agonising Suppression (Pain)","description":"In your Shooting phase, when you select this model to shoot, you can spend 1 Pain token to Empower this model. While Empowered, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the start of your next turn, that enemy unit is suppressed. While a unit is suppressed, each time a model in that unit makes an attack, subtract 1 from the Hit roll.","type":"Datasheet"},{"name":"Eradicate the Foe","description":"Each time this model makes an attack that targets an enemy unit that is at its Starting Strength, you can re-roll the Hit roll.","type":"Datasheet"}],"keywords":["Kabal","Vehicle","Fly","Aeldari","Ravager"],"factionKeywords":["Drukhari"],"composition":["1 Ravager"],"points":[{"models":"1 model","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000001390","name":"Raven Strike Fighter","role":"Other","loadout":"This model is equipped with: 2 dark lances; splinterstorm cannon; Bladed wings.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Raven Strike Fighter","m":"20+\"","t":"8","sv":"4+","invSv":"5","w":"10","ld":"7+","oc":"0"}],"weapons":[{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+2","desc":null}]},{"name":"Splinterstorm cannon","type":"Ranged","profiles":[{"name":"Splinterstorm cannon","range":"36","type":"Ranged","a":"8","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 2"}]},{"name":"Bladed wings","type":"Melee","profiles":[{"name":"Bladed wings","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Shredding Fire (Pain)","description":"In your Shooting phase, when you select this unit to shoot, you can spend 1 Pain token to Empower this unit. While Empowered, the Armour Penetration characteristic of its ranged weapons is increased by 1.","type":"Datasheet"},{"name":"Ground-attack Craft","description":"Each time a model in this unit makes a ranged attack that targets an enemy unit (excluding units that can FLY), add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Fly","Aircraft","Aeldari","Raven Strike Fighter","Vehicle"],"factionKeywords":["Drukhari"],"composition":["1 Raven Strike Fighter"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000660","name":"Razorwing Jetfighter","role":"Other","loadout":"This model is equipped with: 2 dark lances; Razorwing missiles; twin splinter rifle; bladed wings.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Razorwing Jetfighter","m":"20+\"","t":"8","sv":"4+","invSv":"6","w":"10","ld":"7+","oc":"0"}],"weapons":[{"name":"Dark Lance","type":"Ranged","profiles":[{"name":"Dark Lance","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+2","desc":null}]},{"name":"Disintegrator cannon","type":"Ranged","profiles":[{"name":"Disintegrator cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-3","d":"2","desc":null}]},{"name":"Razorwing missiles – monoscythe missiles","type":"Ranged","profiles":[{"name":"Razorwing missiles – monoscythe missiles","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"blast"}]},{"name":"Razorwing missiles – neurotoxin missiles","type":"Ranged","profiles":[{"name":"Razorwing missiles – neurotoxin missiles","range":"48","type":"Ranged","a":"D6+3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 2+, blast"}]},{"name":"Razorwing missiles – shatterfield missiles","type":"Ranged","profiles":[{"name":"Razorwing missiles – shatterfield missiles","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"blast"}]},{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 1"}]},{"name":"Twin splinter rifle","type":"Ranged","profiles":[{"name":"Twin splinter rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, rapid fire 2, twin-linked"}]},{"name":"Bladed wings","type":"Melee","profiles":[{"name":"Bladed wings","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Nowhere to Run (Pain)","description":"In your Shooting phase, when you select this unit to shoot, you can spend 1 Pain token to Empower this unit. While Empowered, after this unit has shot, select one enemy unit (excluding MONSTERS and VEHICLES) hit by one or more of those attacks; until the start of your next turn, that enemy unit is pinned. While a unit is pinned, subtract 2 from that unit’s Move characteristic and subtract 2 from Charge rolls made for that unit.","type":"Datasheet"},{"name":"Ground Attack Craft","description":"Each time a model in this unit makes a ranged attack that targets an enemy unit (excluding units that can FLY), add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Razorwing Jetfighter","Vehicle","Fly","Aircraft","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Razorwing Jetfighter"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000666","name":"Reaper","role":"Other","loadout":"This model is equipped with: storm vortex projector; bladevanes; prow blade.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time it makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Reaper","m":"14\"","t":"9","sv":"4+","invSv":"6","w":"11","ld":"7+","oc":"3"}],"weapons":[{"name":"Storm vortex projector – beam","type":"Ranged","profiles":[{"name":"Storm vortex projector – beam","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"12","ap":"-3","d":"D6","desc":null}]},{"name":"Storm vortex projector – blast","type":"Ranged","profiles":[{"name":"Storm vortex projector – blast","range":"24","type":"Ranged","a":"D6+3","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"blast"}]},{"name":"Bladevanes","type":"Melee","profiles":[{"name":"Bladevanes","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]},{"name":"Prow blade","type":"Melee","profiles":[{"name":"Prow blade","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"extra attacks, lance, sustained hits 3"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Electromagentic Cascade (Pain)","description":"In your Shooting phase, when you select this model to shoot, you can spend 1 Pain token to Empower this model. While Empowered: Each time this model makes a ranged attack that targets a VEHICLE unit, that attack has the [SUSTAINED HITS 2] ability.Each time this model makes a ranged attack that targets a non-VEHICLE unit, that attack has the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Eradicate the Foe","description":"Each time this model makes an attack that targets an enemy unit that is at its Starting Strength, re-roll a Hit roll of 1. If the target unit has a Starting Strength of 1, this ability only applies if that unit has its starting number of wounds.","type":"Datasheet"}],"keywords":["Aeldari","Fly","Kabal","Vehicle","Reaper"],"factionKeywords":["Drukhari"],"composition":["1 Reaper"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000000658","name":"Reavers","role":"Other","loadout":"Every model is equipped with: splinter pistol; splinter rifle; bladevanes.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Reavers","m":"16\"","t":"4","sv":"4+","invSv":"6","w":"2","ld":"7+","oc":"2"}],"weapons":[{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"}]},{"name":"Heat lance","type":"Ranged","profiles":[{"name":"Heat lance","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"14","ap":"-4","d":"D6","desc":"assault, melta 3"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Splinter rifle","type":"Ranged","profiles":[{"name":"Splinter rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Bladevanes","type":"Melee","profiles":[{"name":"Bladevanes","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"lance"}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Matchless Swiftness (Pain)","description":"In your Movement phase, when you select this unit to Advance, you can spend 1 Pain token to Empower this unit. While Empowered, each time this unit Advances, do not make an Advance roll. Instead, until the end of the phase, add 8\" to the Move characteristic of models in this unit.","type":"Datasheet"},{"name":"Eviscerating Fly-by","description":"Each time this unit ends a Normal or Advance move, you can select one enemy unit (excluding MONSTERS and VEHICLES) that it moved over during that move, then roll one D6 for each model in this unit: for each 4+, that enemy unit suffers 1 mortal wound.","type":"Datasheet"},{"name":"Cluster Caltrops","description":"Each time you roll to inflict wounds using this unit’s Eviscerating Fly-by ability, you can re-roll one D6 for each model in this unit equipped with cluster caltrops.","type":"Wargear"},{"name":"Grav-talon","description":"The bearer’s melee weapons have an Armour Penetration characteristic of -2 and the [LETHAL HITS] ability.","type":"Wargear"}],"keywords":["Mounted","Wych Cult","Fly","Aeldari","Reavers"],"factionKeywords":["Drukhari"],"composition":["1 Arena Champion","2-5 Reavers"],"points":[{"models":"3 models","cost":"70"},{"models":"6 models","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000000662","name":"Scourges with Heavy Weapons","role":"Other","loadout":"The Solarite is equipped with: shardcarbine; close combat weapon. Every Scourge is equipped with: splinter cannon; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Scourges","m":"14\"","t":"3","sv":"4+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"D3","desc":"pistol"}]},{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"}]},{"name":"Dark lance","type":"Ranged","profiles":[{"name":"Dark lance","range":"36","type":"Ranged","a":"1","bsWs":"4","s":"12","ap":"-3","d":"D6+2","desc":"heavy"}]},{"name":"Haywire blaster","type":"Ranged","profiles":[{"name":"Haywire blaster","range":"24","type":"Ranged","a":"2","bsWs":"4","s":"3","ap":"-1","d":"3","desc":"anti-vehicle 4+, devastating wounds, heavy"}]},{"name":"Heat lance","type":"Ranged","profiles":[{"name":"Heat lance","range":"18","type":"Ranged","a":"1","bsWs":"4","s":"14","ap":"-4","d":"D6","desc":"assault, heavy, melta 3"}]},{"name":"Shardcarbine","type":"Ranged","profiles":[{"name":"Shardcarbine","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Shredder","type":"Ranged","profiles":[{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"}]},{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"4","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, heavy, sustained hits 1"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Winged Strike (Pain)","description":"In your Shooting phase, when you select this unit to shoot, you can spend 1 Pain token to Empower this unit. While Empowered, each time a model in this unit makes a ranged attack, you can re-roll the Hit roll.","type":"Datasheet"},{"name":"Airborne Evasion","description":"In your Shooting phase, after this unit has shot, if it is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\". If it does, until the end of the turn, this unit is not eligible to declare a charge.","type":"Datasheet"}],"keywords":["Jump Pack","Aeldari","Blades for Hire","Scourges","Scourges with Heavy Weapons","Grenades","Fly","Infantry"],"factionKeywords":["Drukhari"],"composition":["1 Solarite","4 Scourges"],"points":[{"models":"5 models","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000004157","name":"Scourges with Shardcarbines","role":"Other","loadout":"The Solarite is equipped with: shardcarbine; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Scourges","m":"14\"","t":"3","sv":"4+","invSv":"5","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-3","d":"D3","desc":"pistol"}]},{"name":"Blaster","type":"Ranged","profiles":[{"name":"Blaster","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6+1","desc":"assault"}]},{"name":"Shardcarbine","type":"Ranged","profiles":[{"name":"Shardcarbine","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault"}]},{"name":"Shredder","type":"Ranged","profiles":[{"name":"Shredder","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"0","d":"1","desc":"assault, torrent"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Swooping Descent (Pain)","description":"In your Movement phase, you can spend 1 Pain token to Empower this unit. While Empowered, each time a model in this unit is set up on the battlefield using the Deep Strike ability, it can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units. When doing so, if this unit is set up within 9\" of one or more enemy units, until the end of the turn, it is not eligible to declare a charge.","type":"Datasheet"},{"name":"Murderous Crossfire","description":"After this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly Drukhari unit makes a ranged attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1. The same enemy unit can only be affected by this ability once per turn.","type":"Datasheet"}],"keywords":["Infantry","Fly","Grenades","Jump Pack","Scourges with Shardcarbines","Blades for Hire","Scourges","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Solarite","4 Scourges"],"points":[{"models":"5 models","cost":"80"}],"canLead":[],"ledBy":[]},{"id":"000004159","name":"Shadowseer","role":"Characters","loadout":"This model is equipped with: shuriken pistol; miststave; flip belt.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Shadowseer","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Miststave","type":"Melee","profiles":[{"name":"Miststave","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"5","ap":"-1","d":"D3","desc":"psychic"},{"name":"Shuriken pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"assault, pistol"},{"name":"Neuro disruptor","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+, assault, pistol"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Fog of Dreams (Psychic)","description":"While this model is leading a unit, that unit can only be selected as the target of a ranged attack if the attacking model is within 18\".","type":"Datasheet"},{"name":"Treacherous Illusion (Psychic)","description":"Melee weapons equipped by enemy models have the [HAZARDOUS] ability while targeting this model’s unit.","type":"Datasheet"},{"name":"Flip Belt","description":"Each time the bearer’s unit makes a Normal, Advance, Fall Back or Charge move, ignore any vertical distance when determining the total distance the bearer can be moved during that move.","type":"Wargear"},{"name":"TRAVELLING PLAYERS","description":"Unless otherwise stated, you cannot include more than one of this model in your army.","type":"Fortification (левая колонка)"}],"keywords":["Psyker","Character","Aeldari","Shadowseer","Grenades","Infantry"],"factionKeywords":["Harlequins","Drukhari"],"composition":["1 Shadowseer"],"points":[{"models":"1 model","cost":"60"}],"canLead":["000004164"],"ledBy":[]},{"id":"000004163","name":"Skyweavers","role":"Other","loadout":"Every model is equipped with: shuriken cannon; star bolas; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Skyweavers","m":"14\"","t":"4","sv":"4+","invSv":"4","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Skyweaver haywire cannon","type":"Ranged","profiles":[{"name":"Skyweaver haywire cannon","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"3","ap":"-1","d":"3","desc":"anti-vehicle 4+, devastating wounds"},{"name":"Zephyrglaive","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"6","ap":"-2","d":"2","desc":null},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"lethal hits"},{"name":"Star bolas","range":"12","type":"Ranged","a":"D3","bsWs":"3","s":"7","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Acrobatic Grace","description":"Each time an attack targets this unit, subtract 1 from the Hit roll.","type":"Datasheet"}],"keywords":["Mounted","Aeldari","Smoke","Skyweavers","Fly"],"factionKeywords":["Drukhari","Harlequins"],"composition":["2-4 Skyweavers"],"points":[{"models":"2 models","cost":"95"},{"models":"4 models","cost":"190"}],"canLead":[],"ledBy":[]},{"id":"000004160","name":"Solitaire","role":"Characters","loadout":"This model is equipped with: Solitaire weapons, flip belt.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Solitaire","m":"12\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Solitaire weapons","type":"Melee","profiles":[{"name":"Solitaire weapons","range":"Melee","type":"Melee","a":"9","bsWs":"2","s":"6","ap":"-2","d":"2","desc":"precision"}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Blitz","description":"Once per battle, in your Movement phase, before this model makes a Normal move, it can use this ability. If it does, until the end of the turn, add 2D6\" to this model’s Move characteristic and add 3 to the Attacks characteristic of this model’s Solitaire weapons.","type":"Datasheet"},{"name":"Blur of Movement","description":"This model is eligible to declare a charge in a turn in which it Advanced.","type":"Datasheet"},{"name":"PATH OF DAMNATION","description":"This model cannot be your WARLORD.","type":"Fortification (левая колонка)"},{"name":"Flip Belt","description":"Each time the bearer’s unit makes a Normal, Advance, Fall Back or Charge move, ignore any vertical distance when determining the total distance the bearer can be moved during that move.","type":"Wargear"}],"keywords":["Character","Infantry","Solitaire","Aeldari","Epic Hero"],"factionKeywords":["Drukhari","Harlequins"],"composition":["1 Solitaire – EPIC HERO"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000004162","name":"Starweaver","role":"Dedicated Transports","loadout":"This model is equipped with: 2 shuriken cannons; close combat weapon.","transport":"This model has a transport capacity of 6 Harlequins Infantry models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Starweaver","m":"14\"","t":"6","sv":"4+","invSv":"4","w":"6","ld":"6+","oc":"2"}],"weapons":[{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"lethal hits"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Rapid Embarkation","description":"At the end of the Fight phase, if there are no models currently embarked within this TRANSPORT, you can select one friendly Harlequins Infantry unit that has 6 or fewer models that is wholly within 6\" of this TRANSPORT. Unless that unit is within Engagement Range of one or more enemy units, it can embark within this TRANSPORT.","type":"Datasheet"}],"keywords":["Vehicle","Aeldari","Transport","Dedicated Transport","Smoke","Fly","Starweaver"],"factionKeywords":["Harlequins","Drukhari"],"composition":["1 Starweaver"],"points":[{"models":"1 model","cost":"80"}],"canLead":[],"ledBy":[]},{"id":"000000639","name":"Succubus","role":"Characters","loadout":"This model is equipped with: Archite glaive and agoniser.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Succubus","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Archite glaive and agoniser","type":"Melee","profiles":[{"name":"Archite glaive and agoniser","range":"Melee","type":"Melee","a":"7","bsWs":"2","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+, precision"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Lithe Agility (Pain)","description":"In your Movement phase when you select this model’s unit to Advance, or in your Charge phase before you make a Charge roll for this model’s unit, you can spend 1 Pain token to Empower that unit. While that unit is Empowered, you can re-roll Advance and Charge rolls made for that unit.","type":"Datasheet"},{"name":"Storm of Blades","description":"While this model is leading a unit, melee weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Bloody Spectacle","description":"Each time this model makes a melee attack that targets a CHARACTER unit, you can re-roll the Hit roll and you can re-roll the Wound roll. Each time this model’s unit destroys a CHARACTER model, you gain 1CP.","type":"Datasheet"}],"keywords":["Character","Wych Cult","Infantry","Succubus","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Succubus"],"points":[{"models":"1 model","cost":"50"}],"canLead":["000000646"],"ledBy":[]},{"id":"000000663","name":"Talos","role":"Other","loadout":"Every model is equipped with: twin splinter cannon; 2 macro-scalpels.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Talos","m":"7\"","t":"7","sv":"3+","invSv":"6","w":"7","ld":"7+","oc":"2"}],"weapons":[{"name":"Stinger pod","type":"Ranged","profiles":[{"name":"Stinger pod","range":"24","type":"Ranged","a":"2D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Twin haywire blaster","type":"Ranged","profiles":[{"name":"Twin haywire blaster","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"3","ap":"-1","d":"3","desc":"anti-vehicle 4+, devastating wounds, twin-linked"}]},{"name":"Twin heat lance","type":"Ranged","profiles":[{"name":"Twin heat lance","range":"18","type":"Ranged","a":"1","bsWs":"3","s":"14","ap":"-4","d":"D6","desc":"assault, melta 3, twin-linked"}]},{"name":"Twin liquifier gun","type":"Ranged","profiles":[{"name":"Twin liquifier gun","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"anti-infantry 3+, torrent, twin-linked"}]},{"name":"Twin splinter cannon","type":"Ranged","profiles":[{"name":"Twin splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 1, twin-linked"}]},{"name":"Chain-flails","type":"Melee","profiles":[{"name":"Chain-flails","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"6","ap":"-1","d":"1","desc":null}]},{"name":"Macro-scalpel","type":"Melee","profiles":[{"name":"Macro-scalpel","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"7","ap":"-2","d":"2","desc":null}]},{"name":"Talos gauntlet","type":"Melee","profiles":[{"name":"Talos gauntlet","range":"Melee","type":"Melee","a":"5","bsWs":"4","s":"9","ap":"-2","d":"3","desc":null}]},{"name":"Talos ichor injector","type":"Melee","profiles":[{"name":"Talos ichor injector","range":"Melee","type":"Melee","a":"1","bsWs":"2","s":"8","ap":"-2","d":"D6","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Mindless Killing Machines (Pain)","description":"At the start of the Fight phase, you can spend 1 Pain token to Empower this unit. While Empowered, each time a model in this unit is destroyed by a melee attack, if that model has not fought this phase, roll one D6. On a 2+, do not remove it from play; that destroyed model can fight after the attacking unit has finished making its attacks, and it is then removed from play.","type":"Datasheet"},{"name":"Devoted to Pain","description":"If a model in this unit is equipped with 2 macro-scalpels, those weapons have the [TWIN-LINKED] ability.","type":"Datasheet"},{"name":"Torture Device","description":"Each time this unit destroys an enemy unit, you gain 1 additional Pain token.","type":"Datasheet"}],"keywords":["Monster","Haemonculus Covens","Talos","Aeldari","Fly"],"factionKeywords":["Drukhari"],"composition":["1-2 Talos"],"points":[{"models":"1 model","cost":"80"},{"models":"2 models","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000000667","name":"Tantalus","role":"Other","loadout":"This model is equipped with: pulse disintegrators; dire scythe blades.","transport":"This model has a transport capacity of 16 Drukhari Infantry models. Each Grotesque model takes up the space of 3 models. This model cannot transport models that can Fly.","damagedW":"1-6","damagedDescription":"While this model has 1-6 wounds remaining, each time it makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Tantalus","m":"16\"","t":"10","sv":"4+","invSv":"5","w":"18","ld":"7+","oc":"5"}],"weapons":[{"name":"Pulse disintegrators","type":"Ranged","profiles":[{"name":"Pulse disintegrators","range":"36","type":"Ranged","a":"12","bsWs":"3","s":"10","ap":"-2","d":"2","desc":"assault"}]},{"name":"Dire scythe blades","type":"Melee","profiles":[{"name":"Dire scythe blades","range":"Melee","type":"Melee","a":"9","bsWs":"4","s":"8","ap":"-1","d":"2","desc":"devastating wounds"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Engine of Destruction (Pain)","description":"In your Shooting phase, when you select this model to shoot, you can spend 1 Pain token to Empower this model. While Empowered, this model’s pulse disintegrators have the [RAPID FIRE 8] ability.","type":"Datasheet"},{"name":"Scything Charge","description":"Each time this model ends a Charge move, select one enemy unit within Engagement Range of it and roll one D6: on a 2-3, that enemy unit suffers D3 mortal wounds; on a 4-5, that enemy unit suffers 3 mortal wounds; on a 6, that enemy unit suffers D3+3 mortal wounds.","type":"Datasheet"}],"keywords":["Tantalus","Transport","Fly","Aeldari","Vehicle"],"factionKeywords":["Drukhari"],"composition":["1 Tantalus"],"points":[{"models":"1 model","cost":"230"}],"canLead":[],"ledBy":[]},{"id":"000004164","name":"Troupe","role":"Other","loadout":"Every model is equipped with: shuriken pistol; Harlequin’s blade, flip belt.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Troupe","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"1","ld":"6+","oc":"1"}],"weapons":[{"name":"Neuro disruptor","type":"Ranged","profiles":[{"name":"Neuro disruptor","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+, assault, pistol"},{"name":"Power sword","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"devastating wounds"},{"name":"Harlequin’s special weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"devastating wounds"},{"name":"Shuriken pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"assault, pistol"},{"name":"Fusion pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D6","desc":"assault, melta 2, pistol"},{"name":"Harlequin’s blade","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"3","ap":"-1","d":"1","desc":"devastating wounds"}]}],"abilities":[{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Dance of Death","description":"At the start of the Fight phase, select one of the following abilities for this unit to gain until the end of the phase: Hero’s Prowess: Each time a model in this unit makes an attack, re-roll a Hit roll of 1.Villain’s Doom: Each time a model in this unit makes an attack, add 1 to the Wound roll.Trickster’s Grace: Each time an attack targets this unit, subtract 1 from the Hit roll.","type":"Datasheet"},{"name":"Flip Belt","description":"Each time the bearer’s unit makes a Normal, Advance, Fall Back or Charge move, ignore any vertical distance when determining the total distance the bearer can be moved during that move.","type":"Wargear"}],"keywords":["Aeldari","Troupe","Grenades","Infantry"],"factionKeywords":["Drukhari","Harlequins"],"composition":["1 Lead Player","4-11 Players"],"points":[{"models":"5 models","cost":"85"},{"models":"6 models","cost":"100"},{"models":"11 models","cost":"190"},{"models":"12 models","cost":"205"}],"canLead":[],"ledBy":["000004161","000004159"]},{"id":"000004161","name":"Troupe Master","role":"Characters","loadout":"This model is equipped with: shuriken pistol; Troupe Master’s blade; flip belt.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Troupe Master","m":"8\"","t":"3","sv":"6+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Troupe Master’s blade","type":"Melee","profiles":[{"name":"Troupe Master’s blade","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"5","ap":"-2","d":"2","desc":"devastating wounds"},{"name":"Neuro disruptor","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-2","d":"1","desc":"anti-infantry 2+, assault, pistol"},{"name":"Fusion pistol","range":"6","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-4","d":"D6","desc":"assault, melta 2, pistol"},{"name":"Shuriken pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"assault, pistol"},{"name":"Harlequin’s special weapon","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"4","ap":"-1","d":"2","desc":"devastating wounds"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Choreographer of War","description":"While this model is leading a unit, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\". In addition, it does not need to end that move closer to the closest enemy model, provided it ends it as close as possible to the closest enemy unit.","type":"Datasheet"},{"name":"Cegorach’s Favour","description":"Each time this model makes a melee attack, you can re-roll a Hit roll of 1 and add 1 to the Wound roll.","type":"Datasheet"},{"name":"TRAVELLING PLAYERS","description":"Unless otherwise stated, you cannot include more than one of this model in your army.","type":"Fortification (левая колонка)"},{"name":"Flip Belt","description":"Each time the bearer’s unit makes a Normal, Advance, Fall Back or Charge move, ignore any vertical distance when determining the total distance the bearer can be moved during that move.","type":"Wargear"}],"keywords":["Grenades","Troupe Master","Aeldari","Character","Infantry"],"factionKeywords":["Harlequins","Drukhari"],"composition":["1 Troupe Master"],"points":[{"models":"1 model","cost":"75"}],"canLead":["000004164"],"ledBy":[]},{"id":"000000642","name":"Urien Rakarth","role":"Characters","loadout":"This model is equipped with: Casket of Flensing; Haemonculus tools and scissorhands.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Urien Rakarth","m":"7\"","t":"4","sv":"6+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Casket of Flensing","type":"Ranged","profiles":[{"name":"Casket of Flensing","range":"12","type":"Ranged","a":"3D6","bsWs":"N/A","s":"3","ap":"-1","d":"1","desc":"devastating wounds, one shot, torrent"}]},{"name":"Haemonculus tools and scissorhands","type":"Melee","profiles":[{"name":"Haemonculus tools and scissorhands","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"3","ap":"-1","d":"D3","desc":"anti-infantry 2+, precision"}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Sculptor of Torments (Pain)","description":"In your Fight phase, when you select this model’s unit to fight, you can spend 1 of your Pain tokens to Empower this model’s unit. While that unit is Empowered, each time a model in that unit makes a melee attack, add 1 to the Wound roll.","type":"Datasheet"},{"name":"Father of Pain","description":"Each time an attack with a Damage characteristic of 1 is allocated to a model in this model’s unit, that model has the Feel No Pain 4+ ability against that attack.","type":"Datasheet"},{"name":"Horrific Regeneration","description":"The first time this model is destroyed, roll one D6 at the end of the phase. On a 2+, set this model back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with its full wounds remaining.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Haemonculus","Urien Rakarth","Aeldari","Epic Hero","Character","Haemonculus Covens","Infantry"],"factionKeywords":["Drukhari"],"composition":["1 Urien Rakarth – EPIC HERO"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000000650"],"ledBy":[]},{"id":"000000657","name":"Venom","role":"Dedicated Transports","loadout":"This model is equipped with: splinter cannon; twin splinter rifle; bladevanes.","transport":"This model has a transport capacity of 6 Drukhari Infantry models (excluding Jump Pack models). Before the battle, at the start of the Declare Battle Formations step, you can select one Kabalite Warriors, Hand of the Archon or Wyches unit from your army that has not already been split. If you do, that unit is split into two units, each containing as equal a number of models as possible (when splitting a unit in this way, make a note of which models form each of the two new units]. One of these units must start the battle embarked within this model; the other can start the battle embarked within another TRANSPORT, or it can be deployed as a separate unit.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Venom","m":"14\"","t":"6","sv":"4+","invSv":"6","w":"6","ld":"7+","oc":"1"}],"weapons":[{"name":"Splinter cannon","type":"Ranged","profiles":[{"name":"Splinter cannon","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"3","ap":"-1","d":"2","desc":"anti-infantry 3+, sustained hits 1"}]},{"name":"Twin splinter rifle","type":"Ranged","profiles":[{"name":"Twin splinter rifle","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, rapid fire 2, twin-linked"}]},{"name":"Bladevanes","type":"Melee","profiles":[{"name":"Bladevanes","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Rapid Deployment (Pain)","description":"In your Movement phase, when you select this model to Advance, you can spend 1 Pain token to Empower this model. While Empowered, units can disembark from this model after it has Advanced. Units that do so count as having made a Normal move that phase, and cannot declare a charge in the same turn, but can otherwise act normally in the remainder of the turn.","type":"Datasheet"},{"name":"Aerialists","description":"At the end of the Fight phase, if there are no models currently embarked within this TRANSPORT, you can select one friendly Drukhari Infantry unit that has 6 or fewer models that is wholly within 6\" of this TRANSPORT (you cannot select a unit that can Fly). Unless that unit is within Engagement Range of one or more enemy units, it can embark within this TRANSPORT.","type":"Datasheet"}],"keywords":["Vehicle","Transport","Dedicated Transport","Fly","Aeldari","Venom"],"factionKeywords":["Drukhari"],"composition":["1 Venom"],"points":[{"models":"1 model","cost":"70"}],"canLead":[],"ledBy":[]},{"id":"000000661","name":"Voidraven Bomber","role":"Other","loadout":"This model is equipped with: 2 void lances; bladed wings.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Voidraven Bomber","m":"20+\"","t":"9","sv":"4+","invSv":"6","w":"12","ld":"7+","oc":"0"}],"weapons":[{"name":"Dark scythe","type":"Ranged","profiles":[{"name":"Dark scythe","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"8","ap":"-4","d":"2","desc":null}]},{"name":"Void lance","type":"Ranged","profiles":[{"name":"Void lance","range":"36","type":"Ranged","a":"2","bsWs":"3","s":"14","ap":"-4","d":"D6+2","desc":null}]},{"name":"Voidraven missiles – implosion missiles","type":"Ranged","profiles":[{"name":"Voidraven missiles – implosion missiles","range":"48","type":"Ranged","a":"D3","bsWs":"3","s":"9","ap":"-2","d":"3","desc":"blast"}]},{"name":"Voidraven missiles – shatterfield missiles","type":"Ranged","profiles":[{"name":"Voidraven missiles – shatterfield missiles","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"blast"}]},{"name":"Bladed wings","type":"Melee","profiles":[{"name":"Bladed wings","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Nowhere to Hide (Pain)","description":"In your Shooting phase, when you select this unit to shoot, you can spend 1 Pain token to Empower this unit. While Empowered, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover.","type":"Datasheet"},{"name":"Void Mine","description":"Once per battle, after this unit ends a Normal move, you can select one enemy model that it moved over during that move, then roll one D6 for each enemy unit within D6\" of that model: on a 4+, that enemy unit suffers D6 mortal wounds.","type":"Datasheet"}],"keywords":["Vehicle","Aircraft","Fly","Voidraven Bomber","Aeldari"],"factionKeywords":["Drukhari"],"composition":["1 Voidraven Bomber"],"points":[{"models":"1 model","cost":"245"}],"canLead":[],"ledBy":[]},{"id":"000004165","name":"Voidweaver","role":"Other","loadout":"This model is equipped with: 2 shuriken cannons; Voidweaver haywire cannon; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Voidweaver","m":"14\"","t":"6","sv":"4+","invSv":"4","w":"6","ld":"6+","oc":"2"}],"weapons":[{"name":"Prismatic cannon – dispersed pulse","type":"Ranged","profiles":[{"name":"Prismatic cannon – dispersed pulse","range":"24","type":"Ranged","a":"2D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"0","d":"1","desc":null},{"name":"Shuriken cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"lethal hits"},{"name":"Voidweaver haywire cannon","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"-1","d":"3","desc":"anti-vehicle 4+, devastating wounds"},{"name":"Prismatic cannon – focused lances","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"12","ap":"-3","d":"4","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Battle Focus","description":"If your Army Faction is Asuryani, at the start of the battle round, you receive a number of Battle Focus tokens based on the battle size, as shown in the table below. BATTLE SIZEBATTLE FOCUS TOKENSIncursion2Strike Force4Onslaught6 Each time one of the triggers shown in the Agile Manoeuvres section below occurs, you can spend one Battle Focus token to enable the relevant eligible unit to perform that Agile Manoeuvre. A unit is eligible to perform an Agile Manoeuvre if it has this ability and has not already performed an Agile Manoeuvre in the same phase. Unless otherwise stated, you cannot trigger the same Agile Manoeuvre more than once per phase. At the end of the battle round, all unspent Battle Focus tokens are lost. AGILE MANOEUVRESSWIFT AS THE WINDTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move. You can trigger this Agile Manoeuvre more than once per phase (provided a different unit performs it each time). EFFECT: Until the end of the phase, add 2\" to the Move characteristic of models in that unit.FLITTING SHADOWSTRIGGER: When an eligible unit from your army is selected to make a Normal, Advance or Fall Back move, is set up on the battlefield, or declares a charge. EFFECT: Until the end of the turn, enemy units cannot use the Fire Overwatch Stratagem to shoot at that unit.STAR ENGINESTRIGGER: When an eligible VEHICLE unit from your army is selected to make an Advance move. EFFECT: Until the end of the turn, Ranged weapons equipped by this unit have the [ASSAULT] ability.SUDDEN STRIKETRIGGER: When an eligible unit from your army is selected to fight. EFFECT: Until the end of the phase, each time a model in that unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\".OPPORTUNITY SEIZEDTRIGGER: When an enemy unit ends a Fall Back move. EFFECT: One eligible unit from your army (excluding TITANIC units) that started the phase within Engagement Range of that enemy unit can make a Normal move of up to D6+1\".FADE BACKTRIGGER: In your opponent’s Shooting phase, just after an enemy unit has shot. EFFECT: One eligible unit from your army (excluding TITANIC units) that was hit by one or more of those attacks can make a Normal move of up to D6+1\".","type":"Faction"},{"name":"Disparate Paths","description":"When mustering your army, you can include Harlequins units in your army, even though they do not have the Asuryani Faction keyword. Unless otherwise stated, you cannot select HARLEQUINS or Ynnari as your Army Faction.","type":"Faction"},{"name":"Polychromatic Camouflage","description":"This unit can only be selected as the target of a ranged attack if the attacking model is within 18\".","type":"Datasheet"}],"keywords":["Vehicle","Aeldari","Fly","Voidweaver"],"factionKeywords":["Drukhari","Harlequins"],"composition":["1 Voidweaver"],"points":[{"models":"1 model","cost":"125"}],"canLead":[],"ledBy":[]},{"id":"000000650","name":"Wracks","role":"Battleline","loadout":"Every model is equipped with: twin torturer’s tools.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Wracks","m":"7\"","t":"4","sv":"5+","invSv":"6","w":"2","ld":"7+","oc":"2"}],"weapons":[{"name":"Hexrifle","type":"Ranged","profiles":[{"name":"Hexrifle","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-2","d":"3","desc":"heavy, precision"}]},{"name":"Liquifier gun","type":"Ranged","profiles":[{"name":"Liquifier gun","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"anti-infantry 3+, torrent"}]},{"name":"Ossefactor","type":"Ranged","profiles":[{"name":"Ossefactor","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"-2","d":"2","desc":"anti-infantry 4+, devastating wounds"}]},{"name":"Stinger pistol","type":"Ranged","profiles":[{"name":"Stinger pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 2+, pistol"}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"anti-infantry 3+"}]},{"name":"Torturer’s tools","type":"Melee","profiles":[{"name":"Torturer’s tools","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"anti-infantry 4+"}]},{"name":"Twin torturer’s tools","type":"Melee","profiles":[{"name":"Twin torturer’s tools","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"anti-infantry 4+, twin-linked"}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Experimental Enhancements (Pain)","description":"In the Fight phase, when you select this unit to fight, you can spend 1 Pain token to Empower this unit. Each time you do, select one of the following to apply to this unit until the end of the phase: Melee weapons equipped by non-CHARACTER models in this unit have an Attacks characteristic of 3.Melee weapons equipped by non-CHARACTER models in this unit have an Attacks characteristic of 4 and the [HAZARDOUS] ability.","type":"Datasheet"},{"name":"Torturer’s Craft","description":"In your Shooting phase and the Fight phase, after this unit has shot or fought, select one enemy unit (excluding VEHICLES) hit by one or more of those attacks. That unit must take a Battle-shock test.","type":"Datasheet"}],"keywords":["Infantry","Haemonculus Covens","Aeldari","Wracks","Battleline"],"factionKeywords":["Drukhari"],"composition":["1 Acothyst","4-9 Wracks"],"points":[{"models":"5 models","cost":"65"},{"models":"8 models","cost":"105"},{"models":"10 models","cost":"130"}],"canLead":[],"ledBy":["000000641","000000642"]},{"id":"000000646","name":"Wyches","role":"Battleline","loadout":"Every model is equipped with: splinter pistol; Hekatarii blade.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Wyches","m":"8\"","t":"3","sv":"6+","invSv":"6","w":"1","ld":"7+","oc":"2"}],"weapons":[{"name":"Blast pistol","type":"Ranged","profiles":[{"name":"Blast pistol","range":"6","type":"Ranged","a":"1","bsWs":"3","s":"8","ap":"-4","d":"D3","desc":"pistol"}]},{"name":"Splinter pistol","type":"Ranged","profiles":[{"name":"Splinter pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"2","ap":"0","d":"1","desc":"anti-infantry 3+, assault, pistol"}]},{"name":"Gladiatorial weapons","type":"Melee","profiles":[{"name":"Gladiatorial weapons","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"Hekatarii blade","type":"Melee","profiles":[{"name":"Hekatarii blade","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"3","ap":"-1","d":"1","desc":null}]},{"name":"Power weapon","type":"Melee","profiles":[{"name":"Power weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"3","ap":"-2","d":"1","desc":"anti-infantry 3+"}]}],"abilities":[{"name":"Power from Pain","description":"Pain Abilities All Drukhari units have a Pain ability, tagged with the word ‘Pain’. Pain abilities only apply to a unit while it is Empowered. If your Army Faction is DRUKHARI, you can Empower units from your army with Pain abilities by spending Pain tokens (see below). Designer’s Note: You can also spend Pain tokens to activate additional effects in certain other rules such as Enhancements and Stratagems. Gaining Pain Tokens If your Army Faction is DRUKHARI, you gain Pain tokens as follows: 1 Pain token at the start of your Command phase.1 Pain token each time an enemy unit is destroyed.1 Pain token each time an enemy unit fails a Battle-shock test.Each time you gain a Pain token, keep it to one side - this is your Pain token pool. Each time you spend a Pain token, reduce your Pain token pool by the same amount. Empowered Through Pain Each Pain ability will state when you can spend Pain tokens to Empower that unit. When you do, until the end of the phase, that unit is Empowered and all Pain abilities it has take effect. While an Attached unit is Empowered, the Pain abilities of all Leader and Bodyguard units in that unit take effect - you do not need to spend additional Pain tokens to activate each of those Pain abilities. Example: At the start of your Charge phase, you spend 1 Pain token to Empower a unit of Wyches. The unit becomes Empowered, and so its Acrobatic Gladiators ability takes effect until the end of the phase. A Succubus is leading the unit, and so its Lithe Agility ability also takes effect until the end of the phase (no additional Pain token is required to activate that ability as well).","type":"Faction"},{"name":"Acrobatic Gladiators (Pain)","description":"At the start of your Charge phase, you can spend 1 Pain token to Empower this unit. While Empowered, this unit is eligible to declare a charge in a turn in which it Advanced or Fell Back.","type":"Datasheet"},{"name":"No Escape","description":"Each time an enemy unit (excluding MONSTERS and VEHICLES) within Engagement Range of one or more units from your army with this ability Falls Back, all models in that enemy unit must take a Desperate Escape test. When doing so, if that enemy unit is Battle-shocked, subtract 1 from each of those tests.","type":"Datasheet"}],"keywords":["Grenades","Battleline","Infantry","Wych Cult","Aeldari","Wyches"],"factionKeywords":["Drukhari"],"composition":["1 Hekatrix","9 Wyches"],"points":[{"models":"10 models","cost":"90"}],"canLead":[],"ledBy":["000000639","000000640"]}]}