{"id":"TS","name":"Thousand Sons","lastUpdate":"2026-02-17 13:32:38","detachments":[{"name":"Changehost of Deceit","rules":[{"name":"Infernal Pacts","description":"Scintillating Legions units from your army have the following the ability: Daemonic Illusions (Aura): While a friendly Thousand Sons Psyker unit is within 6\" of and visible to this unit, models in that unit have a 4+ invulnerable save against ranged attacks. Thousand Sons units from your army have the following ability: Mortal Sorcery (Aura): While a friendly Scintillating Legions Psyker unit is within 6\" of and visible to this unit, that SCINTILLATING LEGIONS unit has the Cabal of Sorcerers ability. RESTRICTIONS You can include Scintillating Legions units in your army, even though they do not have the THOUSAND SONS Faction keyword. The combined points cost of such units you can include in your army is: Incursion: Up to 500 pts Strike Force: Up to 1000 pts Onslaught: Up to 1500 pts No SCINTILLATING LEGIONS models from your army can be your WARLORD."}],"enhancements":[{"name":"Nethershriek Mind-eater","description":"THOUSAND SONS or Lord of Change model only. At the start of your Shooting phase, select one enemy unit within 12\" of and visible to the bearer. That unit must take a Battle-shock test; if that test is failed, that unit suffers 3 mortal wounds.","cost":"10"},{"name":"Diabolic Savant","description":"Thousand Sons Infantry model only. While the bearer is within 6\" of one or more friendly Scintillating Legions units, each time the bearer Channels the Warp, add 1 to the Psychic test result.","cost":"20"},{"name":"Duplicitous Malediction","description":"THOUSAND SONS or Lord of Change model only. After both players have deployed their armies, select up to three THOUSAND SONS units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.","cost":"15"},{"name":"Tome of True Names","description":"Thousand Sons Infantry model only. Once per battle, at the start of any phase, the bearer can use this Enhancement. If it does, until the end of the phase, the bearer has a 2+ invulnerable save.","cost":"20"}],"stratagems":[{"name":"SULPHUROUS VEIL","type":"Changehost of Deceit – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Thousand Sons or Scintillating Legions unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"DECEPTIVE GLAMOUR","type":"Changehost of Deceit – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Fight phase","description":"WHEN: Start of the Fight phase. TARGET: One Thousand Sons unit from your army. EFFECT: Until the end of the phase, each time an enemy model within Engagement Range of your unit selects targets for its attacks, it can only target your unit if there are no eligible Scintillating Legions targets for those attacks."},{"name":"CHRONOSORCEROUS BLEED","type":"Changehost of Deceit – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: Your opponent’s Charge phase, just after an enemy unit has declared a charge. TARGET: One Thousand Sons Psyker or Scintillating Legions unit from your army that was selected as a target of that charge. EFFECT: Until the end of the phase, subtract 2 from Charge rolls made for that enemy unit (this is not cumulative with any other negative modifiers to that Charge roll)."},{"name":"FRACTAL DISJUNCTION","type":"Changehost of Deceit – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Scintillating Legions unit from your army (excluding Monsters) that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\"."},{"name":"ETHEREAL PHANTASM","type":"Changehost of Deceit – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move. TARGET: One Scintillating Legions unit from your army that is within 9\" of that enemy unit and not within Engagement Range of one or more enemy units. EFFECT: Your unit can make a Normal move of up to D6\", or a Normal move of up to 6\" instead if it is wholly within 6\" of one or more friendly Thousand Sons units."},{"name":"GLIMMERSHIFT PORTAL","type":"Changehost of Deceit – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: Up to two Scintillating Legions units from your army (excluding Monsters), or one Scintillating Legions Monster unit from your army, if all of those units are more than 6\" horizontally away from all enemy units. EFFECT: Remove those units from the battlefield and place them into Strategic Reserves."}]},{"name":"Chosen Cabal","rules":[{"name":"Witchsight","description":"Ranged weapons equipped by THOUSAND SONS models from your army have the [iGNORES COvER] ability."}],"enhancements":[{"name":"Warp Mastery","description":"Each time you roll to determine the number of attacks made with a Psychic weapon equipped by the bearer, you can re-roll the result.","cost":"0"},{"name":"Fires of Change","description":"Each time the bearer shoots, after it has shot, select one enemy unit hit by one or more of those attacks made with a Psychic weapon. That unit must take a Battle-shock test, subtracting 1 from the result.","cost":"0"}],"stratagems":[{"name":"TZEENTCH’S BOON","type":"Chosen Cabal – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One THOUSAND SONS PSYKER model from your army within range of an objective marker that has not been selected to shoot this phase. EFFECT: Until the end of the phase, each time your model makes a Psychic Attack, you can re-roll the Wound roll."},{"name":"COSTLY BLESSING","type":"Chosen Cabal – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One THOUSAND SONS PSYKER CHARAcTER model from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your model has a 3+ invulnerable save. At the end of the phase, your model suffers D3 mortal wounds."},{"name":"EMPYRIC DESECRATION","type":"Chosen Cabal – Epic Deed Stratagem","cost":"1","when":"Your turn – Fight phase","description":"WHEN: End of your Fight phase. TARGET: One THOUSAND SONS PSYKER CHARAcTER model from your army. EFFECT: Select one objective marker Secured by your opponent’s army that is within 6\" of and visible to your model, then roll one D6: on a 2+, that objective marker is no longer considered Secured by your opponent’s army."},{"name":"INFERNO BOLTERS","type":"Chosen Cabal – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One RUBRIc MARINES or ScARAB OccULT TERMINATORS unit from your army that has not been selected to shoot this phase. EFFECT: Select one closed Hatchway. Until the end of the phase, models in your unit can make attacks with ranged weapons (excluding Torrent weapons) that target enemy units within 1\" of that Hatchway and that are wholly on the opposite side of it from your unit, as if that Hatchway was open. Each time a model does so, that attack has an Armour Penetration characteristic of 0."}]},{"name":"Devoted Thralls","rules":[{"name":"Fervent Devotees","description":"Melee weapons equipped by THOUSAND SONS models from your army have the [SUSTAiNED HiTS 1] ability while targeting an enemy unit within range of an objective marker."}],"enhancements":[{"name":"Thrallmaster","description":"At the start of the first battle round, you can select one friendly THOUSAND SONS CULTiSTS or TzAANGORS unit within the same Entry Zone as the bearer. If you do, that unit can make a Normal move of up to 6\".","cost":"0"},{"name":"Prescient Authority","description":"Once per turn, when a friendly THOUSAND SONS CULTiSTS or TzAANGORS unit within 3\" of the bearer is selected to shoot or fight, the bearer can use this Enhancement. If it does, until the end of the phase, each time a model in that THOUSAND SONS CULTISTS or TZAANGORS unit makes an attack, re-roll a Wound roll of 1.","cost":"0"}],"stratagems":[{"name":"FLESH CHANGE","type":"Devoted Thralls – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One TzAANGORS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 5+ ability."},{"name":"PSYCHIC INGRESS","type":"Devoted Thralls – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: End of any phase. TARGET: One THOUSAND SONS PSYKER CHARAcTER model from your army. EFFECT: Open every Hatchway within 3\" of your model. When measuring this distance, ignore Walls and closed Hatchways. RESTRICTIONS: You can only use this Stratagem once."},{"name":"BESTIAL SURGE","type":"Devoted Thralls – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has shot. TARGET: One TzAANGORS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Your unit can make a Bestial Surge move. To do so, roll one D6: your unit can be moved a distance in inches up to the result, but must end that move as close as possible to the attacking unit. When doing so, those models can be moved within Engagement Range of that enemy unit, but only that enemy unit."},{"name":"FELL SACRIFICE","type":"Devoted Thralls – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Command phase","description":"WHEN: Your opponent’s Command phase, at the start of the Battle-shock step. TARGET: One THOUSAND SONS CHARAcTER or TzAANGORS unit from your army. EFFECT: Select one enemy unit below its Starting Strength that is within Engagement Range of your unit. That enemy unit must take a Battle-shock test. If that enemy unit is also Below Half-strength, subtract 1 from that test. This Enhancement cannot cause a unit to take two Battle-shock tests in the same phase."}]},{"name":"Fateseekers","rules":[{"name":"Methodical Conquest","description":"Each time a THOUSAND SONS model from your army makes an attack while firing Overwatch, an unmodified Hit roll of 5+ is required to score a hit, instead of an unmodified 6. In addition, SCARAb OCCULT TERMiNATORS units from your army can perform the Set Overwatch Tactical Manoeuvre in the same turn as performing the Secure Site Tactical Manoeuvre."}],"enhancements":[{"name":"Predestined Champion","description":"While the bearer is on the battlefield, you are considered to control one additional objective marker for the purposes of the Twisting Fate army rule.","cost":"0"},{"name":"Astral Predation","description":"Once per battle, in your Movement phase, when the bearer is selected to move, it can use this Enhancement. If it does, select one closed Hatchway on the battlefield. Until the end of the phase, the bearer can move through that Hatchway as if it was open (note that this does not open that Hatchway - it remains closed).","cost":"0"}],"stratagems":[{"name":"INVISIBLE ASSAILANTS","type":"Fateseekers – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Start of your opponent’s Movement phase. TARGET: One THOUSAND SONS PSYKER model from your army. EFFECT: Select one enemy unit visible to your model. That unit must take a Leadership test, subtracting 1 from the result: if failed, until the start of your opponent’s next Movement phase, subtract 2\" from the Move characteristic of models in that unit and subtract 2 from Advance and Charge rolls made for it; if passed, subtract 1\" from the Move characteristic of models in that unit and subtract 1 from Advance and Charge rolls made for it."},{"name":"PHANTASMIC MUNITIONS","type":"Fateseekers – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One THOUSAND SONS PSYKER unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, models in your unit can ignore enemy models for the purposes of determining visibility."},{"name":"ENDURING ANIMUS","type":"Fateseekers – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One THOUSAND SONS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6. On a 4+, do not remove the destroyed model from play; it can fight after the attacking unit has finished making its attacks, and is then removed from play."},{"name":"STRATEGIC VISION","type":"Fateseekers – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One THOUSAND SONS PSYKER unit from your army that is within Engagement Range of one or more enemy units and has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [PISTOL] ability, and models in your unit can target enemy units that are not within Engagement Range of them (as long as they are otherwise eligible targets)."}]},{"name":"Grand Coven","rules":[{"name":"Kindred Sorcery","description":"In your Command phase, you can select one of the abilities listed below to take effect until the start of your next Command phase. You can only select each of these abilities once per battle.Imbued ManifestationAdd 6\" to the Range characteristic of ranged Psychic weapons equipped by THOUSAND SONS models from your army.Psychic MaelstromEach time a THOUSAND SONS model from your army makes an attack with a Psychic weapon, add 1 to the Wound roll.Wrath of the ImmateriumPsychic weapons equipped by THOUSAND SONS models from your army have the [devastating wounds] ability."}],"enhancements":[{"name":"Lord of Forbidden Lore","description":"THOUSAND SONS model only. Each time the bearer manifests a Ritual, while resolving that Ritual, add 6\" to its range.","cost":"20"},{"name":"Incandaeum","description":"Exalted Sorcerer model only. Once per battle, when selecting a Ritual for the bearer to attempt, you can select Doombolt, even if a model from your army have already attempted to manifest that Ritual this phase.","cost":"15"},{"name":"Umbralefic Crystal","description":"THOUSAND SONS model only. Once per battle, in your Command phase, if the bearer’s unit is not within Engagement Range of one or more enemy units, you can remove that unit from the battlefield and place it into Strategic Reserves. In the Reinforcements step of your next Movement phase, set that unit back up anywhere on the battlefield that is more than 9\" horizontally away from all enemy units.","cost":"20"},{"name":"Eldritch Vortex of E’taph","description":"THOUSAND SONS model only. Add 1 to the Strength and Damage characteristics of Psychic weapons equipped by the bearer.","cost":"35"}],"stratagems":[{"name":"DEVASTATING SORCERY","type":"Grand Coven – Battle Tactic Stratagem","cost":"2","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Thousand Sons Psyker unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, add 9\" to the Range characteristic of Psychic weapons equipped by models in your unit, and each time a model in your unit makes an attack with a Psychic weapon, you can re-roll the Hit roll and you can re-roll the Wound roll."},{"name":"DESTINED BY FATE","type":"Grand Coven – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just after a saving throw is failed for a Thousand Sons Psyker model from your army. If you are using fast dice rolling, this Stratagem can still be used after rolling multiple saving throws at once. TARGET: That PSYKER model. EFFECT: Change the Damage characteristic of that attack to 0. If you are using fast dice rolling, select one of those attacks you failed a saving throw for."},{"name":"DESECRATION OF WORLDS","type":"Grand Coven – Epic Deed Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Thousand Sons Psyker unit from your army within range of an objective marker you control. EFFECT: That objective marker remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase."},{"name":"ARCANE FOCUS","type":"Grand Coven – Epic Deed Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase, just after you take a Psychic test for a Thousand Sons model from your army that Channelled the Warp (before resolving that Ritual). TARGET: That THOUSAND SONS model. EFFECT: Re-roll all of the D6 rolled for that Psychic test (including the additional D6 for Channelling the Warp)."},{"name":"PSYCHIC DOMINION","type":"Grand Coven – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just after an enemy unit has selected its targets. TARGET: One Thousand Sons unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, Psychic weapons equipped by models in the attacking unit have the [hazardous] ability, and models in your unit have the Feel No Pain 4+ ability against Psychic Attacks."},{"name":"EGOTISTICAL POWER","type":"Grand Coven – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Thousand Sons Psyker unit from your army. EFFECT: Select the Imbued Manifestation, Psychic Maelstrom or Wrath of the Immaterium ability. Until the start of your next Command phase, that ability applies to your unit instead of any other Kindred Sorcery ability, even if you have already selected that ability this battle."}]},{"name":"Hexwarp Thrallband","rules":[{"name":"Flow of Magic","description":"Certain areas of the battlefield are within your army’s Flow of Magic, as follows: Your deployment zone is always within your army’s Flow of Magic.At the start of any phase, if you control at least half of the objective markers within No Man’s Land, until the end of that phase, No Man’s Land is within your army’s Flow of Magic.At the start of any phase, if you control at least half of the objective markers within your opponent’s deployment zone, until the end of that phase, your opponent’s deployment zone is within your army’s Flow of Magic. Each time a THOUSAND SONS model from your army makes a Psychic Attack, re-roll a Wound roll of 1. If such a model is wholly within your army’s Flow of Magic, each time it makes a Psychic Attack, add 1 to the Wound roll instead."}],"enhancements":[{"name":"Arcane Might","description":"THOUSAND SONS model only. Add 1 to the Strength characteristic of Psychic weapons equipped by models in the bearer’s unit. While the bearer’s unit is wholly within your army’s Flow of Magic, add 2 to the Strength characteristic of Psychic weapons equipped by models in that unit instead.","cost":"20"},{"name":"Empowered Manifestation","description":"THOUSAND SONS model only. While the bearer’s unit is wholly within your army’s Flow of Magic, you can add 6\" to the range of Psychic abilities the bearer has that specify a range (including Rituals) and each time a model in the bearer’s unit takes a Hazardous test for a Psychic weapon, you can re-roll the result.","cost":"20"},{"name":"Empyric Onslaught","description":"THOUSAND SONS model only. While the bearer’s unit is wholly within your army’s Flow of Magic, add 3 to the Attacks characteristic of ranged Psychic weapons equipped by the bearer.","cost":"25"},{"name":"Noctilith Mantle","description":"THOUSAND SONS model only. While the bearer’s unit is on the battlefield, it is wholly within your army’s Flow of Magic. Models in that unit cannot be selected to use any Rituals.","cost":"15"}],"stratagems":[{"name":"KALEIDOSCOPIC TEMPEST","type":"Hexwarp Thrallband – Battle Tactic Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Thousand Sons Psyker unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit has the Stealth ability, and, if your unit is wholly within your army’s Flow of Magic, each time an attack targets your unit, it has the Benefit of Cover against that attack."},{"name":"THROUGH THE VEIL","type":"Hexwarp Thrallband – Epic Deed Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Start of the Reinforcements step of your Movement phase. TARGET: One Rubric Marines or Scarab Occult Terminators unit from your army that is in Strategic Reserves. EFFECT: If it is a RUBRIC MARINES unit, until the end of the phase, it has the Deep Strike ability. When your unit is set up on the battlefield using the Deep Strike ability, if it is a SCARAB OCCULT TERMINATOR unit it can be set up anywhere on the battlefield that is wholly within your army’s Flow of Magic and more than 6\" horizontally away from all enemy models. RESTRICTIONS: If a SCARAB OCCULT TERMINATORS unit is targeted with this Stratagem, it is not eligible to declare a charge in the same turn."},{"name":"WARDING HEX","type":"Hexwarp Thrallband – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Command phase. TARGET: One Thousand Sons Psyker unit from your army within range of an objective marker you control, if that objective marker is wholly within your army’s Flow of Magic. EFFECT: That objective marker remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase."},{"name":"WRATH OF THE DOOMED","type":"Hexwarp Thrallband – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One THOUSAND SONS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6, adding 1 to the result if your unit is wholly within your army’s Flow of Magic: on a 4+, do not remove it from play. That destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play."},{"name":"SCOURING WARPFLAME","type":"Hexwarp Thrallband – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Thousand Sons Psyker unit from your army that has not been selected to shoot this phase and is wholly within your army’s Flow of Magic. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [IGNORES COVER] ability. After your unit has shot this phase, select one enemy unit hit by one or more of those attacks. Until the end of the phase, models in that unit cannot have the Benefit of Cover."},{"name":"STRANDS OF TIME","type":"Hexwarp Thrallband – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a THOUSAND SONS PSYKER unit from your army Falls Back. TARGET: That Thousand Sons Psyker unit. EFFECT: Until the end of the turn, your unit is eligible to shoot or declare a charge in a turn in which it Fell Back. If your unit is wholly within your army’s Flow of Magic when it is targeted with this Stratagem, then until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back."}]},{"name":"Rubricae Phalanx","rules":[{"name":"All is Dust","description":"Each time an attack with an unmodified Damage characteristic of 1 is allocated to a Rubricae model from your army, add 1 to any armour saving throw made against that attack."}],"enhancements":[{"name":"Risen Rubricae","description":"THOUSAND SONS model only. At the start of the Declare Battle Formations step, select either two Rubricae Battleline units from your army or one other Rubricae unit from your army; models in the selected units have the Infiltrators ability.","cost":"30"},{"name":"Arcane Thralls (Aura)","description":"THOUSAND SONS model only. While a friendly Rubricae unit is within 9\" of the bearer, you can re-roll Battle-shock tests taken for that unit.","cost":"5"},{"name":"Lord of the Rubricae","description":"THOUSAND SONS model only. While the bearer is leading a unit, each time a Rubricae model in that unit makes an attack, add 1 to the Hit roll.","cost":"15"},{"name":"The Stave Abominus","description":"Thousand Sons Infantry model only. The bearer’s melee weapons have the [sustained hits D3] and [devastating wounds] abilities.","cost":"20"}],"stratagems":[{"name":"UNWAVERING PHALANX","type":"Rubricae Phalanx – Battle Tactic Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: Your opponent’s Charge phase, just after an enemy unit ends a Charge move. TARGET: One Rubric Marines unit from your army within Engagement Range of that enemy unit. EFFECT: Until the end of the turn, each time an attack targets your unit, subtract 1 from the Wound roll."},{"name":"ARDENT AUTOMATA","type":"Rubricae Phalanx – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a Rubricae unit from your army Falls Back. TARGET: That RUBRICAE unit. EFFECT: Until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back."},{"name":"INEXORABLE ADVANCE","type":"Rubricae Phalanx – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One Rubricae unit from your army. EFFECT: Until the end of the turn, your unit can ignore any or all modifiers to its Move characteristic and to Advance rolls made for it, and ranged weapons equipped by models in your unit have the [ASSAULT] ability."},{"name":"REVENGE OF THE RUBRICAE","type":"Rubricae Phalanx – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after a Thousand Sons Psyker model from your army is destroyed. TARGET: One Rubricae unit from your army that was within 6\" of that PSYKER model when it was destroyed. EFFECT: After the attacking unit has shot, your RUBRICAE unit can shoot as if it were your Shooting phase, but when resolving those attacks it can only target the enemy unit that just destroyed your PSYKER model (and only if it is an eligible target)."},{"name":"IMPLACABLE GUARDIANS","type":"Rubricae Phalanx – Strategic Ploy Stratagem","cost":"2","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Rubric Marines Psyker unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack is allocated to a model in your unit (excluding PSYKER models), subtract 1 from the Damage characteristic of that attack."},{"name":"INFERNAL FUSILLADE","type":"Rubricae Phalanx – Wargear Stratagem","cost":"2","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Thousand Sons Psyker unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, all inferno bolt pistols, inferno boltguns, inferno combi-bolters and inferno combi-weapons equipped by models in your unit have the [PSYCHIC] ability and a Strength characteristic of 5."}]},{"name":"Warpforged Cabal","rules":[{"name":"Warpfire Infusion","description":"Each time a Thousand Sons Vehicle unit from your army is selected to shoot or fight, apply one of the following when resolving those attacks: If that VEHICLE unit is within 6\" of one or more friendly Thousand Sons Psyker models, you can re-roll one Hit roll, one Wound roll and one Damage roll.Otherwise, you can re-roll one Hit roll, one Wound roll or one Damage roll.Each time a THOUSAND SONS VEHICLE model from your army with the Deadly Demise ability is destroyed while it is within 6\" of one or more friendly THOUSAND SONS PSYKER models, that model’s Deadly Demise ability inflicts mortal wounds on a D6 roll of 5+ instead of only a 6."}],"enhancements":[{"name":"Warp Syphon","description":"THOUSAND SONS model only. While the bearer is within 6\" of one or more friendly Thousand Sons Vehicle units, each time the bearer Channels the Warp, after you roll that additional D6 but before checking for doubles or triples, the bearer can use this Enhancement. If it does, select one of those VEHICLE units; that VEHICLE unit suffers 1 mortal wound and you can re-roll that additional D6.","cost":"5"},{"name":"The Perplexing Cloak","description":"Thousand Sons Infantry model only. While the bearer is within 3\" of one or more friendly Thousand Sons Vehicle units, the bearer has the Lone Operative ability.","cost":"20"},{"name":"Biomechanical Mutation","description":"THOUSAND SONS model only. In your Command phase, you can select one friendly Thousand Sons Vehicle model within 6\" of this model. That model regains up to D3 lost wounds.","cost":"15"},{"name":"Warp-cursed Runemaster","description":"THOUSAND SONS model only. While the bearer is within 6\" of one or more friendly Thousand Sons Vehicle units, each time the bearer manifests a Ritual, while resolving that Ritual, add 6\" to its range.","cost":"10"}],"stratagems":[{"name":"HEX-MARKED ARMOUR","type":"Warpforged Cabal – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Thousand Sons Vehicle unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1."},{"name":"ENSORCELLED INFUSION","type":"Warpforged Cabal – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Thousand Sons Vehicle unit from your army that has not been selected to shoot this phase, that is within 6\" of one or more friendly Thousand Sons Psyker units. EFFECT: Until the end of the phase, ranged weapons equipped by VEHICLE models in your unit have the [PSYCHIC] ability and each time an attack is made with such a weapon, add 1 to the Wound roll."},{"name":"MUTATE LANDSCAPE","type":"Warpforged Cabal – Epic Deed Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Thousand Sons Psyker unit from your army within range of an objective marker you control. EFFECT: That objective marker is mutated, and remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase. While an objective marker is mutated and under your control, each time an enemy unit ends a Normal, Advance, Fall Back or Charge move within range of that objective marker, roll one D6: on a 4+, that enemy unit suffers D3 mortal wounds."},{"name":"MALEVOLENT ANIMUS","type":"Warpforged Cabal – Epic Deed Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Thousand Sons Vehicle unit from your army within 6\" of one or more friendly Thousand Sons Psyker units. EFFECT: Until the start of your next Command phase, your VEHICLE unit is malevolent. While a unit is malevolent, it can ignore any or all modifiers to the following: the profile characteristics of its models; the Weapon Skill and Ballistic Skill characteristics of weapons equipped by its models; any roll or test made for it (excluding modifiers to saving throws)."},{"name":"CYBERSPIRIT MACHINATIONS","type":"Warpforged Cabal – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a Thousand Sons Vehicle unit from your army Falls Back. TARGET: That VEHICLE unit, and one friendly Thousand Sons Psyker unit within 6\" of that VEHICLE unit. EFFECT: Until the end of the turn, your VEHICLE unit is eligible to shoot and declare a charge in a turn in which it Fell Back."},{"name":"WARPFLAME GARGOYLES","type":"Warpforged Cabal – Wargear Stratagem","cost":"1","when":"Opponent’s turn – Charge phase","description":"WHEN: Your opponent’s Charge phase, just after an enemy unit ends a Charge move. TARGET: One Thousand Sons Vehicle unit from your army within Engagement Range of that enemy unit. EFFECT: Roll six D6: for each 5+, that enemy unit suffers 1 mortal wound. That enemy unit must then take a Battle-shock test."}]},{"name":"Warpmeld Pact","rules":[{"name":"Warpmeld Sacrifice","description":"Each time an enemy unit is selected to shoot or fight and one or more Tzeentch Mutant Infantry or Tzeentch Mutant Mounted units from your army are selected as a target of one or more of those attacks, each of those TZEENTCH MUTANT units can make a Warpmeld Sacrifice. If it does, until the end of the phase, each time an attack targets that unit, subtract 1 from the Wound roll. At the end of the phase, that TZEENTCH MUTANT unit suffers D3 mortal wounds. Each time a TZEENTCH MUTANT INFANTRY or TZEENTCH MUTANT MOUNTED unit from your army is selected to shoot or fight, before selecting its targets, that unit can make a Warpmeld Sacrifice. If it does, until the end of the phase, each time a model in that unit makes an attack, add 1 to the Wound roll. At the end of the phase, that TZEENTCH MUTANT unit suffers D3 mortal wounds. KEYWORDS Tzaangors units from your army have the BATTLELINE keyword, and while such a unit is not Battle-shocked, add 1 to the Objective Control characteristic of TZAANGOR models in that unit."}],"enhancements":[{"name":"Warpmeld Dagger","description":"Tzaangor Shaman model only. Each time the bearer attempts a Ritual, just before determining the Psychic test result, the bearer can use this Enhancement. If it does, the bearer suffers D3 mortal wounds; if it is not destroyed as a result, add 1 to that Psychic test result for each of those mortal wounds suffered.","cost":"10"},{"name":"Diamond of Distortion","description":"Tzaangor Shaman model only. While the bearer is leading a unit, each time an attack targets that unit, subtract 1 from the Hit roll.","cost":"20"},{"name":"Bray Lord","description":"Sorcerer or Infernal Master model only. The bearer has the Scouts 6\" ability. During the Declare Battle Formations step, the bearer can be attached to a Tzaangors unit.","cost":"15"},{"name":"Flowing Flesh","description":"Tzaangor Shaman model only. The bearer has the Feel No Pain 4+ ability and a Wounds characteristic of 5.","cost":"10"}],"stratagems":[{"name":"GIFT OF CHANGE","type":"Warpmeld Pact – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One Thousand Sons Character model from your army (excluding Monsters) that was just destroyed. You can use this Stratagem on that model even though it was just destroyed. EFFECT: At the end of the phase, add one Tzeentch Chaos Spawn unit containing one model to your army, and set it up as close as possible to where your model was destroyed and not within Engagement Range of one or more enemy units. RESTRICTIONS: You can only use this Stratagem once per battle round."},{"name":"WARPED VICISSITUDE","type":"Warpmeld Pact – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Tzaangors unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have a 4+ invulnerable save."},{"name":"TWISTED MIRAGE","type":"Warpmeld Pact – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Reinforcements step of your Movement phase. TARGET: One Tzeentch Mutant unit from your army that is arriving from Strategic Reserves this phase. EFFECT: Your unit can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units, or anywhere on the battlefield that is more than 9\" horizontally away from all enemy units if it is a Monster unit. In either case, until the end of the turn, it is not eligible to declare a charge."},{"name":"BLESSED TRANSMUTATIONS","type":"Warpmeld Pact – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Thousand Sons Psyker model from your army, and one friendly Tzaangors unit that is below its Starting Strength and within 12\" of that PSYKER model. EFFECT: Return up to D3+1 destroyed models (excluding Characters) to your TZAANGORS unit."},{"name":"DERANGED FEROCITY","type":"Warpmeld Pact – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a Tzeentch Mutant unit from your army is selected to fight. TARGET: That TZEENTCH MUTANT unit. EFFECT: Until the end of the phase, each time a model in your unit makes a Pile-in or Consolidation move, it can move up to 6\" instead of up to 3\", and when determining which models in it are eligible to fight, any models in it that are within 3\" of one or more enemy models are eligible to fight. When resolving those attacks, such models can target one of those enemy units that is within 3\" of them and within Engagement Range of their unit."},{"name":"TOUCHED BY TZEENTCH","type":"Warpmeld Pact – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Start of your Movement phase. TARGET: One Tzeentch Mutant unit from your army. EFFECT: Until the end of the turn, your unit is eligible to shoot or declare a charge in a turn in which it Advanced."}]}],"datasheets":[{"id":"000001032","name":"Ahriman","role":"Characters","loadout":"This model is equipped with: inferno bolt pistol; Transmogrifying Blast; Black Staff of Ahriman.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Ahriman","m":"10\"","t":"4","sv":"3+","invSv":"4","w":"6","ld":"6+","oc":"2"}],"weapons":[{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Transmogrifying Blast","type":"Ranged","profiles":[{"name":"Transmogrifying Blast","range":"18","type":"Ranged","a":"D6+1","bsWs":"2","s":"6","ap":"-1","d":"D3","desc":"blast, psychic"}]},{"name":"Black Staff of Ahriman","type":"Melee","profiles":[{"name":"Black Staff of Ahriman","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"7","ap":"-1","d":"3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Scryer of Fates (Psychic)","description":"If your army includes this model, after both players have deployed their armies, you can select up to three Thousand Sons units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.","type":"Datasheet"},{"name":"Arch-Sorcerer of Tzeentch (Psychic)","description":"Each time this model attempts a Ritual, add 1 to the Psychic test result.","type":"Datasheet"}],"keywords":["Tzeentch","Fly","Epic Hero","Character","Ahriman","Infantry","Psyker","Chaos","Mounted"],"factionKeywords":["Thousand Sons",""],"composition":["1 Ahriman – EPIC HERO"],"points":[{"models":"1 model","cost":"100"}],"canLead":["000004122","000001474","000001020"],"ledBy":[]},{"id":"000004128","name":"Blue Horrors","role":"Battleline","loadout":"Every Blue Horror is equipped with: coruscating blue flames; blue claws. Every Brimstone Horror added to this unit using the Split ability is equipped with: coruscating yellow flames; yellow claws.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Blue Horrors/Brimstone Horror","m":"6\"","t":"3","sv":"7+","invSv":"4","w":"1","ld":"8+","oc":"0"}],"weapons":[{"name":"Coruscating blue flames","type":"Ranged","profiles":[{"name":"Coruscating blue flames","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"3","ap":"-1","d":"1","desc":"pistol, psychic"}]},{"name":"Coruscating yellow flames","type":"Ranged","profiles":[{"name":"Coruscating yellow flames","range":"18","type":"Ranged","a":"2","bsWs":"5","s":"2","ap":"-1","d":"1","desc":"pistol, psychic"}]},{"name":"Blue claws","type":"Melee","profiles":[{"name":"Blue claws","range":"Melee","type":"Melee","a":"1","bsWs":"5","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Yellow claws","type":"Melee","profiles":[{"name":"Yellow claws","range":"Melee","type":"Melee","a":"2","bsWs":"5","s":"2","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"Split","description":"Each time a BLUE HORROR model in this unit is destroyed, after the attacking unit has finished making its attacks, if this unit is not destroyed, roll one D6 for that model. On a 4+, add one BRIMSTONE HORROR model to this unit.","type":"Datasheet"},{"name":"Sullen Malevolence (Aura)","description":"While an enemy unit is within 6\" of this unit, if this unit contains one or more BLUE HORROR models, worsen the Leadership characteristic of models in that enemy unit by 1.","type":"Datasheet"},{"name":"Exploding Horrors","description":"Each time this unit is selected to fight, you can select one enemy unit within Engagement Range of it, then select one or more BRIMSTONE HORROR models in this unit. For each BRIMSTONE HORROR model you select, roll one D6: on a 4+, that model is destroyed and that enemy unit suffers 1 mortal wound.","type":"Datasheet"}],"keywords":["Infantry","Battleline","Chaos","Daemon","Tzeentch","Horrors","Summoned","Brimstone","Blue"],"factionKeywords":["Scintillating Legions",""],"composition":["10 Blue Horrors"],"points":[{"models":"10 models","cost":"90"}],"canLead":[],"ledBy":[]},{"id":"000003627","name":"Cerberus","role":"Other","loadout":"This model is equipped with: Cerberus neutron pulse array; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Cerberus","m":"10\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"6+","oc":"6"}],"weapons":[{"name":"Lascannon","type":"Ranged","profiles":[{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Cerberus neutron pulse array","range":"48","type":"Ranged","a":"3","bsWs":"3","s":"16","ap":"-4","d":"D6+3","desc":"twin-linked"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"torrent, ignores cover"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Atomantic Arc-reactor","description":"Each time this unit shoots its Cerberus neutron pulse array in your Shooting phase, provided it Remained Stationary this turn, that weapon has the [LETHAL HITS] ability.","type":"Datasheet"}],"keywords":["Chaos","Vehicle","Cerberus","Smoke","Tzeentch","Chaos","Vehicle","Smoke","Tzeentch","Tzeentch","Chaos","Vehicle","Cerberus","Smoke","Cerberus","Vehicle","Chaos","Cerberus","Tzeentch","Smoke"],"factionKeywords":["","Thousand Sons"],"composition":["1 Cerberus"],"points":[{"models":"1 model","cost":"270"}],"canLead":[],"ledBy":[]},{"id":"000001025","name":"Chaos Land Raider","role":"Other","loadout":"This model is equipped with: 2 soulshatter lascannons; twin inferno heavy bolter; armoured tracks.","transport":"This model has a transport capacity of 14 Thousand Sons Infantry models. Each Terminator model takes up the space of 2 models.","damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Land Raider","m":"10\"","t":"12","sv":"2+","invSv":"-","w":"16","ld":"6+","oc":"5"}],"weapons":[{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Soulshatter lascannon","type":"Ranged","profiles":[{"name":"Soulshatter lascannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null}]},{"name":"Twin inferno heavy bolter","type":"Ranged","profiles":[{"name":"Twin inferno heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"sustained hits 1, twin-linked"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assault Ramp","description":"Each time a unit disembarks from this TRANSPORT after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"}],"keywords":["Land Raider","Chaos","Tzeentch","Vehicle","Transport","Smoke"],"factionKeywords":["","Thousand Sons"],"composition":["1 Chaos Land Raider"],"points":[{"models":"1 model","cost":"220"}],"canLead":[],"ledBy":[]},{"id":"000003597","name":"Chaos Lord On Disc Of Tzeentch","role":"Characters","loadout":"This model is equipped with: bolt pistol; Astartes chainsword; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Chaos Lord On Disc Of Tzeentch","m":"12\"","t":"4","sv":"3+","invSv":"4","w":"6","ld":"6+","oc":"1"}],"weapons":[{"name":"Plasma pistol – supercharge","type":"Ranged","profiles":[{"name":"Plasma pistol – supercharge","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"8","ap":"-3","d":"2","desc":"hazardous, pistol"},{"name":"Combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"2","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"},{"name":"Plasma pistol – standard","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"7","ap":"-2","d":"1","desc":"pistol"},{"name":"Astartes chainsword","range":"Melee","type":"Melee","a":"7","bsWs":"2","s":"4","ap":"-1","d":"1","desc":null},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"4","ap":"0","d":"1","desc":null},{"name":"Paired accursed weapons","range":"Melee","type":"Melee","a":"7","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"twin-linked"},{"name":"Power fist","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"8","ap":"-2","d":"2","desc":null},{"name":"Accursed weapon","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"5","ap":"-2","d":"1","desc":null},{"name":"Bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"0","d":"1","desc":"pistol"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Lord of Chaos","description":"Once per battle round, one unit from your army with this ability can use it when its unit is targeted with a Stratagem. If it does, reduce the CP cost of that use of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Lord of Fate","description":"While this model is leading a unit, models in that unit have the Feel No Pain 5+ ability against mortal wounds.","type":"Datasheet"}],"keywords":["Infantry","Character","Grenades","Chaos","Tzeentch","Fly","Chaos Lord","Disc of Tzeentch"],"factionKeywords":["","Thousand Sons"],"composition":["1 Chaos Lord on Disc of Tzeentch"],"points":[{"models":"1 model","cost":"100"}],"canLead":["000001020"],"ledBy":[]},{"id":"000002501","name":"Chaos Predator Annihilator","role":"Other","loadout":"This model is equipped with: Predator twin lascannon; armoured tracks.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Predator Annihilator","m":"10\"","t":"10","sv":"3+","invSv":"-","w":"11","ld":"6+","oc":"3"}],"weapons":[{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Inferno heavy bolter","type":"Ranged","profiles":[{"name":"Inferno heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"sustained hits 1"}]},{"name":"Lascannon","type":"Ranged","profiles":[{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null}]},{"name":"Predator twin lascannon","type":"Ranged","profiles":[{"name":"Predator twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"14","ap":"-3","d":"D6+1","desc":"twin-linked"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Ensorcelled Annihilation","description":"Each time this model makes a ranged attack that targets a MONSTER or VEHICLE unit that was hit by one or more Psychic Attacks made by a Thousand Sons Psyker model from your army this phase (including the Doombolt Ritual), you can re-roll the Hit roll and you can re-roll the Damage roll.","type":"Datasheet"}],"keywords":["Chaos","Smoke","Vehicle","Tzeentch","Predator Annihilator"],"factionKeywords":["Thousand Sons",""],"composition":["1 Chaos Predator Annihilator"],"points":[{"models":"1 model","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000001026","name":"Chaos Predator Destructor","role":"Other","loadout":"This model is equipped with: Predator autocannon; armoured tracks.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Predator Destructor","m":"10\"","t":"10","sv":"3+","invSv":"-","w":"11","ld":"6+","oc":"3"}],"weapons":[{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Inferno heavy bolter","type":"Ranged","profiles":[{"name":"Inferno heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"sustained hits 1"}]},{"name":"Lascannon","type":"Ranged","profiles":[{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null}]},{"name":"Predator autocannon","type":"Ranged","profiles":[{"name":"Predator autocannon","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"rapid fire 2"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Ensorcelled Destruction","description":"Each time this model makes a ranged attack that targets a unit (excluding MONSTERS and VEHICLES) that was hit by one or more Psychic Attacks made by a Thousand Sons Psyker model from your army this phase (including the Doombolt Ritual), improve the Strength and Armour Penetration characteristics of that attack by 1.","type":"Datasheet"}],"keywords":["Predator Destructor","Tzeentch","Vehicle","Smoke","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Chaos Predator Destructor"],"points":[{"models":"1 model","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000001022","name":"Chaos Rhino","role":"Dedicated Transports","loadout":"This model is equipped with: inferno combi-bolter; armoured tracks.","transport":"This model has a transport capacity of 12 Thousand Sons Infantry models (excluding TERMiNATOR models).","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Rhino","m":"12\"","t":"9","sv":"3+","invSv":"-","w":"10","ld":"6+","oc":"2"}],"weapons":[{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Firing Deck","description":"FIRING DECKSome transports have firing hatches, ports or platforms from which embarked passengers can shoot.Some TRANSPORT models have ‘Firing Deck x’ listed in their abilities. Each time such a model is selected to shoot in the Shooting phase, you can select up to ‘x’ models embarked within it whose units have not already shot this phase. Then, for each of those embarked models, you can select one ranged weapon that embarked model is equipped with (excluding weapons with the [ONE SHOT] ability). Until that TRANSPORT model has resolved all of its attacks, it counts as being equipped with all of the weapons you selected in this way, in addition to its other weapons. Until the end of the phase, those selected models’ units are not eligible to shoot. Firing Deck ‘x’: Each time this TRANSPORT shoots, select one weapon (excluding weapons with the [ONE SHOT] ability) from up to ‘x’ models embarked within it whose units have not shot this phase; this TRANSPORT counts as being equipped with those weapons as well. Until the end of the phase, those selected models’ units are not eligible to shoot.","type":"Core"},{"name":"Sorcerous Support","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly model that disembarked from this TRANSPORT this turn makes a Psychic Attack that targets that enemy unit, add 1 to the Hit roll and add 1 to the Wound roll.","type":"Datasheet"}],"keywords":["Tzeentch","Rhino","Vehicle","Transport","Dedicated Transport","Smoke","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Chaos Rhino"],"points":[{"models":"1 model","cost":"90"}],"canLead":[],"ledBy":[]},{"id":"000001023","name":"Chaos Spawn","role":"Other","loadout":"Every model is equipped with: hideous mutations.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Spawn","m":"8\"","t":"5","sv":"4+","invSv":"5","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Hideous mutations","type":"Melee","profiles":[{"name":"Hideous mutations","range":"Melee","type":"Melee","a":"D6+2","bsWs":"4","s":"5","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Regenerating Monstrosities","description":"At the start of each player’s Command phase, one model in this unit regains up to 3 lost wounds.","type":"Datasheet"}],"keywords":["Beast","Chaos","Tzeentch","Mutant","Chaos Spawn"],"factionKeywords":["Thousand Sons",""],"composition":["2 Chaos Spawn"],"points":[{"models":"2 models","cost":"65"}],"canLead":[],"ledBy":[]},{"id":"000003591","name":"Chaos Thunderhawk","role":"Other","loadout":"This model is equipped with: 2 lascannons; Thunderhawk heavy cannon; 4 twin heavy bolters; armoured hull; Thunderhawk cluster bombs.","transport":"This model has a transport capacity of 30 Thousand Sons Infantry or Thousand Sons Mounted models. Each Jump Pack, Possessed and Terminator model takes up the space of 2 models. Each Obliterator model takes up the space of 3 models. Each MOUNTED model takes up the space of 4 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Chaos Thunderhawk","m":"20+\"","t":"12","sv":"2+","invSv":"-","w":"30","ld":"6+","oc":"0"}],"weapons":[{"name":"Armoured hull","type":"Melee","profiles":[{"name":"Armoured hull","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Hellstrike missile battery","range":"72","type":"Ranged","a":"4","bsWs":"3","s":"8","ap":"-2","d":"3","desc":"anti-fly 4+"},{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Thunderhawk heavy cannon","range":"48","type":"Ranged","a":"D6+6","bsWs":"3","s":"10","ap":"-2","d":"3","desc":"blast"},{"name":"Turbo-laser destructor","range":"96","type":"Ranged","a":"D3+1","bsWs":"3","s":"20","ap":"-4","d":"D6+6","desc":"blast"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Thunderhawk Cluster Bombs","description":"Each time the bearer ends a Normal move, you can select one enemy unit it moved over during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound.","type":"Wargear"},{"name":"Aerial Assault","description":"Each time a unit with the Deep Strike ability disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"}],"keywords":["Titanic","Thunderhawk","Chaos","Transport","Aircraft","Fly","Vehicle"],"factionKeywords":["","Thousand Sons"],"composition":["1 Chaos Thunderhawk"],"points":[{"models":"1 model","cost":"840"}],"canLead":[],"ledBy":[]},{"id":"000001027","name":"Chaos Vindicator","role":"Other","loadout":"This model is equipped with: demolisher cannon; armoured tracks.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Chaos Vindicator","m":"9\"","t":"11","sv":"2+","invSv":"-","w":"11","ld":"6+","oc":"3"}],"weapons":[{"name":"Demolisher cannon","type":"Ranged","profiles":[{"name":"Demolisher cannon","range":"24","type":"Ranged","a":"D6+3","bsWs":"3","s":"14","ap":"-3","d":"D6","desc":"blast"}]},{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Siege Shield","description":"When making ranged attacks with its demolisher cannon, this model can target enemy units within Engagement Range of it (provided no other friendly units are also within Engagement Range of that enemy unit). In addition, when making ranged attacks, this model does not suffer the penalty to its Hit rolls for being within Engagement Range of one or more enemy units.","type":"Datasheet"}],"keywords":["Vindicator","Tzeentch","Chaos","Smoke","Vehicle"],"factionKeywords":["Thousand Sons",""],"composition":["1 Chaos Vindicator"],"points":[{"models":"1 model","cost":"185"}],"canLead":[],"ledBy":[]},{"id":"000001036","name":"Daemon Prince of Tzeentch","role":"Characters","loadout":"This model is equipped with: Dark Blessing; infernal cannon; heliforged weapons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Daemon Prince of Tzeentch","m":"9\"","t":"10","sv":"2+","invSv":"4","w":"10","ld":"6+","oc":"3"}],"weapons":[{"name":"Dark Blessing","type":"Ranged","profiles":[{"name":"Dark Blessing","range":"24","type":"Ranged","a":"9","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"ignores cover, psychic, sustained hits 1"}]},{"name":"Infernal cannon","type":"Ranged","profiles":[{"name":"Infernal cannon","range":"24","type":"Ranged","a":"3","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Hellforged weapons – strike","type":"Melee","profiles":[{"name":"Hellforged weapons – strike","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"8","ap":"-2","d":"3","desc":"devastating wounds, psychic"}]},{"name":"Hellforged weapons – sweep","type":"Melee","profiles":[{"name":"Hellforged weapons – sweep","range":"Melee","type":"Melee","a":"12","bsWs":"2","s":"6","ap":"-1","d":"1","desc":"devastating wounds, psychic"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Servile Pawns","description":"While this model is within 3\" of one or more friendly Thousand Sons Infantry units, this model has the Lone Operative ability.","type":"Datasheet"},{"name":"Spirit Snare","description":"Each time a friendly Thousand Sons Psyker model with the Cabal of Sorcerers ability is destroyed while within 9\" of one or more models with this ability, select one of those models with this ability: until the end of the battle, each time the selected model attempts a Ritual, add 1 to the Psychic test result (to a maximum of +2).","type":"Datasheet"},{"name":"Glamour of Tzeentch (Aura, Psychic)","description":"While a friendly Thousand Sons Infantry unit is within 6\" of this model, models in that unit have the Stealth ability.","type":"Datasheet"}],"keywords":["Chaos","Daemon","Character","Monster","Psyker","Daemon Prince","Tzeentch"],"factionKeywords":["Thousand Sons",""],"composition":["1 Daemon Prince of Tzeentch"],"points":[{"models":"1 model","cost":"180"}],"canLead":[],"ledBy":[]},{"id":"000004120","name":"Daemon Prince of Tzeentch with Wings","role":"Characters","loadout":"This model is equipped with: Dark Blessing; infernal cannon; heliforged weapons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Daemon Prince of Tzeentch with Wings","m":"13\"","t":"9","sv":"2+","invSv":"4","w":"10","ld":"6+","oc":"3"}],"weapons":[{"name":"Dark Blessing","type":"Ranged","profiles":[{"name":"Dark Blessing","range":"24","type":"Ranged","a":"9","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"ignores cover, psychic, sustained hits 1"}]},{"name":"Infernal cannon","type":"Ranged","profiles":[{"name":"Infernal cannon","range":"24","type":"Ranged","a":"3","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]},{"name":"Hellforged weapons – strike","type":"Melee","profiles":[{"name":"Hellforged weapons – strike","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"8","ap":"-2","d":"3","desc":"devastating wounds, psychic"}]},{"name":"Hellforged weapons – sweep","type":"Melee","profiles":[{"name":"Hellforged weapons – sweep","range":"Melee","type":"Melee","a":"12","bsWs":"2","s":"6","ap":"-1","d":"1","desc":"devastating wounds, psychic"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Hunter of Souls","description":"Each time this model makes an attack that targets a CHARACTER unit, re-roll a Hit roll of 1 and re-roll a Wound roll of 1 (if that attack targets a PSYKER CHARACTER unit, you can re-roll the Hit roll and you can re-roll the Wound roll instead). Each time this model destroys a CHARACTER unit, this model regains up to D3 lost wounds (if that CHARACTER unit was a PSYKER unit, this model regains up to 3 lost wounds instead).","type":"Datasheet"},{"name":"Aetherstride (Psychic)","description":"In your Movement phase, when this model is set up on the battlefield using the Deep Strike ability, it can perform an aetherstride. If it does: It can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units.Until the end of the turn, its Dark Blessing has the [SUSTAINED HITS D3] ability.Until the end of the turn, it is not eligible to declare a charge.","type":"Datasheet"}],"keywords":["Daemon Prince","Tzeentch","Chaos","Psyker","Daemon","Fly","Monster","Character"],"factionKeywords":["Thousand Sons",""],"composition":["1 Daemon Prince of Tzeentch with Wings"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000001030","name":"Defiler","role":"Other","loadout":"This model is equipped with: Defiler cannon; reaper autocannon; twin heavy flamer; Defiler claws.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Defiler","m":"8\"","t":"10","sv":"3+","invSv":"5","w":"14","ld":"6+","oc":"5"}],"weapons":[{"name":"Defiler cannon","type":"Ranged","profiles":[{"name":"Defiler cannon","range":"48","type":"Ranged","a":"D6+3","bsWs":"3","s":"10","ap":"-1","d":"3","desc":"blast"}]},{"name":"Havoc launcher","type":"Ranged","profiles":[{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"}]},{"name":"Reaper autocannon","type":"Ranged","profiles":[{"name":"Reaper autocannon","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"7","ap":"-2","d":"1","desc":"DEVASTATING WOUNDS, SUSTAINED HITS 1"}]},{"name":"Twin heavy flamer","type":"Ranged","profiles":[{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-2","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Twin inferno heavy bolter","type":"Ranged","profiles":[{"name":"Twin inferno heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"SUSTAINED HITS 1, TWIN-LINKED"}]},{"name":"Twin lascannon","type":"Ranged","profiles":[{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"TWIN-LINKED"}]},{"name":"Defiler claws","type":"Melee","profiles":[{"name":"Defiler claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"16","ap":"-3","d":"D6+1","desc":null}]},{"name":"Defiler scourge","type":"Melee","profiles":[{"name":"Defiler scourge","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"12","ap":"-1","d":"2","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Scuttling Walker","description":"Each time this model makes a Normal, Advance or Fall Back move, it can move through friendly Monster and Vehicle models and sections of terrain features that are 4\" or less in height.","type":"Datasheet"},{"name":"Destroyer of Futures","description":"Each time you target this unit with the Fire Overwatch Stratagem, hits are scored on unmodified Hit rolls of 5+ when resolving that Stratagem. For each of those attacks that targets an enemy unit within 9\" of one or more Thousand Sons Psyker units from your army, a hit is scored on an unmodified Hit roll of 4+ instead.","type":"Datasheet"}],"keywords":["Vehicle","Tzeentch","Defiler","Daemon","Walker","Smoke","Chaos"],"factionKeywords":["","Thousand Sons"],"composition":["1 Defiler"],"points":[{"models":"1 model","cost":"165"}],"canLead":[],"ledBy":[]},{"id":"000003623","name":"Deredeo Dreadnought","role":"Other","loadout":"This model is equipped with: anvilus autocannon battery; twin heavy bolter; armoured feet.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Deredeo Dreadnought","m":"6\"","t":"9","sv":"2+","invSv":"5","w":"12","ld":"6+","oc":"3"}],"weapons":[{"name":"Volkite falconet battery","type":"Ranged","profiles":[{"name":"Volkite falconet battery","range":"30","type":"Ranged","a":"6","bsWs":"3","s":"9","ap":"0","d":"2","desc":"devastating wounds"},{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Hellfire plasma cannonade – supercharge","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"8","ap":"-3","d":"3","desc":"hazardous"},{"name":"Boreas air defence missiles","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"anti-fly 2+"},{"name":"Arachnus heavy lascannon battery","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Anvilus autocannon battery","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"twin-linked"},{"name":"Aiolos missile launcher","range":"48","type":"Ranged","a":"D6+3","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"},{"name":"Hellfire plasma cannonade – standard","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"7","ap":"-2","d":"2","desc":null},{"name":"Armoured feet","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deredeo Strike","description":"Each time this model makes a ranged attack that targets a unit that is not Below Half-strength, you can re-roll the Hit roll.","type":"Datasheet"}],"keywords":["Smoke","Tzeentch","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Deredeo Dreadnought","Dreadnought"],"factionKeywords":["Thousand Sons",""],"composition":["1 Deredeo Dreadnought"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000001033","name":"Exalted Sorcerer","role":"Characters","loadout":"This model is equipped with: Astral Blast; inferno bolt pistol; force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Exalted Sorcerer","m":"6\"","t":"4","sv":"3+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Astral Blast","type":"Ranged","profiles":[{"name":"Astral Blast","range":"18","type":"Ranged","a":"D6","bsWs":"2","s":"6","ap":"-2","d":"D3","desc":"blast, devastating wounds, psychic"}]},{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"6","ap":"-1","d":"D3","desc":"psychic"}]},{"name":"Prosperine khopesh","type":"Melee","profiles":[{"name":"Prosperine khopesh","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Arcane Shield (Psychic)","description":"While this model is leading a unit, models in that unit have a 4+ invulnerable save.","type":"Datasheet"},{"name":"Rebind Rubricae (Psychic)","description":"In your Command phase, if this model is leading a unit, you can roll one D6: on a 1, that unit suffers D3 mortal wounds; on a 2-5, you can return 1 destroyed Bodyguard model to that unit; on a 6, you can return up to 2 destroyed Bodyguard models to that unit.","type":"Datasheet"}],"keywords":["Infantry","Psyker","Exalted Sorcerer","Tzeentch","Chaos","Grenades","Character"],"factionKeywords":["","Thousand Sons"],"composition":["1 Exalted Sorcerer"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000001020"],"ledBy":[]},{"id":"000002755","name":"Exalted Sorcerer on Disc of Tzeentch","role":"Characters","loadout":"This model is equipped with: Arcane Fire; inferno bolt pistol; force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Exalted Sorcerer on Disc of Tzeentch","m":"10\"","t":"4","sv":"3+","invSv":"4","w":"6","ld":"6+","oc":"2"}],"weapons":[{"name":"Arcane Fire","type":"Ranged","profiles":[{"name":"Arcane Fire","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-2","d":"D3","desc":"ignores cover, psychic, torrent"}]},{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"6","ap":"-1","d":"D3","desc":"psychic"}]},{"name":"Prosperine khopesh","type":"Melee","profiles":[{"name":"Prosperine khopesh","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Illusions of Tzeentch (Psychic)","description":"While this model is leading a unit, that unit can only be selected as the target of a ranged attack if the attacking model is within 18\".","type":"Datasheet"},{"name":"Binding Tendrils (Psychic)","description":"In your Shooting phase, after this model has shot, select one enemy INFANTRY unit hit by one or more of those attacks made with Arcane Fire. Until the start of your next turn, that unit is ensnared. While a unit is ensnared, subtract 2\" from its Move characteristic and subtract 2 from Charge rolls made for it.","type":"Datasheet"}],"keywords":["Tzeentch","Grenades","Fly","Character","Exalted Sorcerer","Mounted","Psyker","Chaos","Infantry"],"factionKeywords":["Thousand Sons",""],"composition":["1 Exalted Sorcerer"],"points":[{"models":"1 model","cost":"100"}],"canLead":["000004122","000001474","000001020"],"ledBy":[]},{"id":"000003687","name":"Falchion","role":"Other","loadout":"This model is equipped with: 2 quad lascannons; twin heavy bolter; twin Falchion volcano cannon; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Falchion","m":"9\"","t":"13","sv":"2+","invSv":"-","w":"24","ld":"6+","oc":"8"}],"weapons":[{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Laser destroyer","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":"heavy"},{"name":"Quad lascannon","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Twin Falchion volcano cannon","range":"120","type":"Ranged","a":"D3+1","bsWs":"3","s":"24","ap":"-5","d":"12","desc":"blast, twin-linked"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Titan-killer","description":"Each time this model makes a ranged attack with its twin Falchion volcano cannon that targets a MONSTER or VEHICLE unit, that attack has the [DEVASTATING WOUNDS] ability.","type":"Datasheet"}],"keywords":["Falchion","Vehicle","Titanic","Tzeentch","Smoke","Falchion","Chaos","Chaos","Tzeentch","Smoke","Falchion","Titanic","Vehicle","Titanic","Chaos","Tzeentch","Smoke","Falchion","Vehicle","Titanic","Chaos","Vehicle","Titanic","Chaos","Tzeentch","Smoke","Falchion","Vehicle","Tzeentch","Smoke"],"factionKeywords":["Thousand Sons",""],"composition":["1 Falchion"],"points":[{"models":"1 model","cost":"420"}],"canLead":[],"ledBy":[]},{"id":"000003651","name":"Fellblade","role":"Other","loadout":"This model is equipped with: demolisher cannon; Fellblade accelerator cannon; 2 quad lascannons; twin heavy bolter; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Fellblade","m":"9\"","t":"13","sv":"2+","invSv":"-","w":"24","ld":"6+","oc":"8"}],"weapons":[{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Quad heavy bolter","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"},{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"},{"name":"","range":"","type":"","a":"0","bsWs":"3","s":"-","ap":"0","d":"-","desc":null},{"name":"Laser destroyer","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":"heavy"},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Quad lascannon","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Fellblade accelerator cannon – HE shells","range":"72","type":"Ranged","a":"2D6","bsWs":"3","s":"8","ap":"-1","d":"2","desc":"blast"},{"name":"Demolisher cannon","range":"24","type":"Ranged","a":"D6+3","bsWs":"3","s":"14","ap":"-3","d":"D6","desc":"blast"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Fellblade accelerator cannon – AP shells","range":"72","type":"Ranged","a":"2","bsWs":"3","s":"14","ap":"-3","d":"6","desc":null}]},{"name":"Combi-weapon","type":"Ranged","profiles":[{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Rolling Fortress","description":"Each time a ranged attack is allocated to a model from your army, if that model is not fully visible to every model in the attacking unit because of this Fellblade model, that model has the Benefit of Cover against that attack.","type":"Datasheet"}],"keywords":["Tzeentch","Smoke","Fellblade","Vehicle","Titanic","Chaos","Smoke","Fellblade","Vehicle","Titanic","Fellblade","Smoke","Titanic","Smoke","Chaos","Tzeentch","Chaos","Titanic","Tzeentch","Vehicle","Fellblade","Tzeentch","Vehicle","Titanic","Chaos","Tzeentch","Chaos","Smoke","Fellblade","Vehicle"],"factionKeywords":["Thousand Sons",""],"composition":["1 Fellblade"],"points":[{"models":"1 model","cost":"480"}],"canLead":[],"ledBy":[]},{"id":"000003615","name":"Fire Raptor Gunship","role":"Other","loadout":"This model is equipped with: twin avenger bolt cannon; 2 twin autocannons; 2 twin hellstrike launchers; armoured hull","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Fire Raptor Gunship","m":"20+\"","t":"10","sv":"3+","invSv":"-","w":"18","ld":"6+","oc":"0"}],"weapons":[{"name":"Twin avenger bolt cannon","type":"Ranged","profiles":[{"name":"Twin avenger bolt cannon","range":"36","type":"Ranged","a":"10","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"twin-linked"},{"name":"Twin hellstrike launcher","range":"72","type":"Ranged","a":"2","bsWs":"3","s":"10","ap":"-3","d":"D6","desc":"anti-fly 2+, twin-linked"},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"},{"name":"Armoured hull","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Quad heavy bolter","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"twin-linked, sustained hits 1"},{"name":"Twin autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Strafing Run","description":"Each time this model makes a ranged attack that targets a unit that cannot Fly, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Fly","Vehicle","Aircraft","Chaos","Tzeentch","Aircraft","Vehicle","Fly","Aircraft","Fire Raptor Gunship","Fire Raptor Gunship","Chaos","Vehicle","Fire Raptor Gunship","Tzeentch","Chaos","Aircraft","Fly","Aircraft","Chaos","Tzeentch","Fire Raptor Gunship","Fly","Vehicle","Fire Raptor Gunship","Tzeentch","Chaos","Aircraft","Fly","Vehicle","Tzeentch","Fire Raptor Gunship","Vehicle","Fly","Chaos","Tzeentch"],"factionKeywords":["","Thousand Sons"],"composition":["1 Fire Raptor Gunship"],"points":[{"models":"1 model","cost":"290"}],"canLead":[],"ledBy":[]},{"id":"000004125","name":"Flamers","role":"Other","loadout":"Every model is equipped with: flickering flames; Flamer mouths.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Flamers","m":"9\"","t":"4","sv":"7+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Flickering flames","type":"Ranged","profiles":[{"name":"Flickering flames","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"ignores cover, psychic, torrent"}]},{"name":"Flamer mouths","type":"Melee","profiles":[{"name":"Flamer mouths","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"Bounding Leaps","description":"This unit is eligible to shoot in a turn in which it Fell Back.","type":"Datasheet"}],"keywords":["Flamers","Summoned","Daemon","Chaos","Fly","Infantry","Tzeentch"],"factionKeywords":["Scintillating Legions",""],"composition":["1 Pyrocaster","2-5 Flamers"],"points":[{"models":"3 models","cost":"65"},{"models":"6 models","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000001028","name":"Forgefiend","role":"Other","loadout":"This model is equipped with: 2 Hades autocannons; 1 Forgefiend jaws.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Forgefiend","m":"8\"","t":"10","sv":"3+","invSv":"5","w":"12","ld":"6+","oc":"3"}],"weapons":[{"name":"Ectoplasma cannon","type":"Ranged","profiles":[{"name":"Ectoplasma cannon","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"10","ap":"-3","d":"3","desc":"blast"}]},{"name":"Hades autocannon","type":"Ranged","profiles":[{"name":"Hades autocannon","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Forgefiend claws","type":"Melee","profiles":[{"name":"Forgefiend claws","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"6","ap":"0","d":"1","desc":null}]},{"name":"Forgefiend jaws","type":"Melee","profiles":[{"name":"Forgefiend jaws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"7","ap":"0","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Blazing Salvoes","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the start of your next turn, that enemy unit is suppressed. While a unit is suppressed, each time a model in that unit makes an attack, subtract 1 from the Hit roll.","type":"Datasheet"}],"keywords":["Walker","Vehicle","Daemon","Forgefiend","Tzeentch","Chaos"],"factionKeywords":["","Thousand Sons"],"composition":["1 Forgefiend"],"points":[{"models":"1 model","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000001021","name":"Helbrute","role":"Other","loadout":"This model is equipped with: missile launcher; multi-melta; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Helbrute","m":"8\"","t":"9","sv":"2+","invSv":"5","w":"8","ld":"6+","oc":"3"}],"weapons":[{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-2","d":"1","desc":"ignores cover, torrent"}]},{"name":"Helbrute plasma cannon","type":"Ranged","profiles":[{"name":"Helbrute plasma cannon","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"8","ap":"-3","d":"3","desc":"blast, hazardous"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Missile launcher – frag","type":"Ranged","profiles":[{"name":"Missile launcher – frag","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"}]},{"name":"Missile launcher – krak","type":"Ranged","profiles":[{"name":"Missile launcher – krak","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null}]},{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Twin autocannon","type":"Ranged","profiles":[{"name":"Twin autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-2","d":"3","desc":"twin-linked"}]},{"name":"Twin inferno heavy bolter","type":"Ranged","profiles":[{"name":"Twin inferno heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"sustained hits 1, twin-linked"}]},{"name":"Twin lascannon","type":"Ranged","profiles":[{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"0","d":"1","desc":null}]},{"name":"Helbrute fist","type":"Melee","profiles":[{"name":"Helbrute fist","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"12","ap":"-2","d":"3","desc":null}]},{"name":"Helbrute hammer","type":"Melee","profiles":[{"name":"Helbrute hammer","range":"Melee","type":"Melee","a":"5","bsWs":"4","s":"14","ap":"-3","d":"D6+1","desc":null}]},{"name":"Power scourge","type":"Melee","profiles":[{"name":"Power scourge","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Terrifying Assault","description":"In your Shooting phase and the Fight phase, after this model has shot or fought, select one enemy unit hit by one or more of those attacks. That unit must take a Battle-shock test, subtracting 1 from that test if it is within 9\" of one or more Thousand Sons Psyker units from your army.","type":"Datasheet"},{"name":"Devoted to Destruction","description":"If this model is equipped with two melee weapons in addition to its close combat weapon, add 2 to the Attacks characteristic of those two weapons.","type":"Datasheet"}],"keywords":["Tzeentch","Walker","Chaos","Vehicle","Helbrute"],"factionKeywords":["Thousand Sons",""],"composition":["1 Helbrute"],"points":[{"models":"1 model","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000001024","name":"Heldrake","role":"Other","loadout":"This model is equipped with: Hades autocannon; Heldrake claws.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Heldrake","m":"20+\"","t":"9","sv":"3+","invSv":"5","w":"12","ld":"6+","oc":"0"}],"weapons":[{"name":"Baleflamer","type":"Ranged","profiles":[{"name":"Baleflamer","range":"12","type":"Ranged","a":"D6+3","bsWs":"N/A","s":"6","ap":"-2","d":"2","desc":"ignores cover, torrent"}]},{"name":"Hades autocannon","type":"Ranged","profiles":[{"name":"Hades autocannon","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"8","ap":"-2","d":"2","desc":null}]},{"name":"Heldrake claws","type":"Melee","profiles":[{"name":"Heldrake claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"7","ap":"-1","d":"2","desc":"anti-fly 2+, devastating wounds"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Flame-wreathed","description":"Each time this model ends a Normal move, select one enemy unit it moved over during that move. Until the end of the turn, models in that unit cannot have the Benefit of Cover.","type":"Datasheet"}],"keywords":["Vehicle","Aircraft","Fly","Daemon","Chaos","Tzeentch","Heldrake"],"factionKeywords":["","Thousand Sons"],"composition":["1 Heldrake"],"points":[{"models":"1 model","cost":"215"}],"canLead":[],"ledBy":[]},{"id":"000003598","name":"Hell Blade","role":"Other","loadout":"This model is equipped with: 2 twin autocannons; armoured hull.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Hell Blade","m":"20+\"","t":"8","sv":"3+","invSv":"5","w":"10","ld":"6+","oc":"0"}],"weapons":[{"name":"Armoured hull","type":"Melee","profiles":[{"name":"Armoured hull","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null},{"name":"Twin autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-3","d":"3","desc":"twin-linked"},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Interceptor","description":"Each time this model makes a ranged attack that targets a unit that can FLY, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Fly","Tzeentch","Hell Blade","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Blade","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Blade","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Blade","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Blade","Chaos","Vehicle","Aircraft"],"factionKeywords":["","Thousand Sons"],"composition":["1 Hell Blade"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000003599","name":"Hell Talon","role":"Other","loadout":"This model is equipped with: autocannon; twin lascannon; armoured hull.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Hell Talon","m":"20+\"","t":"9","sv":"3+","invSv":"5","w":"14","ld":"6+","oc":"0"}],"weapons":[{"name":"Autocannon","type":"Ranged","profiles":[{"name":"Autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-1","d":"3","desc":null},{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"},{"name":"Armoured hull","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Bomb Rack","description":"Each time this model ends a Normal move, you can select one enemy unit it moved across during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound.","type":"Datasheet"}],"keywords":["Hell Talon","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Talon","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Talon","Vehicle","Chaos","Aircraft","Fly","Tzeentch","Hell Talon","Hell Talon","Fly","Tzeentch","Vehicle","Chaos","Tzeentch","Fly","Aircraft","Vehicle","Chaos","Aircraft"],"factionKeywords":["Thousand Sons",""],"composition":["1 Hell Talon"],"points":[{"models":"1 model","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000002500","name":"Infernal Master","role":"Characters","loadout":"This model is equipped with: inferno bolt pistol; Fires of the Abyss; force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Infernal Master","m":"6\"","t":"4","sv":"3+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"2","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Fires of the Abyss – witchfire","type":"Ranged","profiles":[{"name":"Fires of the Abyss – witchfire","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-2","d":"1","desc":"psychic, torrent"}]},{"name":"Fires of the Abyss – focused witchfire","type":"Ranged","profiles":[{"name":"Fires of the Abyss – focused witchfire","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"6","ap":"-2","d":"1","desc":"hazardous, psychic, torrent"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"6","ap":"-1","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Malefic Maelstrom (Psychic)","description":"While this model is leading a unit, weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Glimpse of Eternity (Psychic)","description":"Once per turn, you can change the result of one Hit roll, one Wound roll or one saving throw made for this model to an unmodified 6.","type":"Datasheet"}],"keywords":["Chaos","Psyker","Grenades","Character","Infantry","Tzeentch","Infernal Master"],"factionKeywords":["Thousand Sons",""],"composition":["1 Infernal Master"],"points":[{"models":"1 model","cost":"95"}],"canLead":["000001020"],"ledBy":[]},{"id":"000004123","name":"Kairos Fateweaver","role":"Characters","loadout":"This model is equipped with: Infernal Gateway; Staff of Tomorrow.","transport":null,"damagedW":"1-7","damagedDescription":"While this model has 1-7 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Kairos Fateweaver","m":"12\"","t":"10","sv":"6+","invSv":"4","w":"20","ld":"6+","oc":"5"}],"weapons":[{"name":"Infernal Gateway – witchfire","type":"Ranged","profiles":[{"name":"Infernal Gateway – witchfire","range":"24","type":"Ranged","a":"D6+3","bsWs":"2","s":"9","ap":"-2","d":"D3","desc":"blast, indirect fire, psychic"}]},{"name":"Infernal Gateway – focused witchfire","type":"Ranged","profiles":[{"name":"Infernal Gateway – focused witchfire","range":"24","type":"Ranged","a":"D3+6","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"blast, indirect fire, hazardous, psychic"}]},{"name":"Staff of Tomorrow","type":"Melee","profiles":[{"name":"Staff of Tomorrow","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"8","ap":"-2","d":"2D3","desc":"psychic"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"One Head Looks Forward","description":"At the end of your Command phase, if this model is on the battlefield, take a Leadership test for this model; if that test is passed, you gain 1CP.","type":"Datasheet"},{"name":"One Head Looks Back (Aura)","description":"Each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this model, increase the cost of that use of that Stratagem by 1CP.","type":"Datasheet"}],"keywords":["Chaos","Monster","Character","Epic Hero","Fly","Psyker","Daemon","Summoned","Kairos Fateweaver","Tzeentch"],"factionKeywords":["","Scintillating Legions"],"composition":["1 Kairos Fateweaver – EPIC HERO"],"points":[{"models":"1 model","cost":"285"}],"canLead":[],"ledBy":[]},{"id":"000003631","name":"Kratos","role":"Other","loadout":"This model is equipped with: autocannon; Kratos battle cannon; 4 heavy bolters; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Kratos","m":"10\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"6+","oc":"6"}],"weapons":[{"name":"Melta blast-gun","type":"Ranged","profiles":[{"name":"Melta blast-gun","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"12","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Lascannons","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Kratos battle cannon – HE","range":"36","type":"Ranged","a":"D6+3","bsWs":"3","s":"10","ap":"-1","d":"3","desc":"blast"},{"name":"Kratos battle cannon – AP","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"18","ap":"-4","d":"D6+3","desc":"heavy"},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"IGNORES COVER, TORRENT"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"SUSTAINED HITS 1"},{"name":"Havoc launcher","range":"48","type":"Ranged","a":"D6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast"},{"name":"Combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"0","d":"1","desc":"ANTI-INFANTRY 4+, DEVASTATING WOUNDS, RAPID FIRE 1"},{"name":"Autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-1","d":"3","desc":null},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"MELTA 2"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Volkite culverin","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"6","ap":"0","d":"2","desc":"devastating wounds"},{"name":"Volkite cardanelle","range":"36","type":"Ranged","a":"9","bsWs":"3","s":"9","ap":"0","d":"3","desc":"devastating wounds"},{"name":"Volkite caliver","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"0","d":"2","desc":"devastating wounds"},{"name":"Twin boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Line-breaker","description":"When making ranged attacks, this model can target enemy units within Engagement Range of it with Blast weapons (provided no other friendly units are also within Engagement Range of that enemy unit). In addition, when making ranged attacks, this model does not suffer the penalty to its Hit rolls for being within Engagement Range of one or more enemy units.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Chaos","Chaos","Tzeentch","Smoke","Kratos","Tzeentch","Vehicle","Kratos","Smoke","Vehicle","Chaos","Tzeentch","Smoke","Kratos","Vehicle","Chaos","Tzeentch","Smoke","Kratos","Vehicle"],"factionKeywords":["","Thousand Sons"],"composition":["1 Kratos"],"points":[{"models":"1 model","cost":"240"}],"canLead":[],"ledBy":[]},{"id":"000003607","name":"Land Raider Achilles","role":"Other","loadout":"This model is equipped with: quad launcher; 2 twin volkite culverins; armoured tracks.","transport":"This model has a transport capacity of 12 Thousand Sons Infantry models. Each Jump Pack, Wulfen, Gravis, Possessed or Terminator model takes up the space of 2 models and each Centurion or Obliterator model takes up the space of 3 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Land Raider Achilles","m":"10\"","t":"12","sv":"2+","invSv":"4","w":"16","ld":"6+","oc":"5"}],"weapons":[{"name":"Storm bolter","type":"Ranged","profiles":[{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Twin volkite culverin","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"6","ap":"0","d":"2","desc":"devastating wounds, twin-linked"},{"name":"Twin multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2, twin-linked"},{"name":"Quad launcher – shatter shells","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-2","d":"3","desc":null},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Quad launcher – thunderfire shells","range":"60","type":"Ranged","a":"D6+4","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast, indirect fire"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assault Ramp","description":"Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Vehicle","Vehicle","Transport","Smoke","Chaos","Tzeentch","Land Raider Achilles","Transport","Smoke","Chaos","Tzeentch","Land Raider Achilles","Transport","Smoke","Chaos","Tzeentch","Land Raider Achilles","Vehicle","Transport","Chaos","Tzeentch","Vehicle","Land Raider Achilles","Tzeentch","Smoke","Chaos","Smoke","Land Raider Achilles","Transport","Vehicle"],"factionKeywords":["","Thousand Sons"],"composition":["1 Land Raider Achilles"],"points":[{"models":"1 model","cost":"230"}],"canLead":[],"ledBy":[]},{"id":"000003611","name":"Land Raider Proteus","role":"Other","loadout":"This model is equipped with: 2 twin lascannons; armoured tracks.","transport":"This model has a transport capacity of 12 Thousand Sons Infantry models. Each Jump Pack, Wulfen, Gravis, Possessed or Terminator model takes up the space of 2 models and each Centurion or Obliterator model takes up the space of 3 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Land Raider Proteus","m":"12\"","t":"12","sv":"2+","invSv":"-","w":"16","ld":"6+","oc":"5"}],"weapons":[{"name":"Multi-melta","type":"Ranged","profiles":[{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"twin-linked, sustained hits 1"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"},{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Explorator Augury Web","description":"Enemy units that are set up on the battlefield as Reinforcements cannot be set up within 12\" of this bearer, but the bearer must halve its Transport Capacity.","type":"Wargear"},{"name":"Assault Ramp","description":"Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Smoke","Chaos","Tzeentch","Land Raider Proteus","Transport","Smoke","Chaos","Land Raider Proteus","Tzeentch","Chaos","Smoke","Transport","Vehicle","Land Raider Proteus","Tzeentch","Vehicle","Smoke","Transport","Vehicle","Vehicle","Land Raider Proteus","Transport","Tzeentch","Land Raider Proteus","Vehicle","Transport","Smoke","Chaos","Tzeentch","Chaos"],"factionKeywords":["","Thousand Sons"],"composition":["1 Land Raider Proteus"],"points":[{"models":"1 model","cost":"220"}],"canLead":[],"ledBy":[]},{"id":"000003647","name":"Leviathan Dreadnought","role":"Other","loadout":"This model is equipped with: 2 heavy flamers; 2 grav-flux bombards; armoured feet.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Leviathan Dreadnought","m":"8\"","t":"10","sv":"2+","invSv":"5","w":"12","ld":"6+","oc":"4"}],"weapons":[{"name":"Meltagun","type":"Ranged","profiles":[{"name":"Meltagun","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Storm cannon","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"twin-linked"},{"name":"Twin volkite caliver","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"0","d":"2","desc":"devastating wounds, twin-linked"},{"name":"Leviathan siege drill","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"12","ap":"-2","d":"3","desc":"anti-vehicle 3+"},{"name":"Leviathan siege claw","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"12","ap":"-2","d":"3","desc":null},{"name":"Armoured feet","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"0","d":"1","desc":null},{"name":"Cyclonic melta lance","range":"18","type":"Ranged","a":"D6","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Grav-flux bombard","range":"24","type":"Ranged","a":"2D3","bsWs":"3","s":"8","ap":"-1","d":"2","desc":"anti-vehicle 2+, blast"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Duty Eternal","description":"Each time an attack is allocated to this model, subtract 1 from the Damage characteristic of that attack.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Chaos","Tzeentch","Smoke","Leviathan Dreadnought","Dreadnought","Smoke","Tzeentch","Chaos","Walker","Vehicle","Leviathan Dreadnought","Dreadnought","Walker","Vehicle","Walker","Chaos","Tzeentch","Smoke","Dreadnought","Leviathan Dreadnought","Vehicle","Chaos","Tzeentch","Smoke","Dreadnought","Leviathan Dreadnought","Vehicle","Walker","Chaos","Tzeentch","Smoke","Dreadnought","Leviathan Dreadnought","Vehicle","Walker","Chaos","Tzeentch","Smoke","Dreadnought","Leviathan Dreadnought","Vehicle","Walker","Chaos","Tzeentch","Smoke","Dreadnought","Leviathan Dreadnought","Vehicle","Walker"],"factionKeywords":["","Thousand Sons"],"composition":["1 Leviathan Dreadnought"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000004124","name":"Lord of Change","role":"Characters","loadout":"This model is equipped with: Bolt of Change; staff of Tzeentch.","transport":null,"damagedW":"1-7","damagedDescription":"While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Lord of Change","m":"12\"","t":"10","sv":"6+","invSv":"4","w":"18","ld":"6+","oc":"5"}],"weapons":[{"name":"Rod of sorcery","type":"Ranged","profiles":[{"name":"Rod of sorcery","range":"18","type":"Ranged","a":"6","bsWs":"2","s":"8","ap":"-1","d":"2","desc":"psychic"}]},{"name":"Bolt of Change – witchfire","type":"Ranged","profiles":[{"name":"Bolt of Change – witchfire","range":"18","type":"Ranged","a":"9","bsWs":"2","s":"9","ap":"-1","d":"1","desc":"psychic"}]},{"name":"Bolt of Change – focused witchfire","type":"Ranged","profiles":[{"name":"Bolt of Change – focused witchfire","range":"18","type":"Ranged","a":"9","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"hazardous, psychic"}]},{"name":"Baleful sword","type":"Melee","profiles":[{"name":"Baleful sword","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"7","ap":"-2","d":"3","desc":"extra attacks"}]},{"name":"Staff of Tzeentch","type":"Melee","profiles":[{"name":"Staff of Tzeentch","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"-1","d":"3","desc":"psychic"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"Daemon Lord of Tzeentch (Aura)","description":"While a friendly Scintillating Legions unit is within 6\" of this model, each time a model in that unit makes a ranged attack, add 1 to the Strength characteristic of that attack.","type":"Datasheet"},{"name":"Master of Magicks (Psychic)","description":"In your Shooting phase, select one of the following abilities: [IGNORES COVER]; [LETHAL HITS]; [SUSTAINED HITS D3]. Until the end of the phase, this model’s Bolt of Change has that ability.","type":"Datasheet"}],"keywords":["Psyker","Chaos","Daemon","Lord of Change","Summoned","Fly","Tzeentch","Monster","Character"],"factionKeywords":["","Scintillating Legions"],"composition":["1 Lord of Change"],"points":[{"models":"1 model","cost":"270"}],"canLead":[],"ledBy":[]},{"id":"000001031","name":"Magnus The Red","role":"Characters","loadout":"This model is equipped with: Gaze of Magnus; Tzeentch’s Firestorm; blade of Magnus.","transport":null,"damagedW":"1-6","damagedDescription":"While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Magnus The Red","m":"14\"","t":"11","sv":"2+","invSv":"4","w":"16","ld":"5+","oc":"6"}],"weapons":[{"name":"Gaze of Magnus","type":"Ranged","profiles":[{"name":"Gaze of Magnus","range":"24","type":"Ranged","a":"3D3","bsWs":"2","s":"11","ap":"-2","d":"3","desc":"devastating wounds, psychic"}]},{"name":"Tzeentch’s Firestorm","type":"Ranged","profiles":[{"name":"Tzeentch’s Firestorm","range":"24","type":"Ranged","a":"D6+3","bsWs":"2","s":"6","ap":"-1","d":"2","desc":"blast, ignores cover, psychic"}]},{"name":"Blade of Magnus – strike","type":"Melee","profiles":[{"name":"Blade of Magnus – strike","range":"Melee","type":"Melee","a":"7","bsWs":"2","s":"16","ap":"-3","d":"3","desc":"devastating wounds, psychic"}]},{"name":"Blade of Magnus – sweep","type":"Melee","profiles":[{"name":"Blade of Magnus – sweep","range":"Melee","type":"Melee","a":"14","bsWs":"2","s":"8","ap":"-1","d":"2","desc":"psychic"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Unearthly Power","description":"At the start of the battle round, select one of the abilities in the Crimson King section (see left). Until the start of the next battle round, this model has that ability.","type":"Datasheet"},{"name":"Lord of the Planet of the Sorcerers (Psychic)","description":"This model can attempt up to two Rituals per turn instead of one, and each time this model attempts a Ritual, add 2 to the Psychic test result.","type":"Datasheet"},{"name":"Impossible Form (Psychic)","description":"Each time an attack is made against this PSYKER (excluding Psychic Attacks), subtract 1 from the Damage characteristic of that attack.","type":"Primarch"},{"name":"Treason of Tzeentch (Psychic)","description":"At the start of your opponent’s Shooting phase, select one enemy unit within 24\" of this PSYKER. Until the end of the phase, ranged weapons equipped by models in that unit have the [HAZARDOUS] ability.","type":"Primarch"},{"name":"Time Flux (Aura, Psychic)","description":"While a friendly Thousand Sons unit is within 6\" of this PSYKER, add 2\" to the Move characteristic of models in that unit.","type":"Primarch"},{"name":"SUPREME COMMANDER","description":"If this model is in your army, it must be your WARLORD.","type":"Fortification (левая колонка)"}],"keywords":["Tzeentch","Magnus the Red","Character","Chaos","Psyker","Primarch","Daemon","Fly","Epic Hero","Monster"],"factionKeywords":["","Thousand Sons"],"composition":["1 Magnus the Red – EPIC HERO"],"points":[{"models":"1 model","cost":"435"}],"canLead":[],"ledBy":[]},{"id":"000003643","name":"Mastodon","role":"Other","loadout":"This model is equipped with: 2 heavy flamers; 2 lascannons; siege melta array; skyreaper battery; armoured tracks.","transport":"This model has a transport capacity of 45 Thousand Sons Infantry models. Each Jump Pack, Wulfen, Gravis, Possessed or Terminator model takes up the space of 2 models and each Centurion or Obliterator model takes up the space of 3 models. This model can also transport up to 2 Dreadnought or Helbrute models (these models take up the space of a number of models equal to their Wounds characteristic e.g. A Dreadnought with a Wounds characteristic of 8 would take up the space of 8 models).","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Mastodon","m":"9\"","t":"14","sv":"2+","invSv":"-","w":"30","ld":"6+","oc":"12"}],"weapons":[{"name":"Heavy flamer","type":"Ranged","profiles":[{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent"},{"name":"Volkite culverin","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"6","ap":"0","d":"2","desc":"devastating wounds"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Skyreaper battery","range":"48","type":"Ranged","a":"8","bsWs":"3","s":"7","ap":"-1","d":"2","desc":"anti-fly 4+"},{"name":"Siege melta array","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Inviolable Transport","description":"Once per battle round, when an attack is allocated to this model, you can change the Damage characteristic of that attack to 0.","type":"Datasheet"}],"keywords":["Tzeentch","Chaos","Titanic","Vehicle","Mastodon","Smoke","Transport","Tzeentch","Chaos","Titanic","Vehicle","Mastodon","Smoke","Transport","Tzeentch","Chaos","Vehicle","Titanic","Mastodon","Smoke","Transport","Tzeentch","Chaos","Titanic","Vehicle","Mastodon","Smoke","Transport","Tzeentch","Chaos","Titanic","Vehicle","Mastodon","Smoke","Transport","Tzeentch","Chaos","Titanic","Vehicle","Mastodon","Smoke","Transport"],"factionKeywords":["Thousand Sons",""],"composition":["1 Mastodon"],"points":[{"models":"1 model","cost":"540"}],"canLead":[],"ledBy":[]},{"id":"000001029","name":"Maulerfiend","role":"Other","loadout":"This model is equipped with: lasher tendrils; Maulerfiend fists.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Maulerfiend","m":"10\"","t":"10","sv":"3+","invSv":"5","w":"12","ld":"6+","oc":"3"}],"weapons":[{"name":"Magma cutter","type":"Ranged","profiles":[{"name":"Magma cutter","range":"6","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Lasher tendrils","type":"Melee","profiles":[{"name":"Lasher tendrils","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"7","ap":"-1","d":"1","desc":"extra attacks"}]},{"name":"Maulerfiend fists","type":"Melee","profiles":[{"name":"Maulerfiend fists","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"14","ap":"-2","d":"D6+1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Snarling Protector","description":"You can target this model with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase. In addition, each time this model declares a charge that targets an enemy unit within Engagement Range of one or more Thousand Sons Psyker units from your army, you can re-roll the Charge roll.","type":"Datasheet"}],"keywords":["Maulerfiend","Vehicle","Tzeentch","Chaos","Daemon","Walker"],"factionKeywords":["Thousand Sons",""],"composition":["1 Maulerfiend"],"points":[{"models":"1 model","cost":"120"}],"canLead":[],"ledBy":[]},{"id":"000001476","name":"Mutalith Vortex Beast","role":"Other","loadout":"This model is equipped with: warp vortex; betentacled maw; Mutalith claws.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Mutalith Vortex Beast","m":"10\"","t":"10","sv":"4+","invSv":"5","w":"13","ld":"6+","oc":"4"}],"weapons":[{"name":"Warp vortex – blast","type":"Ranged","profiles":[{"name":"Warp vortex – blast","range":"24","type":"Ranged","a":"D6+3","bsWs":"3","s":"9","ap":"-2","d":"2","desc":"blast"}]},{"name":"Warp vortex – beam","type":"Ranged","profiles":[{"name":"Warp vortex – beam","range":"36","type":"Ranged","a":"1","bsWs":"3","s":"18","ap":"-3","d":"D6+6","desc":"devastating wounds"}]},{"name":"Warp vortex – torrent","type":"Ranged","profiles":[{"name":"Warp vortex – torrent","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Betentacled maw","type":"Melee","profiles":[{"name":"Betentacled maw","range":"Melee","type":"Melee","a":"15","bsWs":"3","s":"7","ap":"0","d":"1","desc":null}]},{"name":"Mutalith claws","type":"Melee","profiles":[{"name":"Mutalith claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"10","ap":"-2","d":"3","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Mutating Vortex (Aura)","description":"At the end of your Movement phase, roll one D6 for each enemy unit within 6\" of this model: on a 2-3, that unit suffers 1 mortal wound; on a 4-5, that unit suffers D3 mortal wounds; on a 6, that unit suffers D6 mortal wounds. Each enemy unit within range of this ability must then take a Battle-shock test.","type":"Datasheet"},{"name":"Immaterial Flare (Aura)","description":"While a friendly Thousand Sons Psyker model is within 6\" of this model, each time that model Channels the Warp, add 1 to the Psychic test result. This is not cumulative with any other modifiers to the Psychic test result.","type":"Datasheet"}],"keywords":["Tzeentch","Mutalith Vortex Beast","Mutant","Monster","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Mutalith Vortex Beast"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000004127","name":"Pink Horrors","role":"Battleline","loadout":"Every Pink Horror is equipped with: coruscating pink flames; pink claws. Every Blue Horror added to this unit using the Split ability is equipped with: coruscating blue flames; blue claws. Every Brimstone Horror added to this unit using the Split ability is equipped with: coruscating yellow flames; yellow claws.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"PINK HORROR","m":"6\"","t":"3","sv":"7+","invSv":"4","w":"1","ld":"7+","oc":"1"},{"name":"BLUE HORROR/BRIMSTONE HORROR","m":"6\"","t":"3","sv":"7+","invSv":"4","w":"1","ld":"8+","oc":"0"}],"weapons":[{"name":"Coruscating blue flames","type":"Ranged","profiles":[{"name":"Coruscating blue flames","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"3","ap":"-1","d":"1","desc":"pistol, psychic"}]},{"name":"Coruscating pink flames","type":"Ranged","profiles":[{"name":"Coruscating pink flames","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol, psychic"}]},{"name":"Coruscating yellow flames","type":"Ranged","profiles":[{"name":"Coruscating yellow flames","range":"18","type":"Ranged","a":"2","bsWs":"5","s":"2","ap":"-1","d":"1","desc":"pistol, psychic"}]},{"name":"Blue claws","type":"Melee","profiles":[{"name":"Blue claws","range":"Melee","type":"Melee","a":"1","bsWs":"5","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Pink claws","type":"Melee","profiles":[{"name":"Pink claws","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]},{"name":"Yellow claws","type":"Melee","profiles":[{"name":"Yellow claws","range":"Melee","type":"Melee","a":"2","bsWs":"5","s":"2","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"Split","description":"Each time a PINK HORROR or BLUE HORROR model in this unit is destroyed, after the attacking unit has finished making its attacks, if this unit is not destroyed, roll one D6 for that model. On a 4+, if it was a PINK HORROR, add two BLUE HORROR models to this unit, and if it was a BLUE HORROR, add one BRIMSTONE HORROR model to this unit.","type":"Datasheet"},{"name":"Daemonic Icon","description":"Models in the bearer’s unit have a Leadership characteristic of 6+.","type":"Wargear"},{"name":"Instrument of Chaos","description":"Add 1 to Charge rolls made for the bearer’s unit.","type":"Wargear"},{"name":"HORRORS ARE PINK. HORRORS ARE BLUE. WHEREONCE THERE WAS ONE, NOW THERE ARE TWO.","description":"If, at any point, this unit contains no PINK HORROR models, use the BLUE HORRORS datasheet for this unit. Designer’s Note: While this unit contains one or more PINK HORROR models, the Sullen Malevolence and Exploding Horrors abilities from the BLUE HORRORS datasheet do not apply to this unit.","type":"Special (правая колонка)"}],"keywords":["Summoned","Horrors","Pink","Blue","Brimstone","Tzeentch","Daemon","Chaos","Battleline","Infantry"],"factionKeywords":["Scintillating Legions",""],"composition":["10 Pink Horrors"],"points":[{"models":"10 models","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000003667","name":"Rapier Carrier","role":"Other","loadout":"This model is equipped with: boltgun; quad heavy bolter; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Rapier Carrier","m":"3\"","t":"6","sv":"2+","invSv":"-","w":"6","ld":"6+","oc":"2"}],"weapons":[{"name":"Laser destroyer","type":"Ranged","profiles":[{"name":"Laser destroyer","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":"heavy"},{"name":"Graviton cannon","range":"36","type":"Ranged","a":"D6","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"anti-vehicle 2+, blast, heavy"},{"name":"Boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null},{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null},{"name":"Quad launcher – thunderfire shells","range":"60","type":"Ranged","a":"D6+4","bsWs":"3","s":"5","ap":"0","d":"1","desc":"blast, heavy, indirect fire"},{"name":"Quad launcher – shatter shells","range":"24","type":"Ranged","a":"4","bsWs":"3","s":"9","ap":"-2","d":"3","desc":"heavy"},{"name":"Quad heavy bolter","range":"36","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"heavy, twin-linked, sustained hits 1"}]}],"abilities":[{"name":"Powerful Volley","description":"Each time this model shoots in your Shooting phase, provided it Remained Stationary this turn, all [HEAVY] weapons equipped by models in this unit have the [LETHAL HITS] ability.","type":"Datasheet"}],"keywords":["Tzeentch","Rapier Carrier","Artillery","Vehicle","Chaos","Tzeentch","Rapier Carrier","Artillery","Vehicle","Chaos","Tzeentch","Rapier Carrier","Rapier Carrier","Tzeentch","Chaos","Vehicle","Vehicle","Artillery","Artillery","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Rapier Carrier"],"points":[{"models":"1 model","cost":"90"}],"canLead":[],"ledBy":[]},{"id":"000003655","name":"Relic Contemptor Dreadnought","role":"Other","loadout":"This model is equipped with: 2 heavy plasma cannons; armoured feet.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Relic Contemptor Dreadnought","m":"6\"","t":"9","sv":"2+","invSv":"5","w":"10","ld":"6+","oc":"3"}],"weapons":[{"name":"Plasma blaster – standard","type":"Ranged","profiles":[{"name":"Plasma blaster – standard","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"7","ap":"-2","d":"1","desc":null},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"TWIN-LINKED"},{"name":"Graviton blaster","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"anti-vehicle 2+"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"TWIN-LINKED, SUSTAINED HITS 1"},{"name":"Cyclone missile launcher – krak","range":"36","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null},{"name":"Twin autocannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"TWIN-LINKED"},{"name":"Heavy plasma cannon – supercharge","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"8","ap":"-3","d":"3","desc":"blast, hazardous"},{"name":"Kheres-pattern assault cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"7","ap":"-1","d":"1","desc":"devastating wounds"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"IGNORES COVER, TORRENT"},{"name":"Plasma blaster – supercharge","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"8","ap":"-3","d":"2","desc":"HAZARDOUS"},{"name":"Twin volkite culverin","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"6","ap":"0","d":"2","desc":"devastating wounds, twin-linked"},{"name":"Dreadnought chainfist","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"12","ap":"-2","d":"3","desc":"anti-vehicle 3+"},{"name":"Heavy plasma cannon – standard","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"7","ap":"-2","d":"2","desc":"blast"},{"name":"Dreadnought combat weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"12","ap":"-2","d":"3","desc":null},{"name":"Cyclone missile launcher – frag","range":"36","type":"Ranged","a":"2D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"BLAST"},{"name":"Conversion beam cannon","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"7","ap":"-1","d":"3","desc":"conversion, sustained hits d3"},{"name":"Combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"MELTA 2"},{"name":"Armoured feet","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Even In Death I Serve","description":"The first time this model is destroyed, remove it from play without resolving its Deadly Demise ability. Then, at the end of the phase, roll one D6: on a 2+, set this model back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with D6 wounds remaining.","type":"Datasheet"},{"name":"Conversion","description":"Each time an attack made with this weapon targets a unit more than 12\" from the bearer, an unmodified successful Hit roll of 4+ scores a Critical Hit.","type":"Wargear profile"}],"keywords":["Vehicle","Walker","Chaos","Tzeentch","Dreadnought","Relic Contemptor Dreadnought","Vehicle","Walker","Chaos","Tzeentch","Dreadnought","Relic Contemptor Dreadnought","Walker","Chaos","Tzeentch","Chaos","Relic Contemptor Dreadnought","Vehicle","Walker","Chaos","Tzeentch","Dreadnought","Relic Contemptor Dreadnought","Vehicle","Vehicle","Walker","Chaos","Tzeentch","Dreadnought","Relic Contemptor Dreadnought","Vehicle","Walker","Tzeentch","Dreadnought","Relic Contemptor Dreadnought","Dreadnought"],"factionKeywords":["Thousand Sons",""],"composition":["1 Relic Contemptor Dreadnought"],"points":[{"models":"1 model","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000001020","name":"Rubric Marines","role":"Battleline","loadout":"The Aspiring Sorcerer is equipped with: inferno bolt pistol; Malefic Curse; force weapon. Every Rubric Marine is equipped with: inferno boltgun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Rubric Marine","m":"6\"","t":"4","sv":"3+","invSv":"5","w":"2","ld":"7+","oc":"2"},{"name":"Aspiring Sorcerer","m":"6\"","t":"4","sv":"3+","invSv":"5","w":"3","ld":"6+","oc":"2"}],"weapons":[{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Inferno boltgun","type":"Ranged","profiles":[{"name":"Inferno boltgun","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":null}]},{"name":"Malefic Curse","type":"Ranged","profiles":[{"name":"Malefic Curse","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"-3","d":"1","desc":"anti-infantry 4+, devastating wounds, psychic"}]},{"name":"Soulreaper cannon","type":"Ranged","profiles":[{"name":"Soulreaper cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"-2","d":"1","desc":"devastating wounds"}]},{"name":"Warpflame pistol","type":"Ranged","profiles":[{"name":"Warpflame pistol","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"3","ap":"-1","d":"1","desc":"ignores cover, pistol, torrent"}]},{"name":"Warpflamer","type":"Ranged","profiles":[{"name":"Warpflamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"4","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"6","ap":"-1","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Bringers of Change","description":"Each time a model in this unit makes a ranged attack, re-roll a Wound roll of 1. If that attack targets a unit within range of an objective marker you do not control, you can re-roll the Wound roll instead.","type":"Datasheet"},{"name":"Icon of Flame","description":"Ranged weapons equipped by models in the bearer’s unit (excluding CHARACTERS) have the [IGNORES COVER] ability.","type":"Wargear"}],"keywords":["Rubricae","Tzeentch","Chaos","Battleline","Infantry","Psyker","Rubric Marines"],"factionKeywords":["Thousand Sons",""],"composition":["1 Aspiring Sorcerer","4-9 Rubric Marines"],"points":[{"models":"5 models","cost":"100"},{"models":"10 models","cost":"190"}],"canLead":[],"ledBy":["000001016","000001032","000001033","000002500","000002755","000003597"]},{"id":"000001035","name":"Scarab Occult Terminators","role":"Other","loadout":"The Scarab Occult Sorcerer is equipped with: inferno combi-bolter; Malefic Curse; force weapon. Every Scarab Occult Terminator is equipped with: inferno combi-bolter; Prosperine khopesh.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Scarab Occult Terminator","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"3","ld":"7+","oc":"1"},{"name":"Scarab Occult Sorcerer","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Heavy warpflamer","type":"Ranged","profiles":[{"name":"Heavy warpflamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-2","d":"1","desc":"ignores cover, torrent"}]},{"name":"Hellfyre missile rack","type":"Ranged","profiles":[{"name":"Hellfyre missile rack","range":"36","type":"Ranged","a":"2","bsWs":"3","s":"10","ap":"-2","d":"3","desc":null}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Malefic Curse","type":"Ranged","profiles":[{"name":"Malefic Curse","range":"24","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"-3","d":"1","desc":"anti-infantry 4+, devastating wounds, psychic"}]},{"name":"Soulreaper cannon","type":"Ranged","profiles":[{"name":"Soulreaper cannon","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"6","ap":"-2","d":"1","desc":"devastating wounds"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"6","ap":"-1","d":"D3","desc":"psychic"}]},{"name":"Prosperine khopesh","type":"Melee","profiles":[{"name":"Prosperine khopesh","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Rites of Coalescence","description":"While this unit contains one or more PSYKER models, each time an attack targets this unit, subtract 1 from the Wound roll.","type":"Datasheet"}],"keywords":["Chaos","Infantry","Rubricae","Tzeentch","Terminator","Scarab Occult","Psyker"],"factionKeywords":["","Thousand Sons"],"composition":["1 Scarab Occult Sorcerer","4-9 Scarab Occult Terminators"],"points":[{"models":"5 models","cost":"180"},{"models":"10 models","cost":"360"}],"canLead":[],"ledBy":["000001017"]},{"id":"000004126","name":"Screamers","role":"Other","loadout":"Every model is equipped with: lamprey bite.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Screamers","m":"14\"","t":"4","sv":"6+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Lamprey bite","type":"Melee","profiles":[{"name":"Lamprey bite","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"anti-monster 4+, anti-vehicle 4+"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Pact of Sorcery","description":"When mustering your army, unless specifically stated otherwise, you cannot select Scintillating Legions as your Army Faction.","type":"Faction"},{"name":"Slashing Dive","description":"In your Movement phase, after this unit ends a Normal move, you can select one enemy unit it moved over during that move and roll one D6 for each model in this unit: for each 4+, that enemy unit suffers 1 mortal wound.","type":"Datasheet"}],"keywords":["Chaos","Fly","Beast","Screamers","Tzeentch","Daemon","Summoned"],"factionKeywords":["Scintillating Legions",""],"composition":["3-6 Screamers"],"points":[{"models":"3 models","cost":"80"},{"models":"6 models","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000004121","name":"Sekhetar Robots","role":"Other","loadout":"Every model is equipped with: heavy warpflamer; hellfyre missile rack; pyreflux meltagun; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Sekhetar Robots","m":"8\"","t":"6","sv":"3+","invSv":"5","w":"4","ld":"7+","oc":"1"}],"weapons":[{"name":"Heavy warpflamer","type":"Ranged","profiles":[{"name":"Heavy warpflamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-2","d":"1","desc":"ignores cover, torrent"}]},{"name":"Hellfyre missile rack","type":"Ranged","profiles":[{"name":"Hellfyre missile rack","range":"36","type":"Ranged","a":"2","bsWs":"4","s":"10","ap":"-2","d":"3","desc":null}]},{"name":"Pyreflux meltagun","type":"Ranged","profiles":[{"name":"Pyreflux meltagun","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"10","ap":"-4","d":"D6","desc":"melta 2"}]},{"name":"Warpflame projector","type":"Ranged","profiles":[{"name":"Warpflame projector","range":"12","type":"Ranged","a":"D3","bsWs":"N/A","s":"3","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Power claw","type":"Melee","profiles":[{"name":"Power claw","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"10","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Prophetic Sentinels","description":"Once per battle round, you can target this unit with the Fire Overwatch or Heroic Intervention Stratagem for 0CP.","type":"Datasheet"}],"keywords":["Walker","Sekhetar Robots","Tzeentch","Chaos","Vehicle"],"factionKeywords":["","Thousand Sons"],"composition":["2-4 Sekhetar Robots"],"points":[{"models":"2 models","cost":"80"},{"models":"4 models","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000003639","name":"Sicaran Battle Tank","role":"Other","loadout":"This model is equipped with: heavy bolter; Herakles-pattern autocannon; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Sicaran Battle Tank","m":"10\"","t":"11","sv":"2+","invSv":"-","w":"14","ld":"6+","oc":"4"}],"weapons":[{"name":"Armoured tracks","type":"Melee","profiles":[{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Herakles-pattern autocannon","range":"48","type":"Ranged","a":"6","bsWs":"3","s":"9","ap":"-1","d":"3","desc":"rapid fire 2"},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Armoured Spearhead","description":"Each time this model makes an attack that targets an enemy unit, re-roll a Hit roll of 1 and, if that unit is within range of an objective marker you do not control, you can re-roll the Hit roll instead.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Sicaran Battle Tank","Chaos","Sicaran Battle Tank","Smoke","Tzeentch","Chaos","Vehicle","Vehicle","Smoke","Tzeentch","Chaos","Vehicle","Sicaran Battle Tank","Smoke","Tzeentch","Chaos","Vehicle","Sicaran Battle Tank","Smoke","Tzeentch"],"factionKeywords":["","Thousand Sons"],"composition":["1 Sicaran Battle Tank"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000003683","name":"Sicaran Punisher","role":"Other","loadout":"This model is equipped with: heavy bolter; Punisher rotary cannon; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Sicaran Punisher","m":"10\"","t":"11","sv":"2+","invSv":"-","w":"14","ld":"6+","oc":"4"}],"weapons":[{"name":"Lascannon","type":"Ranged","profiles":[{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Punisher rotary cannon","range":"36","type":"Ranged","a":"18","bsWs":"4","s":"6","ap":"0","d":"1","desc":"devastating wounds"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Rotating Death","description":"This model’s Punisher rotary cannon has the [SUSTAINED HITS 1] ability when targeting INFANTRY units.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Tzeentch","Smoke","Sicaran Punisher","Tzeentch","Chaos","Vehicle","Sicaran Punisher","Smoke","Tzeentch","Chaos","Vehicle","Sicaran Punisher","Vehicle","Smoke","Chaos","Tzeentch","Smoke","Sicaran Punisher","Vehicle","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Sicaran Punisher"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000003675","name":"Sicaran Venator","role":"Other","loadout":"This model is equipped with: heavy bolter; Venator neutron laser; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Sicaran Venator","m":"10\"","t":"11","sv":"2+","invSv":"-","w":"14","ld":"6+","oc":"4"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Venator neutron laser","range":"48","type":"Ranged","a":"3","bsWs":"3","s":"16","ap":"-4","d":"D3+3","desc":"heavy"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Ferocious Assault","description":"Each time this model makes a ranged attack that targets the closest eligible MONSTER or VEHICLE unit, add 1 to the Hit roll.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Vehicle","Chaos","Tzeentch","Smoke","Sicaran Venator","Vehicle","Chaos","Tzeentch","Smoke","Sicaran Venator","Vehicle","Chaos","Tzeentch","Smoke","Sicaran Venator","Vehicle","Chaos","Tzeentch","Smoke","Sicaran Venator"],"factionKeywords":["Thousand Sons",""],"composition":["1 Sicaran Venator"],"points":[{"models":"1 model","cost":"180"}],"canLead":[],"ledBy":[]},{"id":"000003635","name":"Sokar-pattern Stormbird","role":"Other","loadout":"This model is equipped with: hellstrike missile battery; 3 twin heavy bolters; 4 twin lascannons; armoured hull.","transport":"This model has a transport capacity of 55 Thousand Sons Infantry or Thousand Sons Mounted models. Each Jump Pack, Wulfen, Gravis, Possessed or Terminator model takes up the space of 2 models and each MOUNTED, Centurion or Obliterator model takes up the space of 3 models. This model can also transport up to 1 Rhino model (this model – and any models embarked within it – take up the space of 25 models).","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Sokar-pattern Stormbird","m":"20+\"","t":"13","sv":"2+","invSv":"4","w":"40","ld":"6+","oc":"0"}],"weapons":[{"name":"Armoured hull","type":"Melee","profiles":[{"name":"Armoured hull","range":"Melee","type":"Melee","a":"9","bsWs":"4","s":"9","ap":"0","d":"1","desc":null},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Hellstrike missile battery","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"10","ap":"-3","d":"D6","desc":"anti-fly 3+"},{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Aerial Assault","description":"Each time a unit with the Deep Strike ability disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"}],"keywords":["Aircraft","Vehicle","Fly","Sokar-pattern Stormbird","Tzeentch","Chaos","Transport","Aircraft","Fly","Titanic","Vehicle","Sokar-pattern Stormbird","Tzeentch","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Vehicle","Titanic","Fly","Aircraft","Transport","Chaos","Tzeentch","Sokar-pattern Stormbird","Titanic","Chaos","Transport"],"factionKeywords":["","Thousand Sons"],"composition":["1 Sokar-pattern Stormbird"],"points":[{"models":"1 model","cost":"900"}],"canLead":[],"ledBy":[]},{"id":"000001016","name":"Sorcerer","role":"Characters","loadout":"This model is equipped with: inferno bolt pistol; Pandaemonic Delusion; force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Sorcerer","m":"6\"","t":"4","sv":"3+","invSv":"5","w":"4","ld":"6+","oc":"1"}],"weapons":[{"name":"Inferno bolt pistol","type":"Ranged","profiles":[{"name":"Inferno bolt pistol","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"4","ap":"-1","d":"1","desc":"pistol"}]},{"name":"Pandaemonic Delusion","type":"Ranged","profiles":[{"name":"Pandaemonic Delusion","range":"24","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"psychic, sustained hits 3"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"6","ap":"-1","d":"D3","desc":"psychic"}]},{"name":"Prosperine khopesh","type":"Melee","profiles":[{"name":"Prosperine khopesh","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Empyric Guidance (Psychic)","description":"While this model is leading a unit, weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Twisted Sorceries (Psychic)","description":"Once per battle, in your Shooting phase or the Fight phase, this model can use this ability. If it does, until the end of the phase, improve the Strength and Attacks characteristics of Psychic weapons equipped by this model by 3.","type":"Datasheet"}],"keywords":["Sorcerer","Tzeentch","Chaos","Grenades","Psyker","Character","Infantry"],"factionKeywords":["","Thousand Sons"],"composition":["1 Sorcerer"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000001020"],"ledBy":[]},{"id":"000001017","name":"Sorcerer In Terminator Armour","role":"Characters","loadout":"This model is equipped with: Gaze of Hate; inferno combi-bolter; force weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Sorcerer In Terminator Armour","m":"5\"","t":"5","sv":"2+","invSv":"4","w":"5","ld":"6+","oc":"1"}],"weapons":[{"name":"Gaze of Hate","type":"Ranged","profiles":[{"name":"Gaze of Hate","range":"18","type":"Ranged","a":"3","bsWs":"3","s":"4","ap":"-3","d":"2","desc":"anti-monster 4+, anti-vehicle 4+, devastating wounds, psychic"}]},{"name":"Inferno combi-bolter","type":"Ranged","profiles":[{"name":"Inferno combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"-2","d":"1","desc":"rapid fire 2"}]},{"name":"Inferno combi-weapon","type":"Ranged","profiles":[{"name":"Inferno combi-weapon","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-2","d":"1","desc":"anti-infantry 4+, devastating wounds, rapid fire 1"}]},{"name":"Force weapon","type":"Melee","profiles":[{"name":"Force weapon","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"6","ap":"-1","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Empyric Guidance (Psychic)","description":"While this model is leading a unit, weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"},{"name":"Marked by Fate (Psychic)","description":"At the start of your Shooting phase, select one enemy unit that is visible to this PSYKER model. Until the end of the phase, each time a model in this unit makes an attack that targets that enemy unit, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Tzeentch","Character","Infantry","Sorcerer","Terminator","Chaos","Psyker"],"factionKeywords":["Thousand Sons",""],"composition":["1 Sorcerer In Terminator Armour"],"points":[{"models":"1 model","cost":"85"}],"canLead":["000001035"],"ledBy":[]},{"id":"000003619","name":"Spartan","role":"Other","loadout":"This model is equipped with: 2 quad lascannons; twin heavy bolter; armoured tracks.","transport":"This model has a transport capacity of 28 Thousand Sons Infantry models. Each Jump Pack, Wulfen, Gravis, Possessed or Terminator model takes up the space of 2 models and each Centurion or Obliterator model takes up the space of 3 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Spartan","m":"10\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"6+","oc":"6"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Laser destroyer","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"14","ap":"-4","d":"D6+1","desc":"heavy"},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Quad lascannon","range":"48","type":"Ranged","a":"4","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Twin heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"torrent, ignores cover"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Assault Ramp","description":"Each time a unit disembarks from this model after it has made a Normal move, that unit is still eligible to declare a charge this turn.","type":"Datasheet"}],"keywords":["Transport","Smoke","Spartan","Vehicle","Chaos","Tzeentch","Transport","Smoke","Spartan","Vehicle","Chaos","Tzeentch","Transport","Smoke","Spartan","Vehicle","Chaos","Tzeentch","Transport","Smoke","Spartan","Vehicle","Chaos","Tzeentch","Transport","Smoke","Spartan","Vehicle","Chaos","Tzeentch"],"factionKeywords":["","Thousand Sons"],"composition":["1 Spartan"],"points":[{"models":"1 model","cost":"300"}],"canLead":[],"ledBy":[]},{"id":"000003671","name":"Storm Eagle Gunship","role":"Other","loadout":"This model is equipped with: twin heavy bolter; 2 twin hellstrike launchers; vengeance launcher; armoured hull.","transport":"This model has a transport capacity of 22 Thousand Sons Infantry models and 1 Dreadnought model. Each Jump Pack, Wulfen, Gravis, Terminator or Possessed model takes up the space of 2 models and each Centurion or Obliterator model takes up the space of 3 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Storm Eagle Gunship","m":"20+\"","t":"10","sv":"3+","invSv":"-","w":"18","ld":"6+","oc":"0"}],"weapons":[{"name":"Twin lascannon","type":"Ranged","profiles":[{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"},{"name":"Typhoon missile launcher – frag","range":"48","type":"Ranged","a":"2D6","bsWs":"3","s":"4","ap":"0","d":"1","desc":"blast"},{"name":"Twin hellstrike launcher","range":"72","type":"Ranged","a":"2","bsWs":"3","s":"10","ap":"-3","d":"D6","desc":"anti-fly 2+, twin-linked"},{"name":"Twin heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1, twin-linked"},{"name":"Twin multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2, twin-linked"},{"name":"Vengeance launcher","range":"48","type":"Ranged","a":"2D6","bsWs":"3","s":"6","ap":"0","d":"1","desc":"blast"},{"name":"Typhoon missile launcher – krak","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null},{"name":"Armoured hull","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Armoured Resilience","description":"Each time an attack is allocated to this model, subtract 1 from the Damage characteristic of that attack.","type":"Datasheet"}],"keywords":["Vehicle","Vehicle","Fly","Aircraft","Fly","Aircraft","Chaos","Transport","Chaos","Tzeentch","Storm Eagle Gunship","Tzeentch","Chaos","Transport","Aircraft","Fly","Storm Eagle Gunship","Storm Eagle Gunship","Tzeentch","Chaos","Transport","Aircraft","Fly","Vehicle","Storm Eagle Gunship","Tzeentch","Chaos","Transport","Aircraft","Fly","Vehicle","Storm Eagle Gunship","Tzeentch","Vehicle","Transport","Aircraft","Fly","Vehicle","Storm Eagle Gunship","Tzeentch","Chaos","Transport","Aircraft","Fly","Vehicle","Storm Eagle Gunship","Tzeentch","Chaos","Transport"],"factionKeywords":["","Thousand Sons"],"composition":["1 Storm Eagle Gunship"],"points":[{"models":"1 model","cost":"250"}],"canLead":[],"ledBy":[]},{"id":"000003603","name":"Terrax-pattern Termite","role":"Dedicated Transports","loadout":"This model is equipped with: Terrax melta cutter; 2 combi-bolters; Termite drill.","transport":"This model has a transport capacity of 12 Thousand Sons Infantry models. It cannot transport Jump Pack, Wulfen, Phobos, Gravis, Centurion, Terminator, Obliterator, Possessed or Tacticus models (excluding TACTICUS CHARACTER models that began the battle attached to a non-TACTICUS unit).","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Terrax-pattern Termite","m":"8\"","t":"10","sv":"3+","invSv":"-","w":"14","ld":"6+","oc":"2"}],"weapons":[{"name":"Combi-bolter","type":"Ranged","profiles":[{"name":"Combi-bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"torrent, ignores cover"},{"name":"Terrax melta cutter","range":"12","type":"Ranged","a":"5","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Twin volkite charger","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"5","ap":"0","d":"2","desc":"devastating wounds, twin-linked"},{"name":"Termite drill","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"14","ap":"-2","d":"D3+3","desc":"anti-vehicle 3+"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Termite Assault","description":"This model must start the battle in Reserves, but neither it nor any units embarked within it are counted towards any limits placed on the maximum number of Reserves units you can start the battle with. This model can be set up in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules. Any units embarked within this model can disembark after it has been set up on the battlefield, and if they do they must be set up more than 9\" away from all enemy models.","type":"Datasheet"}],"keywords":["Vehicle","Tzeentch","Transport","Dedicated Transport","Terrax-pattern Termite","Vehicle","Chaos","Tzeentch","Dedicated Transport","Dedicated Transport","Terrax-pattern Termite","Terrax-pattern Termite","Dedicated Transport","Transport","Tzeentch","Chaos","Vehicle","Terrax-pattern Termite","Dedicated Transport","Transport","Tzeentch","Chaos","Vehicle","Chaos","Vehicle","Terrax-pattern Termite","Transport","Tzeentch","Chaos","Transport"],"factionKeywords":["Thousand Sons",""],"composition":["1 Terrax-pattern Termite"],"points":[{"models":"1 model","cost":"200"}],"canLead":[],"ledBy":[]},{"id":"000003679","name":"Typhon","role":"Other","loadout":"This model is equipped with: dreadhammer siege cannon; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Typhon","m":"10\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"6+","oc":"6"}],"weapons":[{"name":"Heavy bolter","type":"Ranged","profiles":[{"name":"Heavy bolter","range":"36","type":"Ranged","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":"sustained hits 1"},{"name":"Dreadhammer siege cannon","range":"24","type":"Ranged","a":"D6+6","bsWs":"3","s":"14","ap":"-3","d":"D6","desc":"blast"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"8","ap":"0","d":"1","desc":null},{"name":"Multi-melta","range":"18","type":"Ranged","a":"2","bsWs":"3","s":"9","ap":"-4","d":"D6","desc":"melta 2"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Heavy flamer","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"5","ap":"-1","d":"1","desc":"torrent, ignores cover"},{"name":"Lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Sunderer of Fortresses","description":"Each time this model makes an attack that targets a VEHICLE, improve the Strength and Damage characteristic of that attack by 1 (if that attack targets a FORTIFICATION unit, improve the Strength and Damage characteristics of that attack by 2 instead).","type":"Datasheet"}],"keywords":["Vehicle","Chaos","Tzeentch","Vehicle","Typhon","Vehicle","Chaos","Tzeentch","Smoke","Typhon","Chaos","Smoke","Tzeentch","Smoke","Typhon","Vehicle","Chaos","Tzeentch","Smoke","Typhon"],"factionKeywords":["Thousand Sons",""],"composition":["1 Typhon"],"points":[{"models":"1 model","cost":"320"}],"canLead":[],"ledBy":[]},{"id":"000001474","name":"Tzaangor Enlightened","role":"Other","loadout":"Every model is equipped with: divining spear.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tzaangor Enlightened","m":"10\"","t":"4","sv":"5+","invSv":"5","w":"2","ld":"7+","oc":"2"}],"weapons":[{"name":"Autopistol","type":"Ranged","profiles":[{"name":"Autopistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"4","ap":"0","d":"1","desc":"precision"}]},{"name":"Divining spear","type":"Melee","profiles":[{"name":"Divining spear","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"-1","d":"2","desc":"lance, precision"}]}],"abilities":[{"name":"Prophesied Doom","description":"Each time this unit ends a Charge move, select one enemy unit within Engagement Range of it, then roll one D6 for each model in this unit that is within Engagement Range of that enemy unit: for each 4+, that enemy unit suffers 1 mortal wound.","type":"Datasheet"}],"keywords":["Mutant","Mounted","Fly","Tzeentch","Chaos","Tzaangor Enlightened"],"factionKeywords":["Thousand Sons",""],"composition":["1 Aviarch","2-5 Enlightened"],"points":[{"models":"3 models","cost":"45"},{"models":"6 models","cost":"90"}],"canLead":[],"ledBy":["000001032","000002755","000001472"]},{"id":"000004122","name":"Tzaangor Enlightened with Fatecaster Greatbows","role":"Other","loadout":"Every model is equipped with: fatecaster greatbow; close combat weapon.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tzaangor Enlightened with Fatecaster Greatbows","m":"10\"","t":"4","sv":"5+","invSv":"5","w":"2","ld":"7+","oc":"2"}],"weapons":[{"name":"Fatecaster greatbow","type":"Ranged","profiles":[{"name":"Fatecaster greatbow","range":"30","type":"Ranged","a":"2","bsWs":"4","s":"5","ap":"-2","d":"2","desc":"ignores cover, lethal hits, precision"}]},{"name":"Close combat weapon","type":"Melee","profiles":[{"name":"Close combat weapon","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Malign Trickery","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, if this unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to D6\".","type":"Datasheet"}],"keywords":["Tzaangor Enlightened","Mounted","Mutant","Chaos","Tzeentch","Fly","Tzaangor Enlightened with Fatecaster Greatbows"],"factionKeywords":["","Thousand Sons"],"composition":["1 Aviarch","2-5 Enlightened"],"points":[{"models":"3 models","cost":"55"},{"models":"6 models","cost":"110"}],"canLead":[],"ledBy":["000001032","000002755","000001472"]},{"id":"000001472","name":"Tzaangor Shaman","role":"Characters","loadout":"This model is equipped with: Baleful Devolution; force stave.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tzaangor Shaman","m":"10\"","t":"4","sv":"5+","invSv":"5","w":"4","ld":"7+","oc":"2"}],"weapons":[{"name":"Baleful Devolution","type":"Ranged","profiles":[{"name":"Baleful Devolution","range":"18","type":"Ranged","a":"D6","bsWs":"3","s":"9","ap":"0","d":"1","desc":"blast, devastating wounds, psychic"}]},{"name":"Force stave","type":"Melee","profiles":[{"name":"Force stave","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-1","d":"D3","desc":"psychic"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Cabal of Sorcerers","description":"If your Army Faction is Thousand Sons, at the start of your Shooting phase, one or more models from your army with this ability can attempt Rituals from those listed below. To do so, select one model from your army with this ability that has not yet attempted a Ritual this turn and select one Ritual no model from your army has attempted to manifest this turn, then take a Psychic test for that model by following the sequence below. PSYCHIC TEST SEQUENCERoll 2D6 Channel the Warp (Optional) Then, if one or more doubles or triples were rolled during this test, that model’s unit suffers D3 mortal wounds.If that model is not destroyed, the combined total of all the dice rolled during this test is the Psychic test result. If this equals or exceeds the Warp Charge value of the Ritual being attempted, that model manifests that Ritual and you resolve its effects. DESTINY’S RUIN (PSYCHIC)WARP CHARGE5Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, re-roll a Hit roll of 1. If the Psychic test result for this Ritual was 10+, you can re-roll the Hit roll instead.TEMPORAL SURGE (PSYCHIC)WARP CHARGE6Select one friendly THOUSAND SONS or SCINTILLATING LEGIONS unit that is not within Engagement Range of one or more enemy units and is within 24\" of and visible to the manifesting model. That unit can make a Normal move of up to D6\". If the Psychic test result for this Ritual was 10+, that unit can make a Normal move of up to 6\" instead. In either case, until the end of the turn, that unit is not eligible to declare a charge.DOOMBOLT (PSYCHIC)WARP CHARGE7Select one enemy unit within 24\" of and visible to the manifesting model (excluding units with the Lone Operative ability that are not part of an Attached unit and are not within 12\" of the manifesting model); that unit suffers D3 mortal wounds. If the Psychic test result for this Ritual was 11+, that unit suffers D3+3 mortal wounds instead.TWIST OF FATE (PSYCHIC)WARP CHARGE9Select one enemy unit within 24\" of and visible to the manifesting model. Until the end of the phase, each time a THOUSAND SONS or SCINTILLATING LEGIONS model from your army makes an attack that targets that unit, improve the Armour Penetration characteristic of that attack by 1. If the Psychic test result for this Ritual was 12+, improve the Armour Penetration characteristic of that attack by 2 instead.","type":"Faction"},{"name":"Bestial Prophet","description":"While this model is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll.","type":"Datasheet"},{"name":"Sacrificial Blessing","description":"While this model is leading a unit, in your Shooting phase and the Fight phase, each time that unit is selected to shoot or fight, this model can use this ability. If it does, select one Bodyguard model in that unit; that Bodyguard model is destroyed and, until the end of the phase, add D3 to the Attacks and Strength characteristics of Psychic weapons equipped by this model.","type":"Datasheet"}],"keywords":["Mounted","Infantry","Character","Psyker","Tzeentch","Mutant","Tzaangor Shaman","Fly","Chaos"],"factionKeywords":["Thousand Sons",""],"composition":["1 Tzaangor Shaman"],"points":[{"models":"1 model","cost":"60"}],"canLead":["000001034","000004122","000001474"],"ledBy":[]},{"id":"000001034","name":"Tzaangors","role":"Other","loadout":"Every model is equipped with: Tzaangor blades.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tzaangors","m":"6\"","t":"4","sv":"6+","invSv":"6","w":"1","ld":"7+","oc":"1"}],"weapons":[{"name":"Autopistol","type":"Ranged","profiles":[{"name":"Autopistol","range":"12","type":"Ranged","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Chainsword","type":"Melee","profiles":[{"name":"Chainsword","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Tzaangor blades","type":"Melee","profiles":[{"name":"Tzaangor blades","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Ambushing Hunters","description":"At the end of your opponent’s turn, if this unit is more than 6\" horizontally away from all enemy units, you can remove this unit from the battlefield and place it into Strategic Reserves.","type":"Datasheet"},{"name":"Brayhorn","description":"You can re-roll Advance and Charge rolls made for the bearer’s unit.","type":"Wargear"},{"name":"Herd Banner","description":"While the bearer’s unit is within range of one or more objective markers you control, improve the Leadership characteristic of models in the bearer’s unit by 1.","type":"Wargear"}],"keywords":["Tzaangors","Mutant","Tzeentch","Chaos","Infantry"],"factionKeywords":["","Thousand Sons"],"composition":["1 Twistbray","9-19 Tzaangors"],"points":[{"models":"10 models","cost":"70"},{"models":"20 models","cost":"160"}],"canLead":[],"ledBy":["000001472"]},{"id":"000003659","name":"Whirlwind Scorpius","role":"Other","loadout":"This model is equipped with: Scorpius multi-launcher; armoured tracks.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Whirlwind Scorpius","m":"10\"","t":"10","sv":"3+","invSv":"-","w":"11","ld":"6+","oc":"3"}],"weapons":[{"name":"Hunter-killer missile","type":"Ranged","profiles":[{"name":"Hunter-killer missile","range":"48","type":"Ranged","a":"1","bsWs":"2","s":"14","ap":"-3","d":"D6","desc":"one shot"},{"name":"Scorpius multi-launcher","range":"48","type":"Ranged","a":"2D3+3","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"blast, indirect fire"},{"name":"Storm bolter","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"4","ap":"0","d":"1","desc":"rapid fire 2"},{"name":"Armoured tracks","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Pinning Bombardment","description":"In your Shooting phase, after this model has shot, if one or more of those attacks made with its Scorpius multi-launcher scored a hit against an enemy INFANTRY unit, that unit must take a Battle-shock test.","type":"Datasheet"},{"name":"One Shot","description":"The bearer can only shoot with this weapon once per battle.","type":"Wargear profile"}],"keywords":["Chaos","Tzeentch","Whirlwind Scorpius","Vehicle","Smoke","Chaos","Tzeentch","Chaos","Whirlwind Scorpius","Vehicle","Smoke","Chaos","Tzeentch","Whirlwind Scorpius","Tzeentch","Whirlwind Scorpius","Vehicle","Smoke","Vehicle","Smoke"],"factionKeywords":["","Thousand Sons"],"composition":["1 Whirlwind Scorpius"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]},{"id":"000003663","name":"Xiphon Interceptor","role":"Other","loadout":"This model is equipped with: 2 twin lascannons; Xiphon missile battery; armoured hull.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Xiphon Interceptor","m":"20+\"","t":"9","sv":"3+","invSv":"-","w":"12","ld":"6+","oc":"0"}],"weapons":[{"name":"Twin lascannon","type":"Ranged","profiles":[{"name":"Twin lascannon","range":"48","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"twin-linked"},{"name":"Xiphon missile battery","range":"60","type":"Ranged","a":"3","bsWs":"3","s":"7","ap":"-1","d":"3","desc":"anti-fly 2+"},{"name":"Armoured hull","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Interceptor","description":"Each time this model makes a ranged attack that targets a unit that can Fly, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly","Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly","Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly","Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly","Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly","Aircraft","Chaos","Tzeentch","Xiphon Interceptor","Vehicle","Fly"],"factionKeywords":["Thousand Sons",""],"composition":["1 Xiphon Interceptor"],"points":[{"models":"1 model","cost":"115"}],"canLead":[],"ledBy":[]}]}