{"id":"TYR","name":"Tyranids","lastUpdate":"2026-02-17 13:32:38","detachments":[{"name":"Assimilation Swarm","rules":[{"name":"Feed the Swarm","description":"In your Command phase, each Harvester unit from your army can Regenerate one friendly TYRANIDS unit that is within 6\" of it. A unit can only be regenerated once per phase. Each time a unit regenerates, do one of the following: One model in that unit regains up to D3+1 lost wounds.One destroyed Infantry model (excluding Characters) is returned to that unit with its full wounds remaining. If that unit is an Endless Multitude unit, up to 3 destroyed models are returned instead."}],"enhancements":[{"name":"Regenerating Monstrosity","description":"TYRANIDS model only (excluding Monsters models). The bearer’s unit can be regenerated up to twice per phase, instead of once.","cost":"20"},{"name":"Instinctive Defence","description":"TYRANIDS model only. While the bearer is within 6\" of one or more friendly Harvester units, you can target the bearer’s unit with the Heroic Intervention Stratagem for 0CP. In addition, while the bearer is within 6\" of one or more friendly HARVESTER units, models in the bearer’s unit have the Fights First ability.","cost":"15"},{"name":"Biophagic Flow (Aura)","description":"TYRANIDS model only. While a friendly Harvester model is within 12\" of the bearer, when using the Feed the Swarm ability, that HARVESTER model can Regenerate one friendly TYRANIDS unit that is within 9\" of it, instead of one within 6\".","cost":"10"},{"name":"Parasitic Biomorphology","description":"TYRANIDS model only. Add 1 to the Strength characteristic of melee weapons equipped by models in the bearer’s unit. The first time the bearer’s unit destroys an enemy unit in the Fight phase while the bearer is within 6\" of one or more friendly Harvester units, until the end of the battle, add 1 to the Attacks characteristic of melee weapons equipped by models in the bearer’s unit.","cost":"25"}],"stratagems":[{"name":"RAPACIOUS HUNGER","type":"Assimilation Swarm – Battle Tactic Stratagem","cost":"1","when":"Your turn – Fight phase","description":"WHEN: Your Fight phase. TARGET: One TYRANIDS unit from your army that just destroyed an enemy unit. EFFECT: Your unit immediately Regenerates (See Feed the Swarm). When doing so, if your unit is a Harvester unit and you choose for one model to regain up to D3 lost wounds, that model regains up to 3 lost wounds instead."},{"name":"BROODGUARD IMPULSE","type":"Assimilation Swarm – Epic Deed Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One Harvester unit from your army that was just destroyed. You can use this Stratagem on that unit even though it was just destroyed. EFFECT: Until the end of the battle, each time a friendly TYRANIDS model makes an attack that targets the enemy unit that just destroyed your HARVESTER unit, add 1 to the Wound roll."},{"name":"ABLATIVE CARAPACE","type":"Assimilation Swarm – Epic Deed Stratagem","cost":"2","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Harvester unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 5+ ability. If your unit is within range of an objective marker you control, until the end of the phase models in your unit have the Feel No Pain 4+ ability instead."},{"name":"RECLAIM BIOMASS","type":"Assimilation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, when a TYRANIDS unit from your army is destroyed, before the last model in it is removed from play. TARGET: One Harvester unit from your army that is within 6\" of that destroyed unit. EFFECT: Regenerate one friendly TYRANIDS unit within 6\" of your HARVESTER unit (See Feed the Swarm)."},{"name":"TYRANNOFORMED","type":"Assimilation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Command phase. TARGET: One Harvester unit from your army that is within range of an objective marker you control. EFFECT: That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn."},{"name":"SECURE BIOMASS","type":"Assimilation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One TYRANIDS unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [LETHAL HITS] ability. If your unit is a Harvester unit, each time a model in that unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit as well."}]},{"name":"Biotide","rules":[{"name":"Unstoppable Swarm","description":"Each time a TYRANIDS unit from your army moves, models in that unit can move through friendly TYRANIDS models as if they were not there. In addition, each time a TYRANIDS unit from your army attempts to operate a closed Hatchway, if your opponent tries to prevent it, add 1 to your result of the roll-off."}],"enhancements":[{"name":"Synaptic Beacon","description":"While a friendly TYRANIDS unit is within 9\" of the bearer (ignoring Walls and closed Hatchways), that unit is within Synapse Range of the bearer and of your army.","cost":"0"},{"name":"Hypersurge Gland","description":"Once per battle, at the end of your opponents Charge phase, the bearer can use this Enhancement. If it does, it can declare a charge as if it were your Charge phase.","cost":"0"}],"stratagems":[{"name":"ONRUSHING HORDE","type":"Biotide – Battle Tactic Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One TYRANIDS unit from your army (excluding WINGED TYRANID PRIME units), that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"SWARM HUNTERS","type":"Biotide – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One TERMAGANTs unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, models in your unit can ignore other models in their unit for the purposes of determining visibility. In addition, if your unit is within Synapse Range of your army, each time a model in your unit makes an attack, you can re-roll the Hit roll."},{"name":"SQUIRMING MASSES","type":"Biotide – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, at the start of the Reinforcements step. TARGET: One ENDLESS MULTITUDE unit from your army that is in Reserves. EFFECT: Until the end of the phase, models in your unit have the Deep Strike ability and, when setting them upon the battlefield using that ability, they can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units, provided they are also within Synapse Range of your army. RESTRICTIONS: You can only use this Stratagem once and, until the end of the turn, your unit is not eligible to declare a charge."},{"name":"LIVING AVALANCHE","type":"Biotide – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a TYRANIDS unit from your army has opened a Hatchway. TARGET: That TYRANIDS unit. EFFECT: Your unit can make a Swarm move. To do so, your unit can be moved up to 3\", but at least one model from your unit must end that move on the opposite side of that Hatchway from the one it started the phase on. When doing so, those models can be moved within Engagement Range of enemy units."}]},{"name":"Boarding Swarm","rules":[{"name":"Priority Predation","description":"Each time an enemy unit within Engagement Range of one or more TYRANIDS units from your army is selected to Fall Back, after that enemy unit has made that Fall Back move, for each of those TYRANIDS units, if there are no other enemy units within Engagement Range of it, it can make a Normal move of up to 3\"."}],"enhancements":[{"name":"Monoform Predators","description":"TYRANiDS models in this Detachment cannot be given Enhancements.","cost":"0"}],"stratagems":[{"name":"LITHE KILLERS","type":"Boarding Swarm – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have a 5+ invulnerable save."},{"name":"TALON-TIP SWARM","type":"Boarding Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after a TYRANIDS unit from your army destroys an enemy unit. TARGET: That TYRANIDS unit. EFFECT: If your unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 3\". After that move, if your unit is within range of an objective marker and no enemy units are within range of that objective marker, that objective marker is Secured by your army."},{"name":"PREDATORY POUNCE","type":"Boarding Swarm – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit opens a Hatchway. TARGET: One TYRANIDS unit from your army that is within 3\" of that Hatchway and is not within Engagement Range of one or more enemy units. EFFECT: Your unit can make a Pounce move. To do so, your unit can be moved up to 3\", but must end that move as close as possible to that Hatchway. When doing so, those models can be moved within Engagement Range of that enemy unit, but only that enemy unit."},{"name":"ADRENALISED SLAUGHTER","type":"Boarding Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6. On a 5+, do not remove the destroyed model from play; it can fight after the attacking unit has finished making its attacks, and is then removed from play."}]},{"name":"Crusher Stampede","rules":[{"name":"Enraged Behemoths","description":"Each time a Tyranids Monster model from your army makes an attack, add 1 to the Hit roll if that model’s unit is below its Starting Strength, and add 1 to the Wound roll as well if that model’s unit is Below Half-strength. In addition, while a TYRANIDS MONSTER unit from your army (excluding Battle-shocked units) is at its Starting Strength, add 2 to the Objective Control characteristic of models in that unit."}],"enhancements":[{"name":"Ominous Presence","description":"Tyranids Monster model only. Add 3 to the bearer’s Objective Control characteristic.","cost":"15"},{"name":"Enraged Reserves","description":"Tyranids Monster model only. If the bearer is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 3+, do not remove it from play. It can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.","cost":"20"},{"name":"Null Nodules","description":"Tyranids Monster model only. Once per battle, when a Psychic Attack is allocated to the bearer, it can use this ability. If it does, until the end of the phase, the bearer has the Feel No Pain 5+ ability against Psychic Attacks.","cost":"10"},{"name":"Monstrous Nemesis","description":"Tyranids Monster model only. Each time the bearer makes a melee attack that targets a MONSTER or VEHICLE unit, add 1 to the Wound roll.","cost":"25"}],"stratagems":[{"name":"SAVAGE ROAR","type":"Crusher Stampede – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One Tyranids Monster unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: That enemy unit must take a Battle-shock test and, until the end of the phase, each time a model in that enemy unit makes an attack that targets your unit, subtract 1 from the Hit roll. If that Battle-shock test was failed, subtract 1 from the Wound roll as well."},{"name":"SWARM-GUIDED SALVOES","type":"Crusher Stampede – Battle Tactic Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Tyranids Monster unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [IGNORES COVER] ability, and until the end of the phase each time a model in your unit makes an attack, you can ignore any or all modifiers to that model’s Ballistic Skill characteristic and any or all modifiers to the Hit roll."},{"name":"RAMPAGING MONSTROSITIES","type":"Crusher Stampede – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One Tyranids Monster unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll."},{"name":"MASSIVE IMPACT","type":"Crusher Stampede – Epic Deed Stratagem","cost":"1","when":"Your turn – Charge phase","description":"WHEN: Your Charge phase, just after a Tyranids Monster model from your army ends a Charge move. TARGET: That TYRANIDS MONSTER model. EFFECT: Select one enemy unit within Engagement Range of your model and roll six D6: for each 4+, that enemy unit suffers 1 mortal wound."},{"name":"UNTRAMMELLED FEROCITY","type":"Crusher Stampede – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One Tyranids Monster unit from your army that has not been selected to move this phase. EFFECT: Until the end of the phase, each time a model in your unit makes a Normal, Advance or Fall Back move, it can move through models (excluding TITANIC models) and sections of terrain features that are 4\" or less in height. When doing so: It can move within Engagement Range of enemy models, but cannot end that move within Engagement Range of them. It can also move through sections of terrain features that are more than 4\" in height, but if it does, after its unit has moved, roll one D6: on a 1, your unit is Battle-shocked."},{"name":"CORROSIVE VISCERA","type":"Crusher Stampede – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after a Tyranids Monster model from your army with the Deadly Demise ability that cannot FLY is destroyed. TARGET: That TYRANIDS MONSTER model. You can use this Stratagem on that model even though it was just destroyed. EFFECT: Do not roll one D6 to determine whether mortal wounds are inflicted by your model’s Deadly Demise ability. Instead, mortal wounds are automatically inflicted."}]},{"name":"Infestation Swarm","rules":[{"name":"Half-Glimpsed Shadows","description":"Each time a ranged attack targets a GREAT DEvOURER unit from your army, if the attacking model is not within 6\" of that unit, subtract 1 from the Hit roll."}],"enhancements":[{"name":"Stalking Menace","description":"Once per battle, at the end of your opponent’s Fight phase, if the bearer is not within Engagement Range of one or more enemy units, it can use this Enhancement. If it does, remove the bearer from the battlefield and place it into Strategic Reserves. It will arrive back on the battlefield in the Reinforcements step of your next Movement phase as if it had the Deep Strike ability. If this is not possible, the bearer is destroyed. When the bearer is set back up on the battlefield, until the end of the turn, it cannot declare a charge.","cost":"0"},{"name":"Psi-spoor Sensitivity","description":"Each time the bearer declares a charge, it can target enemy units that are not visible to it.","cost":"0"}],"stratagems":[{"name":"HYPERADRENAL REFLEXES","type":"Infestation Swarm – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One GREAT DEVOURER unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have a 4+ invulnerable save."},{"name":"PERVASIVE DREAD","type":"Infestation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after the enemy WARLORD is destroyed (and is not returned to the battlefield) by a GREAT DEVOURER unit from your army. TARGET: That GREAT DEVOURER unit. EFFECT: In your opponent’s next Command phase, each enemy unit on the battlefield must take a Battle-shock test, subtracting 1 from the result. This Stratagem cannot cause a unit to take two Battle-shock tests in the same phase."},{"name":"HUNTING GROUNDS","type":"Infestation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase, just after a GREAT DEVOURER unit from your army opens a Hatchway. TARGET: That GREAT DEVOURER unit. EFFECT: Your unit can make a Normal move of up to 3\", provided at least one of its models ends that move on the opposite side of that Hatchway from when your unit opened it."},{"name":"OUTFLANK","type":"Infestation Swarm – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: One GENESTEALERs or PURESTRAIN GENESTEALERS unit from your army that is wholly within an Entry Zone. EFFECT: Remove your unit from the battlefield and place it into Strategic Reserves. It will arrive back on the battlefield in the Reinforcements step of your next Movement phase. When doing so, if it was within one of your Entry Zones when it was removed, it must be set up wholly within another one of your Entry Zones. If it was within one of your opponent’s Entry Zones when it was removed, it must be set up wholly within another one of your opponent’s Entry Zones instead. If this is not possible, your unit is destroyed."}]},{"name":"Invasion Fleet","rules":[{"name":"Hyper-adaptations","description":"At the start of the first battle round, select one of the following Hyper-adaptations to be active for TYRANIDS units from your army until the end of the battle: Swarming InstinctsEach time a TYRANIDS model with this Hyper-adaptation makes an attack that targets an INFANTRY or SWARM unit, that attack has the [SUSTAINED HITS 1] ability.Hyper-aggressionEach time a TYRANIDS model with this Hyper-adaptation makes an attack that targets a MONSTER or VEHICLE unit, that attack has the [LETHAL HITS] ability.Hive PredatorsEach time a TYRANIDS model with this Hyper-adaptation makes an attack that targets a CHARACTER unit, on a Critical Hit, that attack has the [PRECISION] ability."}],"enhancements":[{"name":"Alien Cunning","description":"TYRANIDS model only. After both players have deployed their armies, select up to three TYRANIDS units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.","cost":"30"},{"name":"Perfectly Adapted","description":"TYRANIDS model only. Once per turn, you can re-roll one Hit roll, one Wound roll, one Damage roll, one Advance roll, one Charge roll or one saving throw made for the bearer.","cost":"15"},{"name":"Synaptic Linchpin","description":"TYRANIDS model only. While a friendly TYRANIDS unit is within 9\" of the bearer, that unit is within Synapse Range of your army.","cost":"20"},{"name":"Adaptive Biology","description":"TYRANIDS model only. The bearer has the Feel No Pain 5+ ability. At the start of any turn, if the bearer has fewer than its starting number of wounds remaining, until the end of the battle, it has the Feel No Pain 4+ ability instead.","cost":"25"}],"stratagems":[{"name":"ADRENAL SURGE","type":"Invasion Fleet – Battle Tactic Stratagem","cost":"2","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: Up to two TYRANIDS units from your army that are within Synapse Range of your army and are eligible to fight, or one other TYRANIDS unit from your army that is eligible to fight. EFFECT: Until the end of the phase, each time a model in any of those selected units makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit."},{"name":"RAPID REGENERATION","type":"Invasion Fleet – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, models in your unit have the Feel No Pain 6+ ability. If your unit is within Synapse Range of your army, models in your unit have the Feel No Pain 5+ ability instead."},{"name":"OVERRUN","type":"Invasion Fleet – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just before a TYRANIDS unit from your army Consolidates. TARGET: That TYRANIDS unit. EFFECT: Until the end of the phase, each time your unit Consolidates, models in it can move an additional 3\" as long as your unit can end that move within Engagement Range of one or more enemy units. If your unit is within Synapse Range of your army and not within Engagement Range of any enemy units, instead of making that Consolidation move, it can make a Normal move of up to 6\"."},{"name":"PREDATORY IMPERATIVE","type":"Invasion Fleet – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: Up to two TYRANIDS units from your army that are within Synapse Range of your army, or one other TYRANIDS unit from your army. EFFECT: Select one Hyper-adaptation. Until the start of your next Command phase, that Hyper-adaptation is active for those selected units in addition to any other that may be active for your army. RESTRICTIONS: You cannot select the same Hyper-adaptation you selected at the start of the first battle round."},{"name":"ENDLESS SWARM","type":"Invasion Fleet – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: Up to two Endless Multitude units from your army that are within Synapse Range of your army, or one other ENDLESS MULTITUDE unit from your army. EFFECT: You can return up to D3+3 destroyed models to each of the selected units."},{"name":"DEATH FRENZY","type":"Invasion Fleet – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase, just after an enemy unit has selected its targets. TARGET: One TYRANIDS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed, if that model has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play."}]},{"name":"Subterranean Assault","rules":[{"name":"Surprise Assault","description":"Each time a Tyranids model from your army makes an attack, re-roll a Hit roll of 1. Each time a Burrower unit from your army is set up on the battlefield from Reserves, place a circular 40mm Tunnel Marker anywhere on the battlefield within 1\" of that unit and more than 3\" horizontally away from all enemy units. In the Reinforcements step of your Movement phase, when you set up a unit on the battlefield from Reserves, you can set that unit up wholly within 9\" of one of your Tunnel Markers and more than 6\" horizontally away from any enemy units. If an enemy model (excluding AIRCRAFT) ends any kind of move within 3\" of one of your Tunnel Markers, that Tunnel Marker is removed from the battlefield. KEYWORDS Mawloc and Trygon units from your army have the BURROWER keyword. In the Muster Armies step, you can select up to 2 TRYGON models from your army. The selected units gain the CHARACTER keyword. Designer’s Note: This means that the selected models can be given Enhancements and one of them can be selected as your WARLORD."}],"enhancements":[{"name":"Synaptic Strategy","description":"Tyranids model only. Once per battle, you can target the bearer’s unit with the Rapid Ingress stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase.","cost":"15"},{"name":"Tremor Senses","description":"Tyranids model only. After both players have deployed their armies, select up to three friendly TYRANIDS units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves, regardless of how many units are already in Strategic Reserves.","cost":"20"},{"name":"Vanguard Intellect","description":"Tyranids model with the Deep Strike ability only. The bearer’s unit can be set up using the Deep Strike ability in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules.","cost":"15"},{"name":"Trygon Prime","description":"Trygon model only. The bearer gains the Synapse keyword. Improve the Strength and Weapon Skill characteristics of melee weapons equipped by the bearer by 1.","cost":"20"}],"stratagems":[{"name":"ENFILADING EMERGENCE","type":"Subterranean Assault – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: End of your Movement phase. TARGET: One Tyranids unit from your army that was set up as Reinforcements this turn. EFFECT: Until the end of your next Fight phase, weapons equipped by models in your unit have the [SUSTAINED HITS 1] and [IGNORES COVER] abilities."},{"name":"TUNNEL NETWORK","type":"Subterranean Assault – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: End of your Movement phase. TARGET: One Tyranids unit from your army that is wholly within 9\" of one or more of your Tunnel Markers and not within Engagement Range of one or more enemy units. EFFECT: Remove your unit from the battlefield and set it up again, wholly within 9\" of another Tunnel Marker you placed, and more than 6\" horizontally away from all enemy units."},{"name":"SWARMING ASSAULT","type":"Subterranean Assault – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Charge phase","description":"WHEN: Your Charge phase. TARGET: One Tyranids Monster unit from your army that was set up as Reinforcements this turn. EFFECT: Until the end of the phase, friendly Tyranids units within 6\" of your unit can re-roll Charge rolls."},{"name":"RETREAT BELOW","type":"Subterranean Assault – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: One Tyranids unit or up to two Burrower units from your army that are not within Engagement Range of one or more enemy units. EFFECT: Remove your unit from the battlefield and place it into Strategic Reserves."},{"name":"ADAPTIVE OPTIMISATION","type":"Subterranean Assault – Wargear Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Command phase. TARGET: One Mawloc or Trygon unit from your army. EFFECT: Until the start of your next Command phase, your unit has the Synapse keyword."},{"name":"REPLENISHING SWARMS","type":"Subterranean Assault – Wargear Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One Tyranids unit from your army, wholly within 9\" of one or more Tunnel Markers you placed. EFFECT: One model in your unit regains up to D3+1 lost wounds, or you can return up to D3+1 destroyed models with a Wounds characteristic of 1 to your unit, with their full wounds remaining, instead."}]},{"name":"Synaptic Nexus","rules":[{"name":"Synaptic Imperatives","description":"At the start of the battle round, you can select one of the Synaptic Imperatives shown below. Until the end of the battle round, that Synaptic Imperative is active for your army and while a TYRANIDS unit from your army is within Synapse Range of your army, it will benefit from it. Each Synaptic Imperative can only be selected once per battle. Synaptic Augmentation: While this unit is within Synapse Range of your army, models in this unit have a 5+ invulnerable save.Surging Vitality: While this unit is within Synapse Range of your army, add 1 to Advance and Charge rolls made for this unit.Goaded to Slaughter: While this unit is within Synapse Range of your army, each time a model in this unit makes a melee attack, add 1 to the Hit roll."}],"enhancements":[{"name":"Power of the Hive Mind","description":"Tyranids Psyker model only. Improve the Strength and Armour Penetration characteristics of psychic weapons equipped by the bearer by 1.","cost":"10"},{"name":"Psychostatic Disruption","description":"Tyranids Synapse model only. Enemy units that arrive on the battlefield from Reserves cannot be set up within 12\" of the bearer. In addition, once per battle, during the first or second battle round, when your opponent declares that a unit will arrive on the battlefield from Strategic Reserves, the bearer can use this Enhancement. If it does, roll one D6: on a 4+, that enemy unit cannot arrive on the battlefield this turn.","cost":"30"},{"name":"Synaptic Control","description":"Tyranids Synapse model only. Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack.","cost":"20"},{"name":"The Dirgeheart of Kharis (Aura)","description":"Tyranids Synapse model only. While an enemy unit is within 9\" of the bearer, worsen that units Leadership characteristic by 1.","cost":"15"}],"stratagems":[{"name":"REINFORCED HIVE NODE","type":"Synaptic Nexus – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Synapse unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the attacking unit has finished making its attacks, each time an attack targets your unit, worsen the Armour Penetration characteristic of that attack by 1."},{"name":"IRRESISTIBLE WILL","type":"Synaptic Nexus – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One Synapse unit from your army that has not been selected to shoot or fight this phase, and one enemy unit within 24\" of and visible to the SYNAPSE unit. EFFECT: Until the end of the phase, each time a friendly TYRANIDS model makes an attack that targets that enemy unit, if the attacking model’s unit is within 6\" of your SYNAPSE unit, re-roll a Hit roll of 1 and re-roll a Wound roll of 1."},{"name":"SYNAPTIC CHANNELLING","type":"Synaptic Nexus – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Command phase","description":"WHEN: Command phase. TARGET: One Synapse unit from your army. EFFECT: Until the end of the turn, while a friendly TYRANIDS unit is within 9\" of the selected unit, that unit is within Synapse Range of your army."},{"name":"IMPERATIVE DOMINANCE","type":"Synaptic Nexus – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One TYRANIDS unit from your army that is within Synapse Range of your army. EFFECT: Select one Synaptic Imperative, even if you have already selected that imperative this battle. Until the start of your next Command phase, that Synaptic Imperative is active for your unit instead of any other Synaptic Imperative that is active for your army."},{"name":"OVERRIDE INSTINCTS","type":"Synaptic Nexus – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One TYRANIDS unit from your army that is within Synapse Range of your army and made a Fall Back move this phase. EFFECT: Your unit is eligible to shoot and declare a charge this turn."},{"name":"THE SMOTHERING SHADOW","type":"Synaptic Nexus – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just after an enemy unit fails a Battle-shock test. TARGET: One Synapse unit from your army within 12\" of that enemy unit. EFFECT: Roll six D6: for each 3+, that enemy unit suffers 1 mortal wound."}]},{"name":"Tyranid Attack","rules":[{"name":"Xeno-Terror","description":"When you unleash the Shadow in the Warp, subtract 1 from the Battle-shock test each enemy unit on the battlefield must take as a result. For each enemy unit that fails one of those tests, that enemy unit cannot Fire Overwatch this turn."}],"enhancements":[{"name":"Synaptic Goad","description":"In your Command phase, select one friendly TYRANiD WARRiORS wiTH MELEE BiO-wEAPONS or TYRANiD WARRiORS wiTH RANGED BiO-wEAPONS unit within 6\" of the bearer. Until the end of the turn, add 2\" to the Move characteristic of models in that unit.","cost":"0"},{"name":"Reinforced Carapace","description":"Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack (note that if given to a TYRANID PRIME model, this only affects that model and not other models in its unit).","cost":"0"}],"stratagems":[{"name":"BIO-ACID SURGE","type":"Tyranid Attack – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One TYRANIDS unit from your army that is within Synapse Range of your army and has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [SUSTAINED HITS 1] ability."},{"name":"HIVE SIGHT","type":"Tyranid Attack – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Charge phase","description":"WHEN: Your Charge phase. TARGET: One TYRANIDS SYNAPSE unit from your army and one friendly TYRANIDS unit that has not declared a charge this phase. EFFECT: Select one enemy unit that is visible to your SYNAPSE unit. Until the end of the phase, each time your other unit declares a charge, it can include that enemy unit as a target of that charge, even if it is not visible to it, and when doing so, add 1 to the Charge roll."},{"name":"EXPENDABLE BIOMASS","type":"Tyranid Attack – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One TYRANID WARRIORS wITH RANGED BIO-wEAPONS unit from your army that has not been selected to shoot this phase. EFFECT: Select one enemy unit that is visible to your unit and within Engagement Range of one or more friendly ENDLESS MULTITUDE or RIPPER SwARMS units. Until the end of the phase, your unit is eligible to make ranged attacks against that enemy unit as if it was not within Engagement Range of those friendly units. When doing so, each time a model in your unit makes a ranged attack, subtract 1 from the Hit roll and, after your unit has finished making its attacks, each of those friendly units that started the phase within Engagement Range of that enemy unit suffers D3 mortal wounds."},{"name":"PHAGIC SPORES","type":"Tyranid Attack – Wargear Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One TYRANID WARRIORS wITH MELEE BIO-wEAPONS or TYRANID WARRIORS wITH RANGED BIO-wEAPONS unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time a model in your unit is destroyed as a result of an attack, do not remove it from play; after the attacking unit has finished making its attacks, roll one D6: on a 3-5, the closest enemy unit within 3\" of and visible to your unit suffers 1 mortal wound; on a 6, the closest enemy unit within 3\" of and visible to your unit suffers 2 mortal wounds. The destroyed model is then removed from play."}]},{"name":"Unending Swarm","rules":[{"name":"Insurmountable Odds","description":"Each time an enemy unit is selected to shoot, after that unit has finished making its attacks, if one or more models from one or more Endless Multitude units from your army were destroyed as a result of those attacks, each such unit can make a Surge move. To do so, roll one D6: that unit can be moved a distance in inches up to the result, but that unit must end that move as close as possible to the closest enemy unit (excluding AIRCRAFT). When doing so, those models can be moved within Engagement Range of enemy units. A unit cannot make a Surge move while it is Battle-shocked."}],"enhancements":[{"name":"Relentless Hunger","description":"TYRANIDS model only. Add 2\" to the Move characteristic of models in the bearer’s unit.","cost":"20"},{"name":"Naturalised Camouflage","description":"TYRANIDS model only. At the start of the first battle round, select up to three friendly Endless Multitude units within 9\" of the bearer. Until the end of the battle round, each time a ranged attack targets one of those units, models in that unit have the Benefit of Cover against that attack.","cost":"30"},{"name":"Piercing Talons","description":"TYRANIDS model only. Each time a model in the bearer’s unit makes an attack, on a Critical Wound, improve the Armour Penetration characteristic of that attack by 1.","cost":"25"},{"name":"Adrenalised Onslaught","description":"TYRANIDS model only. Each time the bearer’s unit Piles In or Consolidates, models in this unit can move an additional 3\".","cost":"15"}],"stratagems":[{"name":"SWARMING MASSES","type":"Unending Swarm – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One Endless Multitude unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, weapons equipped by models in your unit have the [SUSTAINED HITS 1] ability, and If your unit contains 15 or more models, each time a model in your unit makes an attack, an unmodified Hit roll of 5+ scores a Critical Hit."},{"name":"TEEMING MASSES","type":"Unending Swarm – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your opponent’s Shooting phase or the Fight phase, just after an enemy unit has selected its targets. TARGET: One Endless Multitude unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll."},{"name":"BOUNDING ADVANCE","type":"Unending Swarm – Battle Tactic Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One Endless Multitude unit from your army. EFFECT: Until the end of the phase, each time your unit Advances, do not make an Advance roll. Instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit."},{"name":"SYNAPTIC GOADING","type":"Unending Swarm – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Any phase","description":"WHEN: Any phase, just before an Endless Multitude unit from your army that is within Synapse Range of your army makes a Surge move. TARGET: That ENDLESS MULTITUDE unit. EFFECT: When making that Surge move, you can re-roll the D6 to determine how far your unit moves, and your unit can end that move as close as possible to the closest objective marker (instead of as close as possible to the closest enemy unit]. All other rules for making Surge moves still apply."},{"name":"UNENDING WAVES","type":"Unending Swarm – Strategic Ploy Stratagem","cost":"2","when":"Either player’s turn – Any phase","description":"WHEN: Any phase. TARGET: One Endless Multitude unit from your army that was just destroyed. You can use this Stratagem on that unit even though it was just destroyed. EFFECT: Add a new unit to your army identical to your destroyed unit, in Strategic Reserves, at its Starting Strength. RESTRICTIONS: Any destroyed Character units that were attached to your unit are not returned. You can only use this Stratagem once per battle."},{"name":"PRESERVATION IMPERATIVE","type":"Unending Swarm – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Endless Multitude unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit is treated as containing fewer than five models for the purpose of the [BLAST] ability."}]},{"name":"Vanguard Onslaught","rules":[{"name":"Questing Tendrils","description":"TYRANIDS units with this ability are eligible to charge in a turn in which they Fell Back. Vanguard Invader units with this ability are eligible to charge in a turn in which they Advanced."}],"enhancements":[{"name":"Hunting Grounds","description":"TYRANIDS model only. While the bearer is on the battlefield, each time your opponent sets up a Reserves unit on the battlefield, roll one D6: on a 2+, that unit must take a Battle-shock test.","cost":"20"},{"name":"Chameleonic","description":"Vanguard Invader model only. The bearer has the Stealth ability and each time a ranged attack targets the bearer’s unit, models in that unit have the Benefit of Cover against that attack.","cost":"15"},{"name":"Stalker","description":"Vanguard Invader model only. At the start of the battle, select one enemy unit. Each time the bearer makes an attack that targets that enemy unit, add 1 to the Hit roll and add 1 to the Wound roll.","cost":"10"},{"name":"Neuronode","description":"TYRANIDS model only. After both players have deployed their armies, you can select up to three Vanguard Invader units from your army and redeploy all of those units. When doing so, any of those units can be placed into Strategic Reserves, regardless of how many units are already in Strategic Reserves.","cost":"20"}],"stratagems":[{"name":"ASSASSIN BEASTS","type":"Vanguard Onslaught – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Fight phase","description":"WHEN: Fight phase. TARGET: One Vanguard Invader Infantry unit from your army that has not been selected to fight this phase. EFFECT: Until the end of the phase, melee weapons equipped by models in your unit have the [PRECISION] ability."},{"name":"SURPRISE ASSAULT","type":"Vanguard Onslaught – Battle Tactic Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase, just after a Vanguard Invader unit from your army has selected its targets. TARGET: That VANGUARD INVADER unit. EFFECT: Select one enemy unit that was selected as the target of one or more of your unit’s attacks. That enemy unit must take a Battle-shock test. Until the end of the phase, each time a model in your unit makes an attack that targets that enemy unit, add 1 to the Hit roll. If the Battle-shock test was failed, add 1 to the Wound roll as well."},{"name":"UNSEEN LURKERS","type":"Vanguard Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Vanguard Invader unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: Until the end of the phase, your unit can only be selected as the target of a ranged attack if the attacking model is within 18\" or, if your unit has the Lone Operative ability, if the attacking model is within 6\". Your opponent can select new targets for the attacking unit’s attacks."},{"name":"HYPERSENSORY SCILLIA","type":"Vanguard Onslaught – Strategic Ploy Stratagem","cost":"2","when":"Opponent’s turn – Movement phase","description":"WHEN: Your opponent’s Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move. TARGET: Up to two Vanguard Invader units from your army that are within 9\" of that enemy unit, or one other Tyranids Infantry unit from your army that is within 9\" of that enemy unit. EFFECT: Those selected units can each make a Normal move of up to 6\". RESTRICTIONS: You cannot target units that are within Engagement Range of one or more enemy units."},{"name":"SEEDED BROODS","type":"Vanguard Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One TYRANIDS unit from your army that is in Reserves, or up to two Vanguard Invader units from your army that are in Reserves. EFFECT: Until the end of the phase, for the purposes of setting up those selected units on the battlefield, treat the current battle round number as being one higher than it actually is."},{"name":"INVISIBLE HUNTER","type":"Vanguard Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Fight phase","description":"WHEN: End of your opponent’s Fight phase. TARGET: Up to two Vanguard Invader units from your army, or one Tyranids Infantry unit from your army. EFFECT: Remove the targeted units from the battlefield and place them into Strategic Reserves. RESTRICTIONS: The targeted units must be more than 3\" away from all enemy units."}]},{"name":"Warrior Bioform Onslaught","rules":[{"name":"Leader-beasts","description":"Tyranid Warriors (see below) and Winged Tyranid Prime units from your army have a 5+ invulnerable save. KEYWORDS Tyranid Warriors with Ranged Bio-weapons and Tyranid Warriors with Melee Bio-weapons units from your army gain the TYRANID WARRIORS and BATTLELINE keywords, and while such a unit is not Battle-shocked, TYRANID WARRIORS models in that unit have an Objective Control characteristic of 3."}],"enhancements":[{"name":"Synaptic Tyrant","description":"Neurotyrant model only. During the Declare Battle Formations step, the bearer can be attached to a Tyranid Warriors unit.","cost":"10"},{"name":"Ocular Adaptation","description":"Winged Tyranid Prime model only. Each time a model in the bearer’s unit makes an attack, add 1 to the Hit roll.","cost":"20"},{"name":"Sensory Assimilation","description":"Winged Tyranid Prime model only. Each time an attack targets the bearer’s unit, subtract 1 from the Hit roll.","cost":"20"},{"name":"Elevated Might","description":"TYRANIDS model only. The bearer’s unit is eligible to declare a charge in a turn in which it Advanced.","cost":"30"}],"stratagems":[{"name":"SYNAPTIC MICRONODES","type":"Warrior Bioform Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Movement phase","description":"WHEN: Your Movement phase. TARGET: One Tyranid Warriors unit from your army. EFFECT: Select one objective marker you control that your unit is within range of. That objective marker remains under your control until your opponent’s Level of Control over that objective marker is greater than yours at the end of a phase."},{"name":"SYNAPTIC AMPLIFICATION","type":"Warrior Bioform Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One TYRANIDS unit from your army that has not been selected to shoot or fight this phase. EFFECT: If that unit is a Tyranid Warriors unit, select up to one Endless Multitude unit from your army, that is not Battle-shocked, within 6\" of it. Until the end of the phase, each time a model in those units makes an attack, re-roll a Wound roll of 1, and, if it is a TYRANID WARRIORS unit, re-roll a Hit roll of 1 as well."},{"name":"RESTORATIVE IMPULSE","type":"Warrior Bioform Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Command phase","description":"WHEN: Your Command phase. TARGET: One Tyranid Warriors unit from your army that is below its Starting Strength. EFFECT: Return 1 destroyed model (excluding CHARACTER models) to your unit."},{"name":"SYNAPTIC SHIELD","type":"Warrior Bioform Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Opponent’s turn – Shooting phase","description":"WHEN: Your opponent’s Shooting phase, just after an enemy unit has selected its targets. TARGET: One Tyranid Warriors unit from your army that was selected as the target of one or more of the attacking unit’s attacks. EFFECT: If that unit is a TYRANID WARRIORS unit, select up to one Endless Multitude unit from your army, that is not Battle-shocked, within 6\" of it. Until the end of the phase, each time a ranged attack targets one of those units, if the Strength characteristic of that attack is greater than the Toughness characteristic of that unit, subtract 1 from the Wound roll."},{"name":"PARASITIC PAYLOAD","type":"Warrior Bioform Onslaught – Strategic Ploy Stratagem","cost":"1","when":"Your turn – Shooting phase","description":"WHEN: Your Shooting phase. TARGET: One Tyranid Warriors with Ranged Bio-weapons unit from your army that has not been selected to shoot this phase. EFFECT: Until the end of the phase, ranged weapons equipped by models in your unit have the [IGNORES COVER] ability. After your unit has resolved its shooting attacks this phase, select one enemy unit hit by one or more of those attacks. Until the end of the turn, models in that unit cannot have the Benefit of Cover."},{"name":"SPONTANEOUS HYPERCORROSION","type":"Warrior Bioform Onslaught – Wargear Stratagem","cost":"1","when":"Either player’s turn – Shooting or Fight phase","description":"WHEN: Your Shooting phase or the Fight phase. TARGET: One TYRANIDS unit from your army that has not been selected to shoot or fight this phase. EFFECT: Until the end of the phase, add 2 to the Strength characteristic of ranged weapons equipped by models in your unit and add 1 to the Strength characteristic of melee weapons equipped by Tyranid Warriors and Winged Tyranid Prime models in your unit."}]}],"datasheets":[{"id":"000000503","name":"Barbed Hierodule","role":"Other","loadout":"This model is equipped with: 2 bio-cannons; Hierodule scything talons.","transport":null,"damagedW":"1-6","damagedDescription":"While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Barbed Hierodule","m":"8\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"8+","oc":"5"}],"weapons":[{"name":"Bio-cannon","type":"Ranged","profiles":[{"name":"Bio-cannon","range":"48","type":"Ranged","a":"D6+3","bsWs":"3","s":"9","ap":"-2","d":"2","desc":"blast"}]},{"name":"Hierodule scything talons","type":"Melee","profiles":[{"name":"Hierodule scything talons","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"14","ap":"-2","d":"D3+3","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Overgrown Barbs","description":"In your Shooting phase, after this model has shot, select one enemy unit (excluding TITANIC units) that was hit by one or more of those attacks. Until the start of your next turn, while this model is on the battlefield, that enemy unit is suppressed. While a unit is suppressed, each time a model in that unit makes an attack, subtract 1 from the Hit roll.","type":"Datasheet"}],"keywords":["Monster","Barbed Hierodule","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Barbed Hierodule"],"points":[{"models":"1 model","cost":"340"}],"canLead":[],"ledBy":[]},{"id":"000002686","name":"Barbgaunts","role":"Other","loadout":"Every model is equipped with: barblauncher; chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Barbgaunts","m":"6\"","t":"4","sv":"4+","invSv":"-","w":"2","ld":"8+","oc":"1"}],"weapons":[{"name":"Barblauncher","type":"Ranged","profiles":[{"name":"Barblauncher","range":"24","type":"Ranged","a":"D6","bsWs":"4","s":"5","ap":"0","d":"1","desc":"blast, heavy"}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Disruption Bombardment","description":"In your Shooting phase, after this unit has shot, select one enemy INFANTRY unit hit by one or more of those attacks. Until the end of your opponent’s next turn, that enemy unit is disrupted. While a unit is disrupted, subtract 2 from its Move characteristic and subtract 2 from Advance and Charge rolls made for it.","type":"Datasheet"}],"keywords":["Great Devourer","Barbgaunts","Infantry"],"factionKeywords":["Tyranids"],"composition":["5-10 Barbgaunts"],"points":[{"models":"5 models","cost":"55"},{"models":"10 models","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000000491","name":"Biovores","role":"Other","loadout":"Every model is equipped with: Spore Mine launcher; chitin-barbed limbs.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Biovores","m":"5\"","t":"6","sv":"3+","invSv":"-","w":"5","ld":"8+","oc":"1"}],"weapons":[{"name":"Spore Mine launcher","type":"Ranged","profiles":[{"name":"Spore Mine launcher","range":"48","type":"Ranged","a":"D3","bsWs":"4","s":"6","ap":"-1","d":"2","desc":"blast, devastating wounds, heavy, indirect fire"}]},{"name":"Chitin-barbed limbs","type":"Melee","profiles":[{"name":"Chitin-barbed limbs","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Seed Spore Mines","description":"Once per turn, in your Shooting phase, when selected to shoot, one unit with this ability can use it instead of making any attacks with its ranged weapons. If it does, you can add one new Spore Mines unit to your army and set it up anywhere on the battlefield that is wholly within 48\" of this unit and more than 9\" horizontally away from all enemy units. That SPORE MINES unit contains 1 model for each model in this unit.","type":"Datasheet"}],"keywords":["Great Devourer","Infantry","Biovores"],"factionKeywords":["Tyranids"],"composition":["1-3 Biovores"],"points":[{"models":"1 model","cost":"50"},{"models":"2 models","cost":"100"},{"models":"3 models","cost":"150"}],"canLead":[],"ledBy":[]},{"id":"000000463","name":"Broodlord","role":"Characters","loadout":"This model is equipped with: Broodlord claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Broodlord","m":"8\"","t":"5","sv":"4+","invSv":"4","w":"6","ld":"7+","oc":"1"}],"weapons":[{"name":"Broodlord claws and talons","type":"Melee","profiles":[{"name":"Broodlord claws and talons","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"6","ap":"-2","d":"2","desc":"devastating wounds, twin-linked"}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Vicious Insight","description":"While this model is leading a unit, weapons equipped by models in that unit have the [DEVASTATING WOUNDS] ability.","type":"Datasheet"},{"name":"Hypnotic Gaze (Psychic)","description":"At the start of the Fight phase, select one enemy unit within Engagement Range of this model. Until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll.","type":"Datasheet"}],"keywords":["Character","Infantry","Psyker","Great Devourer","Synapse","Vanguard Invader","Broodlord"],"factionKeywords":["Tyranids"],"composition":["1 Broodlord"],"points":[{"models":"1 model","cost":"80"}],"canLead":["000000467"],"ledBy":[]},{"id":"000000490","name":"Carnifexes","role":"Other","loadout":"Every model is equipped with: Carnifex scything talons; Carnifex extra scything talons; chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Carnifexes","m":"8\"","t":"9","sv":"2+","invSv":"-","w":"8","ld":"8+","oc":"3"}],"weapons":[{"name":"Bio-plasma","type":"Ranged","profiles":[{"name":"Bio-plasma","range":"12","type":"Ranged","a":"D3","bsWs":"4","s":"7","ap":"-2","d":"1","desc":"assault, blast"}]},{"name":"Deathspitters with slimer maggots","type":"Ranged","profiles":[{"name":"Deathspitters with slimer maggots","range":"24","type":"Ranged","a":"6","bsWs":"4","s":"7","ap":"-2","d":"1","desc":null}]},{"name":"Devourers with brainleech worms","type":"Ranged","profiles":[{"name":"Devourers with brainleech worms","range":"18","type":"Ranged","a":"12","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]},{"name":"Heavy venom cannon","type":"Ranged","profiles":[{"name":"Heavy venom cannon","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"9","ap":"-2","d":"3","desc":"blast"}]},{"name":"Spine banks","type":"Ranged","profiles":[{"name":"Spine banks","range":"6","type":"Ranged","a":"5","bsWs":"4","s":"5","ap":"0","d":"1","desc":"assault"}]},{"name":"Stranglethorn cannon","type":"Ranged","profiles":[{"name":"Stranglethorn cannon","range":"36","type":"Ranged","a":"D6+1","bsWs":"4","s":"7","ap":"-1","d":"2","desc":"blast"}]},{"name":"Carnifex crushing claws","type":"Melee","profiles":[{"name":"Carnifex crushing claws","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"12","ap":"-3","d":"D6+1","desc":null}]},{"name":"Carnifex extra scything talons","type":"Melee","profiles":[{"name":"Carnifex extra scything talons","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"9","ap":"-2","d":"3","desc":"extra attacks"}]},{"name":"Carnifex scything talons","type":"Melee","profiles":[{"name":"Carnifex scything talons","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"9","ap":"-2","d":"3","desc":null}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"6","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Blistering Assault","description":"Each time an enemy unit is selected to shoot, after that unit has shot, if any models from this unit lost one or more wounds as a result of those attacks, this unit can make a Blistering Assault move. If it does, roll one D6, adding 2 to the result: each model in this unit can be moved a distance in inches up to the result, but this unit must finish that move as close as possible to the closest enemy unit. When doing so, those models can be moved within Engagement Range of that enemy unit. Each unit can only make one Blistering Assault move per phase.","type":"Datasheet"}],"keywords":["Carnifexes","Great Devourer","Monster"],"factionKeywords":["Tyranids"],"composition":["1-2 Carnifexes"],"points":[{"models":"1 model","cost":"90"},{"models":"2 models","cost":"180"}],"canLead":[],"ledBy":["000000462"]},{"id":"000000479","name":"Deathleaper","role":"Characters","loadout":"This model is equipped with: Lictor claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Deathleaper","m":"8\"","t":"6","sv":"3+","invSv":"4","w":"7","ld":"7+","oc":"1"}],"weapons":[{"name":"Lictor claws and talons","type":"Melee","profiles":[{"name":"Lictor claws and talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"7","ap":"-2","d":"2","desc":"precision"}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Feeder Tendrils","description":"Each time this model destroys an enemy CHARACTER model, you gain 1CP.","type":"Datasheet"},{"name":"Fear of the Unseen (Aura)","description":"While an enemy unit is within 6\" of this model, worsen the Leadership characteristic of models in that unit by 1. In addition, in the Battle-shock step of your opponent’s Command phase, if such an enemy unit is below its Starting Strength, it must take a Battle-shock test.","type":"Datasheet"},{"name":"HUNTER ORGANISM","description":"This model cannot be your WARLORD.","type":"Special (правая колонка)"}],"keywords":["Epic Hero","Character","Infantry","Deathleaper","Vanguard Invader","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Deathleaper – EPIC HERO"],"points":[{"models":"1 model","cost":"80"}],"canLead":[],"ledBy":[]},{"id":"000000500","name":"Dimachaeron","role":"Other","loadout":"This model is equipped with: massive scything sickle-talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Dimachaeron","m":"12\"","t":"10","sv":"3+","invSv":"5","w":"16","ld":"7+","oc":"5"}],"weapons":[{"name":"Massive scything sickle-talons","type":"Melee","profiles":[{"name":"Massive scything sickle-talons","range":"Melee","type":"Melee","a":"10","bsWs":"3","s":"9","ap":"-2","d":"3","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Digestion Spine","description":"Each time this model fights, after it has resolved its attacks, if one or more enemy models (excluding VEHICLE models) were destroyed as the result of those attacks, this model regains up to D3 wounds.","type":"Datasheet"}],"keywords":["Monster","Great Devourer","Dimachaeron"],"factionKeywords":["Tyranids"],"composition":["1 Dimachaeron"],"points":[{"models":"1 model","cost":"200"}],"canLead":[],"ledBy":[]},{"id":"000000495","name":"Exocrine","role":"Other","loadout":"This model is equipped with: bio-plasmic cannon; powerful limbs.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Exocrine","m":"8\"","t":"10","sv":"3+","invSv":"-","w":"14","ld":"8+","oc":"4"}],"weapons":[{"name":"Bio-plasmic cannon","type":"Ranged","profiles":[{"name":"Bio-plasmic cannon","range":"36","type":"Ranged","a":"D6+3","bsWs":"3","s":"9","ap":"-3","d":"3","desc":"blast, heavy"}]},{"name":"Powerful limbs","type":"Melee","profiles":[{"name":"Powerful limbs","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"7","ap":"0","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Symbiotic Targeting","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, each time a friendly TYRANIDS model makes an attack that targets that unit, re-roll a Hit roll of 1.","type":"Datasheet"}],"keywords":["Great Devourer","Monster","Exocrine"],"factionKeywords":["Tyranids"],"composition":["1 Exocrine"],"points":[{"models":"1 model","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000000484","name":"Gargoyles","role":"Battleline","loadout":"Every model is equipped with: fleshborer; blinding venom.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Gargoyles","m":"12\"","t":"3","sv":"6+","invSv":"-","w":"1","ld":"8+","oc":"2"}],"weapons":[{"name":"Fleshborer","type":"Ranged","profiles":[{"name":"Fleshborer","range":"18","type":"Ranged","a":"1","bsWs":"4","s":"5","ap":"0","d":"1","desc":"assault"}]},{"name":"Blinding venom","type":"Melee","profiles":[{"name":"Blinding venom","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Winged Swarm","description":"In your Shooting phase, after this unit has shot, if it is not within Engagement Range of any enemy units, it can make a Normal move of up to 6\". If it does, until the end of the turn, this unit is not eligible to declare a charge.","type":"Datasheet"}],"keywords":["Battleline","Fly","Great Devourer","Endless Multitude","Vanguard Invader","Gargoyles","Infantry"],"factionKeywords":["Tyranids"],"composition":["10-20 Gargoyles"],"points":[{"models":"10 models","cost":"85"},{"models":"20 models","cost":"170"}],"canLead":[],"ledBy":["000002694"]},{"id":"000000467","name":"Genestealers","role":"Other","loadout":"Every model is equipped with: Genestealer claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Genestealers","m":"8\"","t":"4","sv":"5+","invSv":"5","w":"2","ld":"7+","oc":"1"}],"weapons":[{"name":"Genestealer claws and talons","type":"Melee","profiles":[{"name":"Genestealer claws and talons","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"4","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Scouts","description":"SCOUTSScouts form the vanguard of many armies. Unnoticed by the enemy, they range ahead of the main force.Some units have ‘Scouts x\"’ listed in their abilities. If every model in a unit has this ability, then at the start of the first battle round, before the first turn begins, it can make a Normal move of up to x\", with the exception that, while making that move, the distance moved by each model in that unit can be greater than that model's Move characteristic, as long as it is not greater than x\". DEDICATED TRANSPORT models can make use of any Scouts x\" ability listed in their abilities, or a Scouts x\" ability that a unit that starts the battle embarked within that DEDICATED TRANSPORT model has (provided only models with this ability are embarked within that DEDICATED TRANSPORT model), regardless of how that embarked unit gained this ability (e.g. listed in their abilities, conferred by an Enhancement or by an attached CHARACTER, etc.). A unit that moves using this ability must end that move more than 9\" horizontally away from all enemy models. If both players have units that can do this, the player who is taking the first turn moves their units first. Example: A unit has the Scouts 6\" ability. At the start of the first battle round, the controlling player can make a Normal move with that unit of up to 6\". Scouts x\": Unit can make a Normal move of up to x\" before the first turn begins.If embarked in a DEDICATED TRANSPORT, that DEDICATED TRANSPORT can make this move instead.Must end this move more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Vanguard Predator","description":"Each time a model in this unit makes an attack, re-roll a Hit roll of 1. If the target is within range of one or more objective markers, re-roll a Wound roll of 1 as well.","type":"Datasheet"}],"keywords":["Genestealers","Vanguard Invader","Infantry","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["5-10 Genestealers"],"points":[{"models":"5 models","cost":"75"},{"models":"10 models","cost":"140"}],"canLead":[],"ledBy":["000000463"]},{"id":"000000485","name":"Harpy","role":"Other","loadout":"This model is equipped with: stinger salvoes; twin stranglethorn cannon; scything wings.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Harpy","m":"20+\"","t":"9","sv":"3+","invSv":"-","w":"12","ld":"8+","oc":"0"}],"weapons":[{"name":"Stinger salvoes","type":"Ranged","profiles":[{"name":"Stinger salvoes","range":"24","type":"Ranged","a":"8","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Twin heavy venom cannon","type":"Ranged","profiles":[{"name":"Twin heavy venom cannon","range":"36","type":"Ranged","a":"D3","bsWs":"3","s":"9","ap":"-2","d":"3","desc":"blast, twin-linked"}]},{"name":"Twin stranglethorn cannon","type":"Ranged","profiles":[{"name":"Twin stranglethorn cannon","range":"36","type":"Ranged","a":"D6+1","bsWs":"2","s":"7","ap":"-1","d":"2","desc":"blast, twin-linked"}]},{"name":"Scything wings","type":"Melee","profiles":[{"name":"Scything wings","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Spore Mine Cysts","description":"Each time this model ends a Normal move, you can select one of the following: Select one enemy unit it moved over during that move and roll six D6: for each 3+, that unit suffers 1 mortal wound.Add one new Spore Mines unit containing D3 models to your army and set it up anywhere on the battlefield that is wholly within 6\" of this model and more than 9\" horizontally away from all enemy units. You cannot select this option for more than one model per turn.","type":"Datasheet"}],"keywords":["Great Devourer","Vanguard Invader","Harpy","Monster","Fly","Aircraft"],"factionKeywords":["Tyranids"],"composition":["1 Harpy"],"points":[{"models":"1 model","cost":"215"}],"canLead":[],"ledBy":[]},{"id":"000000504","name":"Harridan","role":"Other","loadout":"This model is equipped with: 2 dire bio-cannons; gargantuan scything talons.","transport":"This model has a transport capacity of 20 Gargoyles models and 1 Winged Tyranid Prime model.","damagedW":"1-10","damagedDescription":"While this model has 1-10 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":true,"isLegends":false,"models":[{"name":"Harridan","m":"20+\"","t":"10","sv":"3+","invSv":"-","w":"30","ld":"8+","oc":"0"}],"weapons":[{"name":"Dire bio-cannon","type":"Ranged","profiles":[{"name":"Dire bio-cannon","range":"48","type":"Ranged","a":"D6+6","bsWs":"3","s":"10","ap":"-3","d":"3","desc":"blast"}]},{"name":"Gargantuan scything talons","type":"Melee","profiles":[{"name":"Gargantuan scything talons","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"14","ap":"-2","d":"D6","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Frenzied Metabolism","description":"Each time this model is selected to shoot, you can use this ability. If you do, until the end of the phase, each time this model makes an attack, add 1 to the Wound roll. After resolving those attacks, roll one D6: on a 2+, this model suffers D3 mortal wounds.","type":"Datasheet"}],"keywords":["Monster","Harridan","Great Devourer","Transport","Aircraft","Fly","Titanic"],"factionKeywords":["Tyranids"],"composition":["1 Harridan"],"points":[{"models":"1 model","cost":"610"}],"canLead":[],"ledBy":[]},{"id":"000000478","name":"Haruspex","role":"Other","loadout":"This model is equipped with: grasping tongue; ravenous maw; shovelling claws.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Haruspex","m":"8\"","t":"11","sv":"3+","invSv":"-","w":"14","ld":"8+","oc":"4"}],"weapons":[{"name":"Grasping tongue","type":"Ranged","profiles":[{"name":"Grasping tongue","range":"12","type":"Ranged","a":"1","bsWs":"3","s":"6","ap":"-2","d":"D6+1","desc":"precision"}]},{"name":"Ravenous maw","type":"Melee","profiles":[{"name":"Ravenous maw","range":"Melee","type":"Melee","a":"14","bsWs":"3","s":"7","ap":"-1","d":"2","desc":null}]},{"name":"Shovelling claws","type":"Melee","profiles":[{"name":"Shovelling claws","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"14","ap":"-2","d":"D6+1","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Grisly Spectacle","description":"Each time this model is selected to fight, after resolving its attacks, if one or more enemy units were destroyed by those attacks, each enemy unit within 6\" of this model must take a Battle-shock test.","type":"Datasheet"}],"keywords":["Harvester","Haruspex","Monster","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Haruspex"],"points":[{"models":"1 model","cost":"125"}],"canLead":[],"ledBy":[]},{"id":"000000505","name":"Hierophant","role":"Other","loadout":"This model is equipped with: bio-plasma torrent; 2 dire bio-cannons; lashwhip pods; titanic scything talons.","transport":"This model has a transport capacity of 20 Tyranids Infantry models. Each model with a Wounds characteristic of more than 1 takes up the space of 3 models. This model cannot transport models that can Fly.","damagedW":"1-10","damagedDescription":"While this model has 1-10 wounds remaining, subtract 6 from this model’s Objective Control characteristic and each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":true,"isLegends":false,"models":[{"name":"Hierophant","m":"12\"","t":"14","sv":"2+","invSv":"5","w":"30","ld":"8+","oc":"12"}],"weapons":[{"name":"Bio-plasma torrent","type":"Ranged","profiles":[{"name":"Bio-plasma torrent","range":"12","type":"Ranged","a":"3D6","bsWs":"N/A","s":"7","ap":"-2","d":"1","desc":"assault, torrent"}]},{"name":"Dire bio-cannon","type":"Ranged","profiles":[{"name":"Dire bio-cannon","range":"48","type":"Ranged","a":"D6+6","bsWs":"3","s":"10","ap":"-3","d":"3","desc":"blast"}]},{"name":"Lashwhip pods","type":"Melee","profiles":[{"name":"Lashwhip pods","range":"Melee","type":"Melee","a":"10","bsWs":"3","s":"5","ap":"-1","d":"1","desc":"extra attacks"}]},{"name":"Titanic scything talons","type":"Melee","profiles":[{"name":"Titanic scything talons","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"20","ap":"-2","d":"D6+1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Apex-beast","description":"Each time this model makes an attack that targets a unit that is Battle-shocked, add 1 to the Hit roll.","type":"Datasheet"},{"name":"Stalking Forward","description":"Each time this model makes a Normal, Advance or Fall Back move, it can move over models (excluding TITANIC models) and terrain features that are 4\" or less in height as if they were not there.","type":"Datasheet"}],"keywords":["Hierophant","Great Devourer","Titanic","Monster","Towering","Transport"],"factionKeywords":["Tyranids"],"composition":["1 Hierophant"],"points":[{"models":"1 model","cost":"810"}],"canLead":[],"ledBy":[]},{"id":"000000486","name":"Hive Crone","role":"Other","loadout":"This model is equipped with: drool cannon; stinger salvoes; tentaclids; scything wings; thorax spur.","transport":null,"damagedW":"1-4","damagedDescription":"While this model has 1-4 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hive Crone","m":"20+\"","t":"9","sv":"3+","invSv":"-","w":"12","ld":"8+","oc":"0"}],"weapons":[{"name":"Drool cannon","type":"Ranged","profiles":[{"name":"Drool cannon","range":"12","type":"Ranged","a":"2D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"torrent"}]},{"name":"Stinger salvoes","type":"Ranged","profiles":[{"name":"Stinger salvoes","range":"24","type":"Ranged","a":"8","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Tentaclids","type":"Ranged","profiles":[{"name":"Tentaclids","range":"36","type":"Ranged","a":"4","bsWs":"3","s":"7","ap":"0","d":"2","desc":"anti-vehicle 4+, devastating wounds"}]},{"name":"Scything wings","type":"Melee","profiles":[{"name":"Scything wings","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"7","ap":"-1","d":"2","desc":null}]},{"name":"Thorax spur","type":"Melee","profiles":[{"name":"Thorax spur","range":"Melee","type":"Melee","a":"1","bsWs":"3","s":"10","ap":"-3","d":"D6","desc":"anti-fly 2+, extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Hover","description":"HOVERSome aircraft can use vectored thrusters or anti-grav technology to hover over the battlefield, the better to hunt their prey or deploy embarked troops.Some AIRCRAFT models have ‘Hover’ listed in their abilities. When you are instructed to Declare Battle Formations, before doing anything else, you must first declare which models from your army with this ability will be in Hover mode. If a model is in Hover mode, then until the end of the battle, its Move characteristic is changed to 20\", it loses the AIRCRAFT keyword and it loses all associated rules for being an AIRCRAFT model. Models in Hover mode do not start the battle in Reserves, but you can choose to place them into Strategic Reserves following the normal rules if you wish.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Airborne Predator","description":"Each time this model makes a ranged attack that targets a unit that can FLY, add 1 to the Hit roll.","type":"Datasheet"}],"keywords":["Vanguard Invader","Great Devourer","Hive Crone","Fly","Monster","Aircraft"],"factionKeywords":["Tyranids"],"composition":["1 Hive Crone"],"points":[{"models":"1 model","cost":"200"}],"canLead":[],"ledBy":[]},{"id":"000000472","name":"Hive Guard","role":"Other","loadout":"Every model is equipped with: shockcannon; chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hive Guard","m":"6\"","t":"7","sv":"3+","invSv":"-","w":"4","ld":"8+","oc":"1"}],"weapons":[{"name":"Impaler cannon","type":"Ranged","profiles":[{"name":"Impaler cannon","range":"36","type":"Ranged","a":"4","bsWs":"4","s":"5","ap":"-1","d":"1","desc":"heavy, indirect fire"}]},{"name":"Shockcannon","type":"Ranged","profiles":[{"name":"Shockcannon","range":"24","type":"Ranged","a":"2","bsWs":"3","s":"7","ap":"-1","d":"3","desc":"anti-vehicle 2+"}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Defensive Stance","description":"Each time you target this unit with the Fire Overwatch Stratagem, while resolving that Stratagem, hits are scored on unmodified Hit rolls of 5+, or unmodified Hit rolls of 4+ instead if this unit is within range of an objective marker.","type":"Datasheet"}],"keywords":["Great Devourer","Hive Guard","Infantry"],"factionKeywords":["Tyranids"],"composition":["3-6 Hive Guard"],"points":[{"models":"3 models","cost":"90"},{"models":"6 models","cost":"180"}],"canLead":[],"ledBy":[]},{"id":"000000460","name":"Hive Tyrant","role":"Characters","loadout":"This model is equipped with: monstrous bonesword and lash whip; monstrous scything talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hive Tyrant","m":"8\"","t":"10","sv":"2+","invSv":"4","w":"10","ld":"7+","oc":"3"}],"weapons":[{"name":"Heavy venom cannon","type":"Ranged","profiles":[{"name":"Heavy venom cannon","range":"36","type":"Ranged","a":"D3","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"blast"}]},{"name":"Stranglethorn cannon","type":"Ranged","profiles":[{"name":"Stranglethorn cannon","range":"36","type":"Ranged","a":"D6+1","bsWs":"2","s":"7","ap":"-1","d":"2","desc":"blast"}]},{"name":"Monstrous bonesword and lash whip","type":"Melee","profiles":[{"name":"Monstrous bonesword and lash whip","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"twin-linked"}]},{"name":"Monstrous scything talons","type":"Melee","profiles":[{"name":"Monstrous scything talons","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"7","ap":"-2","d":"2","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Will of the Hive Mind","description":"Once per battle round, one model from your army with this ability can use it when a friendly TYRANIDS unit within 12\" of that model is targeted with a Stratagem. If it does, reduce the CP cost of that usage of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Onslaught (Aura, Psychic)","description":"While a friendly TYRANIDS unit is within 6\" of this model, ranged weapons equipped by models in that unit have the [ASSAULT] and [LETHAL HITS] abilities.","type":"Datasheet"}],"keywords":["Monster","Psyker","Great Devourer","Synapse","Hive Tyrant","Character"],"factionKeywords":["Tyranids"],"composition":["1 Hive Tyrant"],"points":[{"models":"1 model","cost":"195"}],"canLead":["000000471"],"ledBy":[]},{"id":"000000469","name":"Hormagaunts","role":"Battleline","loadout":"Every model is equipped with: Hormagaunt talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Hormagaunts","m":"10\"","t":"3","sv":"5+","invSv":"-","w":"1","ld":"8+","oc":"2"}],"weapons":[{"name":"Hormagaunt talons","type":"Melee","profiles":[{"name":"Hormagaunt talons","range":"Melee","type":"Melee","a":"3","bsWs":"4","s":"3","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Bounding Leap","description":"This unit is eligible to declare a charge in a turn in which it Advanced.","type":"Datasheet"}],"keywords":["Infantry","Battleline","Hormagaunts","Endless Multitude","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["10-20 Hormagaunts"],"points":[{"models":"10 models","cost":"65"},{"models":"20 models","cost":"130"}],"canLead":[],"ledBy":[]},{"id":"000004117","name":"Hyperadapted Raveners","role":"Characters","loadout":"The Ravener Prime is equipped with: Prime claws and talons. 3 Raveners are equipped with: Ravener heavy claws and talons. 1 Ravener is equipped with: venom bolt; Ravener heavy claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Ravener Prime","m":"10\"","t":"5","sv":"4+","invSv":"-","w":"6","ld":"7+","oc":"1"},{"name":"Raveners","m":"10\"","t":"5","sv":"4+","invSv":"-","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Venom bolt","type":"Ranged","profiles":[{"name":"Venom bolt","range":"12","type":"Ranged","a":"D6+3","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"assault, ignores cover, torrent"}]},{"name":"Prime claws and talons","type":"Melee","profiles":[{"name":"Prime claws and talons","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"anti-monster 5+, anti-vehicle 5+, twin-linked"}]},{"name":"Ravener heavy claws and talons","type":"Melee","profiles":[{"name":"Ravener heavy claws and talons","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"anti-monster 5+, anti-vehicle 5+, twin-linked"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Alpha Invader","description":"Weapons equipped by models in this unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Hypersensory Array","description":"Once per battle round, you can target this unit with the Rapid Ingress or Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this turn.","type":"Datasheet"}],"keywords":["Vanguard Invader","Synapse","Hyperadapted Raveners","Character","Burrowers","Great Devourer","Infantry"],"factionKeywords":["Tyranids"],"composition":["1 Ravener Prime","4 Raveners"],"points":[{"models":"5 models","cost":"165"}],"canLead":["000000482"],"ledBy":[]},{"id":"000000473","name":"Lictor","role":"Other","loadout":"This model is equipped with: Lictor claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Lictor","m":"8\"","t":"6","sv":"4+","invSv":"-","w":"6","ld":"7+","oc":"1"}],"weapons":[{"name":"Lictor claws and talons","type":"Melee","profiles":[{"name":"Lictor claws and talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"7","ap":"-2","d":"2","desc":"precision"}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Feeder Tendrils","description":"Each time this model destroys an enemy CHARACTER model, you gain 1CP.","type":"Datasheet"},{"name":"Pheromone Trail","description":"Once per battle round, you can target one model with this ability with the Rapid Ingress Stratagem for 0CP.","type":"Datasheet"}],"keywords":["Lictor","Great Devourer","Vanguard Invader","Infantry"],"factionKeywords":["Tyranids"],"composition":["1 Lictor"],"points":[{"models":"1 model","cost":"60"}],"canLead":[],"ledBy":[]},{"id":"000000499","name":"Malanthrope","role":"Characters","loadout":"This model is equipped with: grasping tail.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Malanthrope","m":"6\"","t":"5","sv":"4+","invSv":"-","w":"10","ld":"7+","oc":"3"}],"weapons":[{"name":"Grasping tail","type":"Melee","profiles":[{"name":"Grasping tail","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"5","ap":"0","d":"2","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Enhanced Toxic Miasma","description":"While this model is leading a unit, the range of that unit’s Foul Spores Aura ability is increased to 9\".","type":"Datasheet"},{"name":"Prey Adaptation","description":"Each time this model's unit is selected to fight, select one of the following abilities to apply to all melee weapons equipped by models in that unit until the end of the phase: [SUSTAINED HITS 1] [LANCE] [LETHAL HITS]","type":"Datasheet"}],"keywords":["Malanthrope","Great Devourer","Fly","Character","Infantry","Synapse"],"factionKeywords":["Tyranids"],"composition":["1 Malanthrope"],"points":[{"models":"1 model","cost":"75"}],"canLead":["000000476"],"ledBy":[]},{"id":"000000474","name":"Maleceptor","role":"Other","loadout":"This model is equipped with: psychic overload; massive scything talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Maleceptor","m":"8\"","t":"11","sv":"3+","invSv":"4","w":"14","ld":"7+","oc":"4"}],"weapons":[{"name":"Psychic overload","type":"Ranged","profiles":[{"name":"Psychic overload","range":"18","type":"Ranged","a":"D6+3","bsWs":"3","s":"10","ap":"-2","d":"3","desc":"blast, psychic"}]},{"name":"Massive scything talons – strike","type":"Melee","profiles":[{"name":"Massive scything talons – strike","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"9","ap":"-2","d":"D6+1","desc":null}]},{"name":"Massive scything talons – sweep","type":"Melee","profiles":[{"name":"Massive scything talons – sweep","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Encephalic Diffusion (Aura, Psychic)","description":"While an enemy unit is within 6\" of this model, each time a model in that unit makes an attack, subtract 1 from the Hit roll, and, if that enemy unit is Below Half-strength, subtract 1 from the Wound roll as well.","type":"Datasheet"}],"keywords":["Monster","Psyker","Great Devourer","Synapse","Maleceptor"],"factionKeywords":["Tyranids"],"composition":["1 Maleceptor"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000000494","name":"Mawloc","role":"Other","loadout":"This model is equipped with: distensible jaw; Mawloc scything talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Mawloc","m":"10\"","t":"10","sv":"3+","invSv":"-","w":"14","ld":"8+","oc":"4"}],"weapons":[{"name":"Distensible jaw","type":"Melee","profiles":[{"name":"Distensible jaw","range":"Melee","type":"Melee","a":"1","bsWs":"3","s":"5","ap":"0","d":"3","desc":"anti-infantry 4+, devastating wounds, extra attacks"}]},{"name":"Mawloc scything talons","type":"Melee","profiles":[{"name":"Mawloc scything talons","range":"Melee","type":"Melee","a":"16","bsWs":"3","s":"8","ap":"-2","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Terror From The Deep","description":"Each time this model is set up on the battlefield using the Deep Strike ability, roll one D6 for each enemy unit within 12\" of this model: on a 2-4, that unit suffers D3 mortal wounds; on a 5+, that unit suffers 3 mortal wounds and must take a Battle-shock test.","type":"Datasheet"}],"keywords":["Mawloc","Burrower","Great Devourer","Monster","Vanguard Invader"],"factionKeywords":["Tyranids"],"composition":["1 Mawloc"],"points":[{"models":"1 model","cost":"135"}],"canLead":[],"ledBy":[]},{"id":"000000487","name":"Mucolid Spores","role":"Other","loadout":"Every model is equipped with: nothing.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Mucolid Spores","m":"4\"","t":"4","sv":"7+","invSv":"-","w":"3","ld":"8+","oc":"0"}],"weapons":[{"name":"","type":"","profiles":[{"name":"","range":"","type":"","a":"0","bsWs":"-","s":"-","ap":"0","d":"-","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Bio-minefield","description":"Enemy units cannot start or end an Advance move within 6\" of this unit.","type":"Datasheet"},{"name":"Floating Death","description":"Each time this unit or an enemy unit ends a move, for each model in this unit that is within 3\" of one or more enemy units, select one of those enemy units. That model in this unit is destroyed, then roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6, that enemy unit suffers D6 mortal wounds.","type":"Datasheet"}],"keywords":["Great Devourer","Fly","Mucolid Spores","Beast"],"factionKeywords":["Tyranids"],"composition":["1-2 Mucolid Spores"],"points":[{"models":"1 model","cost":"30"},{"models":"2 models","cost":"60"}],"canLead":[],"ledBy":[]},{"id":"000002687","name":"Neurogaunts","role":"Other","loadout":"Every model is equipped with: chitinous claws and teeth. *This unit can only contain 2 Neurogaunt Nodebeasts if it contains 20 Neurogaunts.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Neurogaunts","m":"6\"","t":"3","sv":"6+","invSv":"-","w":"1","ld":"8+","oc":"1"}],"weapons":[{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Neurocytes","description":"While this unit is within Synapse Range of a friendly TYRANIDS unit (excluding NEUROGAUNT units), it has the Synapse keyword.","type":"Datasheet"}],"keywords":["Endless Multitude","Infantry","Great Devourer","Neurogaunts"],"factionKeywords":["Tyranids"],"composition":["1-2 Neurogaunt Nodebeasts*","10-20 Neurogaunts"],"points":[{"models":"11 models","cost":"45"},{"models":"22 models","cost":"90"}],"canLead":[],"ledBy":["000002688"]},{"id":"000002753","name":"Neurolictor","role":"Other","loadout":"This model is equipped with: piercing claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Neurolictor","m":"8\"","t":"5","sv":"4+","invSv":"4","w":"7","ld":"7+","oc":"1"}],"weapons":[{"name":"Piercing claws and talons","type":"Melee","profiles":[{"name":"Piercing claws and talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"6","ap":"-2","d":"1","desc":"precision"}]}],"abilities":[{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Feeder Tendrils","description":"Each time this model destroys an enemy CHARACTER model, you gain 1CP.","type":"Datasheet"},{"name":"Neural Disruption","description":"In your Command phase, select one enemy unit within 12\" of this model. That unit must take a Battle-shock test.","type":"Datasheet"},{"name":"Psychological Saboteur (Aura)","description":"While an enemy unit is within 12\" of this model, if that unit is Battle-shocked: Each time a model in that unit makes an attack, subtract 1 from the Hit roll.Each time a friendly TYRANIDS model makes an attack that targets that unit, add 1 to the Wound roll.","type":"Datasheet"}],"keywords":["Infantry","Great Devourer","Vanguard Invader","Synapse","Neurolictor"],"factionKeywords":["Tyranids"],"composition":["1 Neurolictor"],"points":[{"models":"1 model","cost":"70"}],"canLead":[],"ledBy":[]},{"id":"000002688","name":"Neurotyrant","role":"Characters","loadout":"This model is equipped with: Psychic Scream; Neurotyrant claws and lashes.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Neurotyrant","m":"6\"","t":"8","sv":"4+","invSv":"4","w":"9","ld":"7+","oc":"3"}],"weapons":[{"name":"Psychic scream","type":"Ranged","profiles":[{"name":"Psychic scream","range":"18","type":"Ranged","a":"2D6","bsWs":"N/A","s":"5","ap":"-1","d":"2","desc":"ignores cover, psychic, torrent"}]},{"name":"Neurotyrant claws and lashes","type":"Melee","profiles":[{"name":"Neurotyrant claws and lashes","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Node Lash (Psychic)","description":"While this model is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll. If the target is Battle-shocked, add 1 to the Wound roll as well.","type":"Datasheet"},{"name":"Psychic Terror (Psychic)","description":"If one or more models from your army with this ability are on the battlefield when you unleash the Shadow in the Warp, subtract 1 from the Battle-shock test each enemy unit on the battlefield must take as a result.","type":"Datasheet"},{"name":"Neuroloids","description":"In your Command phase, you can select up to two friendly TYRANIDS units within 18\" of this model’s unit. Until the start of your next Command phase, the selected units are always considered to be within Synapse Range of your army. Designer’s Note: Place a Neuroloid token next to each selected unit to remind you.","type":"Datasheet"}],"keywords":["Great Devourer","Synapse","Neurotyrant","Psyker","Monster","Character","Fly"],"factionKeywords":["Tyranids"],"composition":["1 Neurotyrant"],"points":[{"models":"1 model","cost":"105"}],"canLead":["000000471","000000475","000002687"],"ledBy":[]},{"id":"000002752","name":"Norn Assimilator","role":"Other","loadout":"This model is equipped with: toxinjector harpoon; monstrous scything talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Norn Assimilator","m":"10\"","t":"11","sv":"2+","invSv":"-","w":"16","ld":"7+","oc":"5"}],"weapons":[{"name":"Toxinjector Harpoon","type":"Ranged","profiles":[{"name":"Toxinjector Harpoon","range":"12","type":"Ranged","a":"2","bsWs":"2","s":"12","ap":"-3","d":"D6+1","desc":"harpooned"}]},{"name":"Monstrous scything talons","type":"Melee","profiles":[{"name":"Monstrous scything talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"9","ap":"-2","d":"3","desc":null}]},{"name":"Toxinjector harpoon","type":"Melee","profiles":[{"name":"Toxinjector harpoon","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"12","ap":"-3","d":"D6+1","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Singular Purpose","description":"At the start of the first battle round, select one of the following: Select one enemy unit. Until the end of the battle, each time this model makes an attack that targets that unit, you can re-roll the Hit roll and you can re-roll the Wound roll.Select one objective marker. Until the end of the battle, while this model is within range of that objective marker, it has the Feel No Pain 5+ ability and an Objective Control characteristic of 15.","type":"Datasheet"},{"name":"Harpoon Barbs","description":"Once per turn, when an enemy unit within Engagement Range of this model is selected to Fall Back, roll one D6: on a 2+, that unit suffers D6 mortal wounds.","type":"Datasheet"},{"name":"Harpooned","description":"After the bearer has shot with this weapon, select one enemy MONSTER or VEHICLE unit hit by one or more of those attacks. Until the end of the turn, each time the bearer selects that unit as a target of a charge, add 2 to the Charge roll.","type":"Wargear profile"}],"keywords":["Monster","Great Devourer","Synapse","Harvester","Norn Assimilator"],"factionKeywords":["Tyranids"],"composition":["1 Norn Assimilator"],"points":[{"models":"1 model","cost":"275"}],"canLead":[],"ledBy":[]},{"id":"000002751","name":"Norn Emissary","role":"Other","loadout":"This model is equipped with: Psychic Tendril; monstrous scything talons; monstrous rending claws.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Norn Emissary","m":"10\"","t":"11","sv":"2+","invSv":"4","w":"16","ld":"7+","oc":"5"}],"weapons":[{"name":"Psychic Tendril – neuroparasite","type":"Ranged","profiles":[{"name":"Psychic Tendril – neuroparasite","range":"18","type":"Ranged","a":"2","bsWs":"2","s":"8","ap":"-2","d":"D3","desc":"precision, psychic"}]},{"name":"Psychic Tendril – neuroblast","type":"Ranged","profiles":[{"name":"Psychic Tendril – neuroblast","range":"18","type":"Ranged","a":"2D6","bsWs":"2","s":"6","ap":"-2","d":"1","desc":"blast, psychic"}]},{"name":"Psychic Tendril – neurolance","type":"Ranged","profiles":[{"name":"Psychic Tendril – neurolance","range":"18","type":"Ranged","a":"2","bsWs":"2","s":"12","ap":"-3","d":"D6","desc":"melta 2, psychic"}]},{"name":"Monstrous scything talons","type":"Melee","profiles":[{"name":"Monstrous scything talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"9","ap":"-2","d":"3","desc":null}]},{"name":"Monstrous rending claws","type":"Melee","profiles":[{"name":"Monstrous rending claws","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"7","ap":"-2","d":"2","desc":"extra attacks"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Singular Purpose","description":"At the start of the first battle round, select one of the following: Select one enemy unit. Until the end of the battle, each time this model makes an attack that targets that unit, you can re-roll the Hit roll and you can re-roll the Wound roll.Select one objective marker. Until the end of the battle, while this model is within range of that objective marker, it has the Feel No Pain 5+ ability and an Objective Control characteristic of 15.","type":"Datasheet"},{"name":"Unnatural Resilience","description":"This model has the Feel No Pain 4+ ability against mortal wounds.","type":"Datasheet"}],"keywords":["Monster","Synapse","Norn Emissary","Great Devourer","Psyker"],"factionKeywords":["Tyranids"],"composition":["1 Norn Emissary"],"points":[{"models":"1 model","cost":"260"}],"canLead":[],"ledBy":[]},{"id":"000000462","name":"Old One Eye","role":"Characters","loadout":"This model is equipped with: Old One Eye’s claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Old One Eye","m":"8\"","t":"9","sv":"2+","invSv":"-","w":"9","ld":"8+","oc":"3"}],"weapons":[{"name":"Old One Eye’s claws and talons – strike","type":"Melee","profiles":[{"name":"Old One Eye’s claws and talons – strike","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"14","ap":"-3","d":"D6+1","desc":null}]},{"name":"Old One Eye’s claws and talons – sweep","type":"Melee","profiles":[{"name":"Old One Eye’s claws and talons – sweep","range":"Melee","type":"Melee","a":"12","bsWs":"3","s":"6","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Alpha Leader","description":"While this model is leading a unit, each time a model in that unit makes an attack, you can re-roll the Hit roll.","type":"Datasheet"},{"name":"Unstoppable Monster","description":"At the start of each player’s Command phase, this model regains up to D3 lost wounds.","type":"Datasheet"}],"keywords":["Monster","Character","Epic Hero","Great Devourer","Old One Eye"],"factionKeywords":["Tyranids"],"composition":["1 Old One Eye – EPIC HERO"],"points":[{"models":"1 model","cost":"150"}],"canLead":["000000490"],"ledBy":[]},{"id":"000002529","name":"Parasite Of Mortrex","role":"Characters","loadout":"This model is equipped with: barbed ovipositor; clawed limbs.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Parasite Of Mortrex","m":"12\"","t":"5","sv":"4+","invSv":"-","w":"5","ld":"8+","oc":"1"}],"weapons":[{"name":"Barbed ovipositor","type":"Melee","profiles":[{"name":"Barbed ovipositor","range":"Melee","type":"Melee","a":"1","bsWs":"2","s":"3","ap":"-2","d":"3","desc":"anti-infantry 3+, extra attacks"}]},{"name":"Clawed limbs","type":"Melee","profiles":[{"name":"Clawed limbs","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"5","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Lone Operative","description":"LONE OPERATIVEAssassins and other covert agents are difficult to track and pinpoint in the swirling maelstrom of battle.Unless part of an Attached unit (see Leader), this unit can only be selected as the target of a ranged attack if the attacking model is within 12\".","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Parasitic Infection","description":"Each time an INFANTRY model is destroyed by an attack made with this model’s barbed ovipositor, after this model has finished making its attacks, you can add one new Ripper Swarms unit to your army consisting of D3 models and set it up within 3\" of this model. If you do, that RIPPER SWARMS unit can be set up within Engagement Range of the destroyed model’s unit (but not within Engagement Range of any other enemy units).","type":"Datasheet"},{"name":"It Itches!","description":"At the start of the Fight phase, select one enemy unit within Engagement Range of this model. That enemy unit must take a Battle-shock test.","type":"Datasheet"}],"keywords":["Great Devourer","Synapse","Vanguard Invader","Parasite of Mortrex","Infantry","Character","Fly"],"factionKeywords":["Tyranids"],"composition":["1 Parasite of Mortrex"],"points":[{"models":"1 model","cost":"80"}],"canLead":[],"ledBy":[]},{"id":"000002689","name":"Psychophage","role":"Other","loadout":"This model is equipped with: psychoclastic torrent; talons and betentacled maw.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Psychophage","m":"12\"","t":"9","sv":"3+","invSv":"-","w":"10","ld":"8+","oc":"3"}],"weapons":[{"name":"Psychoclastic torrent","type":"Ranged","profiles":[{"name":"Psychoclastic torrent","range":"12","type":"Ranged","a":"D6","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent"}]},{"name":"Talons and betentacled maw","type":"Melee","profiles":[{"name":"Talons and betentacled maw","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"6","ap":"-2","d":"2","desc":"anti-psyker 4+, devastating wounds"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Feel No Pain","description":"FEEL NO PAINSome warriors refuse to be laid low, even by what should be fatal wounds.Some models have ‘Feel No Pain x+’ listed in their abilities. Each time a model with this ability suffers damage and so would lose a wound (including wounds lost due to mortal wounds), roll one D6: if the result is greater than or equal to the number denoted by ‘x’, that wound is ignored and is not lost. If a model has more than one Feel No Pain ability, you can only use one of those abilities each time that model suffers damage and so would lose a wound. Feel No Pain x+: Each time this model would lose a wound, roll one D6: if the result equals or exceeds ‘x’, that wound is not lost.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Bio-stimulus","description":"In your Shooting phase, after this model has shot, select one enemy unit hit by one or more of those attacks. Until the end of the turn, each time a friendly TYRANIDS unit makes a melee attack that targets that enemy unit, improve the Armour Penetration characteristic of that attack by 1. The same enemy unit can only be affected by this ability once per turn.","type":"Datasheet"},{"name":"Feeding Frenzy","description":"Each time this model makes a melee attack that targets a unit that is below its Starting Strength, add 1 to the Hit roll. If that target is also Below Half-strength, add 1 to the Wound roll as well.","type":"Datasheet"}],"keywords":["Harvester","Smoke","Psychophage","Monster","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Psychophage"],"points":[{"models":"1 model","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000000477","name":"Pyrovores","role":"Other","loadout":"Every model is equipped with: flamespurt; chitin-barbed limbs.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Pyrovores","m":"5\"","t":"6","sv":"3+","invSv":"-","w":"5","ld":"8+","oc":"1"}],"weapons":[{"name":"Flamespurt","type":"Ranged","profiles":[{"name":"Flamespurt","range":"12","type":"Ranged","a":"D6+1","bsWs":"N/A","s":"6","ap":"-1","d":"1","desc":"ignores cover, torrent, twin-linked"}]},{"name":"Chitin-barbed limbs","type":"Melee","profiles":[{"name":"Chitin-barbed limbs","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"5","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Burning Spray","description":"In your Shooting phase, after this unit has shot, select one enemy unit hit by one or more of those attacks. Until the end of the phase, that enemy unit cannot have the Benefit of Cover.","type":"Datasheet"}],"keywords":["Infantry","Pyrovores","Harvester","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1-3 Pyrovores"],"points":[{"models":"1 model","cost":"40"},{"models":"2 models","cost":"70"},{"models":"3 models","cost":"105"}],"canLead":[],"ledBy":[]},{"id":"000000482","name":"Raveners","role":"Other","loadout":"Every model is equipped with: Ravener claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Raveners","m":"10\"","t":"5","sv":"4+","invSv":"-","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Ravener claws and talons","type":"Melee","profiles":[{"name":"Ravener claws and talons","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-2","d":"2","desc":"twin-linked"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Death From Below","description":"At the end of your opponent’s turn, if this unit is not within Engagement Range of one or more enemy units, you can remove it from the battlefield and place it into Strategic Reserves.","type":"Datasheet"}],"keywords":["Vanguard Invader","Burrowers","Raveners","Great Devourer","Infantry"],"factionKeywords":["Tyranids"],"composition":["5 Raveners"],"points":[{"models":"5 models","cost":"125"}],"canLead":[],"ledBy":["000004117"]},{"id":"000000470","name":"Ripper Swarms","role":"Other","loadout":"Every model is equipped with: chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Ripper Swarms","m":"6\"","t":"2","sv":"6+","invSv":"-","w":"4","ld":"8+","oc":"0"}],"weapons":[{"name":"Spinemaws","type":"Ranged","profiles":[{"name":"Spinemaws","range":"6","type":"Ranged","a":"4","bsWs":"5","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"6","bsWs":"5","s":"2","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Chitinous Horrors (Aura)","description":"While an enemy unit is within Engagement Range of this unit, halve the Objective Control characteristic of models in that enemy unit.","type":"Datasheet"}],"keywords":["Ripper Swarms","Harvester","Swarm","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1-3 Ripper Swarms"],"points":[{"models":"1 model","cost":"25"},{"models":"2 models","cost":"40"},{"models":"3 models","cost":"50"}],"canLead":[],"ledBy":[]},{"id":"000002690","name":"Screamer-killer","role":"Other","loadout":"This model is equipped with: bio-plasmic scream; Screamer-Killer talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Screamer-killer","m":"8\"","t":"9","sv":"2+","invSv":"-","w":"10","ld":"8+","oc":"3"}],"weapons":[{"name":"Bio-plasmic scream","type":"Ranged","profiles":[{"name":"Bio-plasmic scream","range":"18","type":"Ranged","a":"D6+3","bsWs":"4","s":"8","ap":"-2","d":"1","desc":"assault, blast"}]},{"name":"Screamer-killer talons","type":"Melee","profiles":[{"name":"Screamer-killer talons","range":"Melee","type":"Melee","a":"10","bsWs":"3","s":"10","ap":"-2","d":"3","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Death Scream","description":"In your Shooting phase, after this model has shot, select one unit hit by one or more of those attacks. That unit must take a Battle-shock test, subtracting 1 from that test.","type":"Datasheet"}],"keywords":["Screamer-Killer","Great Devourer","Monster"],"factionKeywords":["Tyranids"],"composition":["1 Screamer-Killer"],"points":[{"models":"1 model","cost":"125"}],"canLead":[],"ledBy":[]},{"id":"000000506","name":"Scythed Hierodule","role":"Other","loadout":"This model is equipped with: bio-acid spray; Hierodule scything talons.","transport":null,"damagedW":"1-6","damagedDescription":"While this model has 1-6 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Scythed Hierodule","m":"12\"","t":"12","sv":"2+","invSv":"-","w":"18","ld":"8+","oc":"5"}],"weapons":[{"name":"Bio-acid spray","type":"Ranged","profiles":[{"name":"Bio-acid spray","range":"18","type":"Ranged","a":"3D6","bsWs":"N/A","s":"6","ap":"-2","d":"1","desc":"torrent"}]},{"name":"Hierodule scything talons","type":"Melee","profiles":[{"name":"Hierodule scything talons","range":"Melee","type":"Melee","a":"10","bsWs":"3","s":"14","ap":"-2","d":"D3+3","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Irresistible Force","description":"This model is eligible to declare a charge in a turn in which it Fell Back.","type":"Datasheet"}],"keywords":["Scythed Hierodule","Monster","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Scythed Hierodule"],"points":[{"models":"1 model","cost":"330"}],"canLead":[],"ledBy":[]},{"id":"000000483","name":"Sky-slasher Swarms","role":"Other","loadout":"Every model is equipped with: claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":true,"models":[{"name":"Sky-slasher Swarms","m":"12\"","t":"2","sv":"6+","invSv":"-","w":"4","ld":"8+","oc":"0"}],"weapons":[{"name":"Spinemaws","type":"Ranged","profiles":[{"name":"Spinemaws","range":"6","type":"Ranged","a":"4","bsWs":"5","s":"3","ap":"0","d":"1","desc":"pistol"}]},{"name":"Claws and teeth","type":"Melee","profiles":[{"name":"Claws and teeth","range":"Melee","type":"Melee","a":"6","bsWs":"5","s":"2","ap":"0","d":"1","desc":"sustained hits 1"}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Chitinous Horrors","description":"While an enemy unit is within Engagement Range of one or more units with this ability, halve the Objective Control characteristic of models in that enemy unit.","type":"Datasheet"}],"keywords":["Swarm","Great Devourer","Fly","Sky-slasher Swarms"],"factionKeywords":["Tyranids"],"composition":["3 Sky-slasher Swarms"],"points":[{"models":"3 models","cost":"60"}],"canLead":[],"ledBy":[]},{"id":"000000488","name":"Spore Mines","role":"Other","loadout":"Every model is equipped with: nothing.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Spore Mines","m":"4\"","t":"1","sv":"7+","invSv":"-","w":"1","ld":"8+","oc":"0"}],"weapons":[{"name":"","type":"","profiles":[{"name":"","range":"","type":"","a":"0","bsWs":"-","s":"-","ap":"0","d":"-","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Bio-minefield","description":"Enemy units cannot start or end an Advance move within 6\" of this unit.","type":"Datasheet"},{"name":"Floating Death","description":"Each time this unit or an enemy unit ends a move, for each model in this unit that is within 3\" of one or more enemy units, select one of those enemy units. That model in this unit is destroyed, then roll one D6: on a 2-5, that enemy unit suffers 1 mortal wound; on a 6, that enemy unit suffers D3 mortal wounds.","type":"Datasheet"}],"keywords":["Great Devourer","Beast","Fly","Spore Mines"],"factionKeywords":["Tyranids"],"composition":["3-6 Spore Mines"],"points":[{"models":"3 models","cost":"55"},{"models":"6 models","cost":"110"}],"canLead":[],"ledBy":[]},{"id":"000000498","name":"Sporocyst","role":"Other","loadout":"This model is equipped with: Sporocyst bio-weapons; flensing whips.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Sporocyst","m":"-","t":"10","sv":"3+","invSv":"-","w":"10","ld":"8+","oc":"0"}],"weapons":[{"name":"Sporocyst bio-weapons","type":"Ranged","profiles":[{"name":"Sporocyst bio-weapons","range":"24","type":"Ranged","a":"10","bsWs":"4","s":"5","ap":"-1","d":"2","desc":null}]},{"name":"Flensing whips","type":"Melee","profiles":[{"name":"Flensing whips","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Seed Mucolids","description":"Once per turn, in your Shooting phase, when selected to shoot, one unit with this ability can use it instead of making any attacks with its ranged weapons. If it does, you can add one new Mucolid Spores unit containing 1 model to your army and set it up anywhere on the battlefield that is wholly within 18\" of this model and more than 9\" horizontally away from all enemy units.","type":"Datasheet"},{"name":"Hive Defences","description":"You can target this model with the Fire Overwatch Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this turn. This model can only be targeted with that Stratagem once per turn.","type":"Datasheet"}],"keywords":["Sporocyst","Monster","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Sporocyst"],"points":[{"models":"1 model","cost":"145"}],"canLead":[],"ledBy":[]},{"id":"000000468","name":"Termagants","role":"Battleline","loadout":"Every model is equipped with: fleshborer; chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Termagants","m":"6\"","t":"3","sv":"5+","invSv":"-","w":"1","ld":"8+","oc":"2"}],"weapons":[{"name":"Fleshborer","type":"Ranged","profiles":[{"name":"Fleshborer","range":"18","type":"Ranged","a":"1","bsWs":"4","s":"5","ap":"0","d":"1","desc":"assault"}]},{"name":"Shardlauncher","type":"Ranged","profiles":[{"name":"Shardlauncher","range":"18","type":"Ranged","a":"D3","bsWs":"4","s":"5","ap":"0","d":"1","desc":"blast, heavy"}]},{"name":"Spike rifle","type":"Ranged","profiles":[{"name":"Spike rifle","range":"24","type":"Ranged","a":"1","bsWs":"4","s":"4","ap":"-1","d":"1","desc":"heavy"}]},{"name":"Strangleweb","type":"Ranged","profiles":[{"name":"Strangleweb","range":"18","type":"Ranged","a":"D6","bsWs":"N/A","s":"2","ap":"0","d":"1","desc":"assault, devastating wounds, torrent"}]},{"name":"Termagant devourer","type":"Ranged","profiles":[{"name":"Termagant devourer","range":"18","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Termagant spinefists","type":"Ranged","profiles":[{"name":"Termagant spinefists","range":"12","type":"Ranged","a":"2","bsWs":"4","s":"3","ap":"0","d":"1","desc":"assault, pistol, twin-linked"}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"1","bsWs":"4","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Skulking Horrors","description":"Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of this unit, if this unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to D6\".","type":"Datasheet"}],"keywords":["Great Devourer","Battleline","Endless Multitude","Termagants","Infantry"],"factionKeywords":["Tyranids"],"composition":["10-20 Termagants"],"points":[{"models":"10 models","cost":"60"},{"models":"20 models","cost":"120"}],"canLead":[],"ledBy":[]},{"id":"000000465","name":"Tervigon","role":"Characters","loadout":"This model is equipped with: stinger salvoes; massive scything talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tervigon","m":"8\"","t":"11","sv":"2+","invSv":"-","w":"16","ld":"7+","oc":"5"}],"weapons":[{"name":"Stinger salvoes","type":"Ranged","profiles":[{"name":"Stinger salvoes","range":"24","type":"Ranged","a":"8","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Massive crushing claws","type":"Melee","profiles":[{"name":"Massive crushing claws","range":"Melee","type":"Melee","a":"4","bsWs":"4","s":"12","ap":"-3","d":"D6+1","desc":null}]},{"name":"Massive scything talons – strike","type":"Melee","profiles":[{"name":"Massive scything talons – strike","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"9","ap":"-2","d":"D6","desc":null}]},{"name":"Massive scything talons – sweep","type":"Melee","profiles":[{"name":"Massive scything talons – sweep","range":"Melee","type":"Melee","a":"8","bsWs":"3","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Spawn Termagants","description":"In your Command phase, you can select one friendly Termagants unit within 6\" of this model and return up to D3+3 destroyed models to that unit. A TERMAGANTS unit cannot be selected for this ability more than once per phase.","type":"Datasheet"},{"name":"Brood Progenitor (Aura, Psychic)","description":"While a friendly Termagants unit is within 6\" of this model, ranged weapons equipped by models in that unit have the [LETHAL HITS] ability.","type":"Datasheet"}],"keywords":["Monster","Synapse","Great Devourer","Tervigon","Character","Psyker"],"factionKeywords":["Tyranids"],"composition":["1 Tervigon"],"points":[{"models":"1 model","cost":"160"}],"canLead":[],"ledBy":[]},{"id":"000000461","name":"The Swarmlord","role":"Characters","loadout":"This model is equipped with: Synaptic pulse; bone sabres.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"The Swarmlord","m":"8\"","t":"10","sv":"2+","invSv":"4","w":"10","ld":"7+","oc":"3"}],"weapons":[{"name":"Synaptic pulse","type":"Ranged","profiles":[{"name":"Synaptic pulse","range":"18","type":"Ranged","a":"D6+3","bsWs":"N/A","s":"5","ap":"-1","d":"2","desc":"psychic, torrent"}]},{"name":"Bone sabres","type":"Melee","profiles":[{"name":"Bone sabres","range":"Melee","type":"Melee","a":"8","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"twin-linked"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Hive Commander","description":"At the start of your Command phase, if this model is on the battlefield, you gain 1CP.","type":"Datasheet"},{"name":"Malign Presence (Aura)","description":"If this model is your WARLORD, each time your opponent targets a unit from their army with a Stratagem, if that unit is within 12\" of this model, increase the cost of that use of that Stratagem by 1CP. Designer’s Note: This ability takes precedence over the Lord of Deceit ability presented in the Balance Dataslate June 2024.","type":"Datasheet"},{"name":"Domination of the Hive Mind (Aura)","description":"While a friendly TYRANIDS unit is within 9\" of this model, that unit is within your army’s Synapse Range.","type":"Datasheet"}],"keywords":["Synapse","Hive Tyrant","Monster","Character","The Swarmlord","Epic Hero","Psyker","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Swarmlord – EPIC HERO"],"points":[{"models":"1 model","cost":"220"}],"canLead":["000000471"],"ledBy":[]},{"id":"000000497","name":"Toxicrene","role":"Other","loadout":"This model is equipped with: massive toxic lashes.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Toxicrene","m":"8\"","t":"11","sv":"3+","invSv":"-","w":"14","ld":"8+","oc":"4"}],"weapons":[{"name":"Massive toxic lashes","type":"Ranged","profiles":[{"name":"Massive toxic lashes","range":"9","type":"Ranged","a":"2D6","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"anti-infantry 2+"}]},{"name":"Massive toxic lashes","type":"Melee","profiles":[{"name":"Massive toxic lashes","range":"Melee","type":"Melee","a":"12","bsWs":"3","s":"6","ap":"-1","d":"2","desc":"anti-infantry 2+"}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Grasping Tendrils","description":"Each time an enemy unit (excluding TITANIC units) within Engagement Range of one or more units from your army with this ability is selected to Fall Back, you can roll one D6: on a 3+, that enemy unit must Remain Stationary instead.","type":"Datasheet"},{"name":"Hypertoxic Miasma (Aura)","description":"At the end of your Movement phase, roll one D6 for each enemy unit within 6\" of this model: on a 2-3, that unit suffers 1 mortal wound; on a 4-5, that unit suffers D3 mortal wounds; on a 6, that unit suffers D6 mortal wounds.","type":"Datasheet"}],"keywords":["Monster","Great Devourer","Toxicrene"],"factionKeywords":["Tyranids"],"composition":["1 Toxicrene"],"points":[{"models":"1 model","cost":"150"}],"canLead":[],"ledBy":[]},{"id":"000000493","name":"Trygon","role":"Other","loadout":"This model is equipped with: bio-electric pulse; Trygon scything talons.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Trygon","m":"10\"","t":"10","sv":"3+","invSv":"-","w":"14","ld":"8+","oc":"4"}],"weapons":[{"name":"Bio-electric pulse","type":"Ranged","profiles":[{"name":"Bio-electric pulse","range":"12","type":"Ranged","a":"6","bsWs":"3","s":"5","ap":"0","d":"1","desc":"sustained hits 2"}]},{"name":"Trygon scything talons","type":"Melee","profiles":[{"name":"Trygon scything talons","range":"Melee","type":"Melee","a":"12","bsWs":"3","s":"9","ap":"-2","d":"3","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Subterranean Tunnels","description":"In your Movement phase, when this model is set up on the battlefield using the Deep Strike ability, it can use a subterranean tunnel. If it does, this model can be set up anywhere on the battlefield that is more than 6\" horizontally away from all enemy units, but until the end of the turn, it is not eligible to declare a charge.","type":"Datasheet"}],"keywords":["Trygon","Vanguard Invader","Monster","Great Devourer","Burrower"],"factionKeywords":["Tyranids"],"composition":["1 Trygon"],"points":[{"models":"1 model","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000002691","name":"Tyranid Warriors With Melee Bio-weapons","role":"Other","loadout":"Every model is equipped with: Tyranid Warrior claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tyranid Warriors With Melee Bio-weapons","m":"6\"","t":"5","sv":"4+","invSv":"-","w":"3","ld":"7+","oc":"2"}],"weapons":[{"name":"Tyranid Warrior claws and talons","type":"Melee","profiles":[{"name":"Tyranid Warrior claws and talons","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"5","ap":"-2","d":"1","desc":"twin-linked"}]}],"abilities":[{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Adaptive Instincts","description":"At the start of the Fight phase, select one of the following: Aggression Imperative: Until the end of the phase, each time a model in this unit makes an attack, re-roll a Hit roll of 1.Bioregeneration: Until the end of the phase, each time a saving throw is made for a model in this unit, re-roll a saving throw of 1.","type":"Datasheet"}],"keywords":["Infantry","Tyranid Warriors with Melee Bio-weapons","Synapse","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Tyranid Prime","2-5 Tyranid Warriors"],"points":[{"models":"3 models","cost":"75"},{"models":"6 models","cost":"150"}],"canLead":[],"ledBy":["000002694"]},{"id":"000002692","name":"Tyranid Warriors With Ranged Bio-weapons","role":"Other","loadout":"Every model is equipped with: devourer; Tyranid Warrior claws and talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tyranid Warriors With Ranged Bio-weapons","m":"6\"","t":"5","sv":"4+","invSv":"-","w":"3","ld":"7+","oc":"2"}],"weapons":[{"name":"Barbed strangler","type":"Ranged","profiles":[{"name":"Barbed strangler","range":"36","type":"Ranged","a":"D6+1","bsWs":"4","s":"6","ap":"-1","d":"1","desc":"blast"}]},{"name":"Deathspitter","type":"Ranged","profiles":[{"name":"Deathspitter","range":"24","type":"Ranged","a":"3","bsWs":"4","s":"5","ap":"-1","d":"1","desc":null}]},{"name":"Devourer","type":"Ranged","profiles":[{"name":"Devourer","range":"18","type":"Ranged","a":"5","bsWs":"4","s":"4","ap":"0","d":"1","desc":null}]},{"name":"Spinefists","type":"Ranged","profiles":[{"name":"Spinefists","range":"12","type":"Ranged","a":"2","bsWs":"4","s":"4","ap":"0","d":"1","desc":"assault, pistol, twin-linked"}]},{"name":"Venom cannon","type":"Ranged","profiles":[{"name":"Venom cannon","range":"36","type":"Ranged","a":"D3","bsWs":"4","s":"9","ap":"-2","d":"2","desc":"blast"}]},{"name":"Tyranid Warrior claws and talons","type":"Melee","profiles":[{"name":"Tyranid Warrior claws and talons","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"5","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Adaptable Predators","description":"This unit is eligible to shoot and declare a charge in a turn in which it Fell Back.","type":"Datasheet"}],"keywords":["Synapse","Tyranid Warriors with Ranged Bio-weapons","Great Devourer","Infantry"],"factionKeywords":["Tyranids"],"composition":["1 Tyranid Prime","2-5 Tyranid Warriors"],"points":[{"models":"3 models","cost":"65"},{"models":"6 models","cost":"130"}],"canLead":[],"ledBy":["000002694"]},{"id":"000000489","name":"Tyrannocyte","role":"Dedicated Transports","loadout":"This model is equipped with: Tyrannocyte bio-weapons; flensing whips.","transport":"This model has a transport capacity of 20 Tyranids Infantry models, or 1 Tyranids Monster model with a Wounds characteristic of 12 or less. Each INFANTRY model with a Wounds characteristic of more than 1 takes up the space of 3 models.","damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tyrannocyte","m":"8\"","t":"9","sv":"3+","invSv":"-","w":"10","ld":"8+","oc":"2"}],"weapons":[{"name":"Tyrannocyte bio-weapons","type":"Ranged","profiles":[{"name":"Tyrannocyte bio-weapons","range":"24","type":"Ranged","a":"5","bsWs":"4","s":"5","ap":"-1","d":"2","desc":null}]},{"name":"Flensing whips","type":"Melee","profiles":[{"name":"Flensing whips","range":"Melee","type":"Melee","a":"6","bsWs":"4","s":"7","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Aerial Seeding","description":"This model must start the battle in Reserves, but neither it nor any units embarked within it are counted towards any limits placed on the maximum number of Reserves units you can start the battle with. This model can be set up in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules. Any units embarked within this model must immediately disembark after it has been set up on the battlefield, and they must be set up more than 9\" away from all enemy models. After this model has been set up on the battlefield, no units can embark within it.","type":"Datasheet"}],"keywords":["Monster","Fly","Transport","Tyrannocyte","Dedicated Transport","Vanguard Invader","Great Devourer"],"factionKeywords":["Tyranids"],"composition":["1 Tyrannocyte"],"points":[{"models":"1 model","cost":"105"}],"canLead":[],"ledBy":[]},{"id":"000000496","name":"Tyrannofex","role":"Other","loadout":"This model is equipped with: fleshborer hive; stinger salvoes; powerful limbs.","transport":null,"damagedW":"1-5","damagedDescription":"While this model has 1-5 wounds remaining, each time this model makes an attack, subtract 1 from the Hit roll.","leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tyrannofex","m":"9\"","t":"12","sv":"2+","invSv":"-","w":"16","ld":"8+","oc":"5"}],"weapons":[{"name":"Acid spray","type":"Ranged","profiles":[{"name":"Acid spray","range":"18","type":"Ranged","a":"D6+6","bsWs":"N/A","s":"6","ap":"-2","d":"2","desc":"torrent"}]},{"name":"Fleshborer hive","type":"Ranged","profiles":[{"name":"Fleshborer hive","range":"24","type":"Ranged","a":"20","bsWs":"3","s":"5","ap":"0","d":"1","desc":"heavy, sustained hits 1, twin-linked"}]},{"name":"Rupture cannon","type":"Ranged","profiles":[{"name":"Rupture cannon","range":"48","type":"Ranged","a":"2","bsWs":"3","s":"18","ap":"-4","d":"D6+6","desc":"heavy"}]},{"name":"Stinger salvoes","type":"Ranged","profiles":[{"name":"Stinger salvoes","range":"24","type":"Ranged","a":"8","bsWs":"3","s":"5","ap":"0","d":"1","desc":null}]},{"name":"Powerful limbs","type":"Melee","profiles":[{"name":"Powerful limbs","range":"Melee","type":"Melee","a":"4","bsWs":"3","s":"8","ap":"0","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Resilient Organism","description":"Once per battle, when an attack is allocated to this model, you can change the Damage characteristic of that attack to 0.","type":"Datasheet"}],"keywords":["Great Devourer","Monster","Tyrannofex"],"factionKeywords":["Tyranids"],"composition":["1 Tyrannofex"],"points":[{"models":"1 model","cost":"200"}],"canLead":[],"ledBy":[]},{"id":"000000471","name":"Tyrant Guard","role":"Other","loadout":"Every model is equipped with: scything talons and rending claws.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Tyrant Guard","m":"6\"","t":"8","sv":"3+","invSv":"-","w":"4","ld":"8+","oc":"1"}],"weapons":[{"name":"Bone cleaver, lash whip and rending claws","type":"Melee","profiles":[{"name":"Bone cleaver, lash whip and rending claws","range":"Melee","type":"Melee","a":"3","bsWs":"3","s":"5","ap":"-1","d":"2","desc":null}]},{"name":"Crushing claws and rending claws","type":"Melee","profiles":[{"name":"Crushing claws and rending claws","range":"Melee","type":"Melee","a":"2","bsWs":"4","s":"8","ap":"-2","d":"2","desc":"twin-linked"}]},{"name":"Scything talons and rending claws","type":"Melee","profiles":[{"name":"Scything talons and rending claws","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"5","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Guardian Organism","description":"While a Character model is leading this unit, that CHARACTER has the Feel No Pain 5+ ability.","type":"Datasheet"}],"keywords":["Infantry","Great Devourer","Tyrant Guard"],"factionKeywords":["Tyranids"],"composition":["3-6 Tyrant Guard"],"points":[{"models":"3 models","cost":"80"},{"models":"6 models","cost":"160"}],"canLead":[],"ledBy":["000000460","000000461","000002688"]},{"id":"000000476","name":"Venomthropes","role":"Other","loadout":"Every model is equipped with: toxic lashes.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Venomthropes","m":"6\"","t":"5","sv":"4+","invSv":"-","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Toxic lashes","type":"Melee","profiles":[{"name":"Toxic lashes","range":"Melee","type":"Melee","a":"5","bsWs":"3","s":"3","ap":"0","d":"1","desc":"anti-infantry 2+"}]}],"abilities":[{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Foul Spores (Aura)","description":"While a friendly TYRANIDS unit is within 6\" of this unit, each time a ranged attack targets that unit, models in that unit have the Benefit of Cover against that attack. In addition, while a friendly TYRANIDS unit (excluding Monsters) is within 6\" of this unit, models in that unit have the Stealth ability.","type":"Datasheet"}],"keywords":["Great Devourer","Venomthropes","Infantry","Fly"],"factionKeywords":["Tyranids"],"composition":["3-6 Venomthropes"],"points":[{"models":"3 models","cost":"70"},{"models":"6 models","cost":"140"}],"canLead":[],"ledBy":["000000499"]},{"id":"000002693","name":"Von Ryan’s Leapers","role":"Other","loadout":"Every model is equipped with: Leaper’s talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Von Ryan’s Leapers","m":"10\"","t":"5","sv":"4+","invSv":"6","w":"3","ld":"8+","oc":"1"}],"weapons":[{"name":"Leaper’s talons","type":"Melee","profiles":[{"name":"Leaper’s talons","range":"Melee","type":"Melee","a":"6","bsWs":"3","s":"5","ap":"-1","d":"1","desc":null}]}],"abilities":[{"name":"Fights First","description":"FIGHTS FIRSTSome warriors attack with blinding speed, landing their blows before their foes can react.Units with this ability that are eligible to fight do so in the Fights First step, provided every model in the unit has this ability.","type":"Core"},{"name":"Infiltrators","description":"INFILTRATORSMany armies employ reconnaissance units who can sit concealed, waiting for the right moment to strike.During deployment, if every model in a unit has this ability, then when you set it up, it can be set up anywhere on the battlefield that is more than 9\" horizontally away from the enemy deployment zone and all enemy models.","type":"Core"},{"name":"Stealth","description":"STEALTHSome warriors are masters of disguise and concealment.If every model in a unit has this ability, then each time a ranged attack is made against it, subtract 1 from that attack’s Hit roll.","type":"Core"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Pouncing Leap","description":"You can target this unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already used that Stratagem on a different unit this phase.","type":"Datasheet"}],"keywords":["Vanguard Invader","Great Devourer","Infantry","Von Ryan’s Leapers"],"factionKeywords":["Tyranids"],"composition":["3-6 Von Ryan’s Leapers"],"points":[{"models":"3 models","cost":"70"},{"models":"6 models","cost":"140"}],"canLead":[],"ledBy":[]},{"id":"000002528","name":"Winged Hive Tyrant","role":"Characters","loadout":"This model is equipped with: monstrous bonesword and lash whip; Tyrant talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Winged Hive Tyrant","m":"12\"","t":"9","sv":"2+","invSv":"4","w":"10","ld":"7+","oc":"3"}],"weapons":[{"name":"Heavy venom cannon","type":"Ranged","profiles":[{"name":"Heavy venom cannon","range":"36","type":"Ranged","a":"D3","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"blast"}]},{"name":"Stranglethorn cannon","type":"Ranged","profiles":[{"name":"Stranglethorn cannon","range":"36","type":"Ranged","a":"D6+1","bsWs":"2","s":"7","ap":"-1","d":"2","desc":"blast"}]},{"name":"Monstrous bonesword and lash whip","type":"Melee","profiles":[{"name":"Monstrous bonesword and lash whip","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"9","ap":"-2","d":"3","desc":"twin-linked"}]},{"name":"Monstrous scything talons","type":"Melee","profiles":[{"name":"Monstrous scything talons","range":"Melee","type":"Melee","a":"4","bsWs":"2","s":"7","ap":"-2","d":"2","desc":"extra attacks"}]},{"name":"Tyrant talons","type":"Melee","profiles":[{"name":"Tyrant talons","range":"Melee","type":"Melee","a":"5","bsWs":"2","s":"7","ap":"-2","d":"2","desc":null}]}],"abilities":[{"name":"Deadly Demise","description":"DEADLY DEMISEFrom detonating ammo stores to corrosive innards or frenzied death throes, some targets are deadly even in defeat.Some models have ‘Deadly Demise x’ listed in their abilities. When such a model is destroyed, roll one D6 before removing it from play (if such a model is a TRANSPORT, roll before any embarked models disembark). On a 6, each unit within 6\" of that model suffers a number of mortal wounds denoted by ‘x’ (if this is a random number, roll separately for each unit within 6\"). Example: A TRANSPORT model with the Deadly Demise D3 ability is destroyed. Before any models disembark and before removing it from play, its controlling player rolls one D6, getting a 6. There are three units within 6\" of that destroyed model, so its controlling player rolls one D3 for each of them, inflicting mortal wounds accordingly. Deadly Demise x: When this model is destroyed, roll one D6. On a 6, each unit within 6\" suffers ‘x’ mortal wounds.","type":"Core"},{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Will of the Hive Mind","description":"Once per battle round, one model from your army with this ability can use it when a friendly TYRANIDS unit within 12\" of that model is targeted with a Stratagem. If it does, reduce the CP cost of that usage of that Stratagem by 1CP.","type":"Datasheet"},{"name":"Paroxysm (Psychic)","description":"At the start of the Fight phase, you can select one enemy unit within 12\" of and visible to this model and roll one D6: on a 1, this PSYKER suffers D3 mortal wounds; on a 2+, until the end of the phase, subtract 1 from the Attacks characteristic of weapons equipped by models in that unit.","type":"Datasheet"}],"keywords":["Great Devourer","Fly","Hive Tyrant","Synapse","Monster","Winged Hive Tyrant","Vanguard Invader","Character","Psyker"],"factionKeywords":["Tyranids"],"composition":["1 Winged Hive Tyrant"],"points":[{"models":"1 model","cost":"170"}],"canLead":[],"ledBy":[]},{"id":"000002694","name":"Winged Tyranid Prime","role":"Characters","loadout":"This model is equipped with: Prime talons.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Winged Tyranid Prime","m":"12\"","t":"5","sv":"4+","invSv":"-","w":"6","ld":"7+","oc":"1"}],"weapons":[{"name":"Prime talons","type":"Melee","profiles":[{"name":"Prime talons","range":"Melee","type":"Melee","a":"6","bsWs":"2","s":"6","ap":"-1","d":"2","desc":null}]}],"abilities":[{"name":"Deep Strike","description":"DEEP STRIKESome units make their way to battle via tunnelling, teleportation, high-altitude descent or other extraordinary means that allow them to appear suddenly in the thick of the fighting.During the Declare Battle Formations step, if every model in a unit has this ability, you can set it up in Reserves instead of setting it up on the battlefield. If you do, in the Reinforcements step of one of your Movement phases you can set up this unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If a unit with the Deep Strike ability arrives from Strategic Reserves, the controlling player can choose for that unit to be set up either using the rules for Strategic Reserves or using the Deep Strike ability. Unit can be set up in Reserves instead of on the battlefield.Unit can be set up in your Reinforcements step, more than 9\" horizontally away from all enemy models.","type":"Core"},{"name":"Leader","description":"LEADERMighty heroes fight at the forefront of battle.Some CHARACTER units have ‘Leader’ listed on their datasheets. Such CHARACTER units are known as Leaders, and the units they can lead – known as their Bodyguard units – are listed on their datasheet. During the Declare Battle Formations step, for each Leader in your army, if your army also includes one or more of that Leader’s Bodyguard units, you can select one of those Bodyguard units. That Leader will then attach to that Bodyguard unit for the duration of the battle and is said to be leading that unit. Each Bodyguard unit can only have one Leader attached to it. While a Bodyguard unit contains a Leader, it is known as an Attached unit and, with the exception of rules that are triggered when units are destroyed, it is treated as a single unit for all rules purposes. Each time an attack targets an Attached unit, until the attacking unit has resolved all of its attacks, you must use the Toughness characteristic of the Bodyguard models in that unit, even if a Leader in that unit has a different Toughness characteristic. Each time an attack sucessfully wounds an Attached unit, that attack cannot be allocated to a CHARACTER model in that unit, even if that CHARACTER model has lost one or more wounds or has already had attacks allocated to it this phase. As soon as the last Bodyguard model in an Attached unit has been destroyed, any attacks made against that unit that have yet to be allocated can then be allocated to CHARACTER models in that unit. Each time the last model in a Bodyguard unit is destroyed, each CHARACTER unit that is part of that Attached unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time the last model in a CHARACTER unit that is attached to a Bodyguard unit is destroyed and there is not another CHARACTER unit attached, that Attached unit’s Bodyguard unit is no longer part of an Attached unit. It becomes a separate unit, with its original Starting Strength. If this happens as the result of an attack, they become separate units after the attacking unit has resolved all of its attacks. Each time a unit that is part of an Attached unit is destroyed, it does not have the keywords of any other units that make up that Attached unit (unless it has those keywords on its own datasheet) for the purposes of any rules that would be triggered when that unit is destroyed. Example: If you only destroy the Bodyguard unit that is part of an Attached unit, you have not destroyed a CHARACTER unit. If you only destroy the CHARACTER unit that is part of an Attached unit, or if you destroy the whole Attached unit, you have destroyed one CHARACTER unit. Before the battle, CHARACTER units with the Leader ability can be attached to one of their Bodyguard units to form an Attached unit.Attached units can only contain one Leader.Attacks cannot be allocated to CHARACTER models in Attached units.","type":"Core"},{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Alpha Warrior","description":"While this model is leading a unit, weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.","type":"Datasheet"},{"name":"Death Blow","description":"If this model is destroyed by a melee attack, if it has not fought this phase, roll one D6: on a 4+, do not remove it from play. The destroyed model can fight after the attacking model’s unit has finished making its attacks, and is then removed from play.","type":"Datasheet"}],"keywords":["Synapse","Great Devourer","Fly","Character","Infantry","Winged Tyranid Prime","Vanguard Invader"],"factionKeywords":["Tyranids"],"composition":["1 Winged Tyranid Prime"],"points":[{"models":"1 model","cost":"65"}],"canLead":["000002692","000002691","000000484"],"ledBy":[]},{"id":"000000475","name":"Zoanthropes","role":"Other","loadout":"Every model is equipped with: Warp Blast; chitinous claws and teeth.","transport":null,"damagedW":null,"damagedDescription":null,"leaderFooter":null,"isForgeWorld":false,"isLegends":false,"models":[{"name":"Zoanthropes","m":"5\"","t":"5","sv":"5+","invSv":"4","w":"3","ld":"7+","oc":"1"}],"weapons":[{"name":"Warp Blast – witchfire","type":"Ranged","profiles":[{"name":"Warp Blast – witchfire","range":"24","type":"Ranged","a":"D3","bsWs":"3","s":"7","ap":"-2","d":"D3","desc":"blast, psychic"}]},{"name":"Warp Blast – focused witchfire","type":"Ranged","profiles":[{"name":"Warp Blast – focused witchfire","range":"24","type":"Ranged","a":"1","bsWs":"3","s":"12","ap":"-3","d":"D6+1","desc":"lethal hits, psychic"}]},{"name":"Chitinous claws and teeth","type":"Melee","profiles":[{"name":"Chitinous claws and teeth","range":"Melee","type":"Melee","a":"2","bsWs":"5","s":"3","ap":"0","d":"1","desc":null}]}],"abilities":[{"name":"Shadow in the Warp","description":"If your Army Faction is TYRANIDS, once per battle, in either player’s Command phase, if one or more units from your army with this ability are on the battlefield, you can unleash the Shadow in the Warp. When you do, each enemy unit on the battlefield must take a Battle-shock test. Each time an enemy unit takes such a Battle-shock test, if it is within 6\" of one or more Synapse units from your army, subtract 1 from that test.","type":"Faction"},{"name":"Synapse","description":"If your Army Faction is TYRANIDS, while a TYRANIDS unit from your army is within 6\" of one or more friendly Synapse models, that TYRANIDS unit is said to be within Synapse Range of that model and of your army. While a TYRANIDS unit from your army is within Synapse Range of your army: Each time that unit takes a Battle-shock test, take that test on 3D6 instead of 2D6. Each time a model in that unit makes a melee attack, add 1 to the Strength characteristic of that attack.","type":"Faction"},{"name":"Spirit Leech (Aura, Psychic)","description":"While an enemy unit is within 6\" of this unit, if this unit contains a Neurothrope, each time that enemy unit fails a Battle-shock test, it suffers D3 mortal wounds and one model in this unit regains up to D3 lost wounds.","type":"Datasheet"},{"name":"Warp Field (Aura, Psychic)","description":"While a friendly Tyranids unit is within 6\" of this unit, models in that unit have a 6+ invulnerable save.","type":"Datasheet"}],"keywords":["Great Devourer","Fly","Psyker","Infantry","Zoanthropes","Synapse"],"factionKeywords":["Tyranids"],"composition":["1 Neurothrope","2-5 Zoanthropes"],"points":[{"models":"3 models","cost":"100"},{"models":"6 models","cost":"200"}],"canLead":[],"ledBy":["000002688"]}]}